<html><body>
<h4>Windows 10 x64 (18362.329)</h4><br>
<h2>_ALPC_COMPLETION_LIST</h2>
<font face="arial">   +0x000 Entry            : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 OwnerProcess     : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x018 CompletionListLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x020 Mdl              : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x028 UserVa           : Ptr64 Void<br>
   +0x030 UserLimit        : Ptr64 Void<br>
   +0x038 DataUserVa       : Ptr64 Void<br>
   +0x040 SystemVa         : Ptr64 Void<br>
   +0x048 TotalSize        : Uint8B<br>
   +0x050 Header           : Ptr64 <a href="./_ALPC_COMPLETION_LIST_HEADER.html">_ALPC_COMPLETION_LIST_HEADER</a><br>
   +0x058 List             : Ptr64 Void<br>
   +0x060 ListSize         : Uint8B<br>
   +0x068 Bitmap           : Ptr64 Void<br>
   +0x070 BitmapSize       : Uint8B<br>
   +0x078 Data             : Ptr64 Void<br>
   +0x080 DataSize         : Uint8B<br>
   +0x088 BitmapLimit      : Uint4B<br>
   +0x08c BitmapNextHint   : Uint4B<br>
   +0x090 ConcurrencyCount : Uint4B<br>
   +0x094 AttributeFlags   : Uint4B<br>
   +0x098 AttributeSize    : Uint4B<br>
</font></body></html>