<html><body>
<h4>Windows 10 x64 (18362.329)</h4><br>
<h2>_CM_KEY_NODE</h2>
<font face="arial">   +0x000 Signature        : Uint2B<br>
   +0x002 Flags            : Uint2B<br>
   +0x004 LastWriteTime    : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x00c AccessBits       : UChar<br>
   +0x00d LayerSemantics   : Pos 0, 2 Bits<br>
   +0x00d Spare1           : Pos 2, 5 Bits<br>
   +0x00d InheritClass     : Pos 7, 1 Bit<br>
   +0x00e Spare2           : Uint2B<br>
   +0x010 Parent           : Uint4B<br>
   +0x014 SubKeyCounts     : [2] Uint4B<br>
   +0x01c SubKeyLists      : [2] Uint4B<br>
   +0x024 ValueList        : <a href="./_CHILD_LIST.html">_CHILD_LIST</a><br>
   +0x01c ChildHiveReference : <a href="./_CM_KEY_REFERENCE.html">_CM_KEY_REFERENCE</a><br>
   +0x02c Security         : Uint4B<br>
   +0x030 Class            : Uint4B<br>
   +0x034 MaxNameLen       : Pos 0, 16 Bits<br>
   +0x034 UserFlags        : Pos 16, 4 Bits<br>
   +0x034 VirtControlFlags : Pos 20, 4 Bits<br>
   +0x034 Debug            : Pos 24, 8 Bits<br>
   +0x038 MaxClassLen      : Uint4B<br>
   +0x03c MaxValueNameLen  : Uint4B<br>
   +0x040 MaxValueDataLen  : Uint4B<br>
   +0x044 WorkVar          : Uint4B<br>
   +0x048 NameLength       : Uint2B<br>
   +0x04a ClassLength      : Uint2B<br>
   +0x04c Name             : [1] Wchar<br>
</font></body></html>