<html><body>
<h4>Windows 10 x64 (18362.329)</h4><br>
<h2>_DMA_IOMMU_INTERFACE</h2>
<font face="arial">   +0x000 Version          : Uint4B<br>
   +0x008 CreateDomain     : Ptr64     long <br>
   +0x010 DeleteDomain     : Ptr64     long <br>
   +0x018 AttachDevice     : Ptr64     long <br>
   +0x020 DetachDevice     : Ptr64     long <br>
   +0x028 FlushDomain      : Ptr64     long <br>
   +0x030 FlushDomainByVaList : Ptr64     long <br>
   +0x038 QueryInputMappings : Ptr64     long <br>
   +0x040 MapLogicalRange  : Ptr64     long <br>
   +0x048 UnmapLogicalRange : Ptr64     long <br>
   +0x050 MapIdentityRange : Ptr64     long <br>
   +0x058 UnmapIdentityRange : Ptr64     long <br>
   +0x060 SetDeviceFaultReporting : Ptr64     long <br>
   +0x068 ConfigureDomain  : Ptr64     long <br>
</font></body></html>