<html><body>
<h4>Windows 10 x64 (18362.329)</h4><br>
<h2>_ETW_REG_ENTRY</h2>
<font face="arial">   +0x000 RegList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 GroupRegList     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 GuidEntry        : Ptr64 <a href="./_ETW_GUID_ENTRY.html">_ETW_GUID_ENTRY</a><br>
   +0x028 GroupEntry       : Ptr64 <a href="./_ETW_GUID_ENTRY.html">_ETW_GUID_ENTRY</a><br>
   +0x030 ReplyQueue       : Ptr64 <a href="./_ETW_REPLY_QUEUE.html">_ETW_REPLY_QUEUE</a><br>
   +0x030 ReplySlot        : [4] Ptr64 <a href="./_ETW_QUEUE_ENTRY.html">_ETW_QUEUE_ENTRY</a><br>
   +0x030 Caller           : Ptr64 Void<br>
   +0x038 SessionId        : Uint4B<br>
   +0x050 Process          : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x050 CallbackContext  : Ptr64 Void<br>
   +0x058 Callback         : Ptr64 Void<br>
   +0x060 Index            : Uint2B<br>
   +0x062 Flags            : Uint2B<br>
   +0x062 DbgKernelRegistration : Pos 0, 1 Bit<br>
   +0x062 DbgUserRegistration : Pos 1, 1 Bit<br>
   +0x062 DbgReplyRegistration : Pos 2, 1 Bit<br>
   +0x062 DbgClassicRegistration : Pos 3, 1 Bit<br>
   +0x062 DbgSessionSpaceRegistration : Pos 4, 1 Bit<br>
   +0x062 DbgModernRegistration : Pos 5, 1 Bit<br>
   +0x062 DbgClosed        : Pos 6, 1 Bit<br>
   +0x062 DbgInserted      : Pos 7, 1 Bit<br>
   +0x062 DbgWow64         : Pos 8, 1 Bit<br>
   +0x062 DbgUseDescriptorType : Pos 9, 1 Bit<br>
   +0x062 DbgDropProviderTraits : Pos 10, 1 Bit<br>
   +0x064 EnableMask       : UChar<br>
   +0x065 GroupEnableMask  : UChar<br>
   +0x068 Traits           : Ptr64 <a href="./_ETW_PROVIDER_TRAITS.html">_ETW_PROVIDER_TRAITS</a><br>
</font></body></html>