<html><body>
<h4>Windows 10 x64 (18362.329)</h4><br>
<h2>_SEGMENT_HEAP</h2>
<font face="arial">   +0x000 EnvHandle        : <a href="./RTL_HP_ENV_HANDLE.html">RTL_HP_ENV_HANDLE</a><br>
   +0x010 Signature        : Uint4B<br>
   +0x014 GlobalFlags      : Uint4B<br>
   +0x018 Interceptor      : Uint4B<br>
   +0x01c ProcessHeapListIndex : Uint2B<br>
   +0x01e AllocatedFromMetadata : Pos 0, 1 Bit<br>
   +0x020 CommitLimitData  : <a href="./_RTL_HEAP_MEMORY_LIMIT_DATA.html">_RTL_HEAP_MEMORY_LIMIT_DATA</a><br>
   +0x020 ReservedMustBeZero1 : Uint8B<br>
   +0x028 UserContext      : Ptr64 Void<br>
   +0x030 ReservedMustBeZero2 : Uint8B<br>
   +0x038 Spare            : Ptr64 Void<br>
   +0x040 LargeMetadataLock : Uint8B<br>
   +0x048 LargeAllocMetadata : <a href="./_RTL_RB_TREE.html">_RTL_RB_TREE</a><br>
   +0x058 LargeReservedPages : Uint8B<br>
   +0x060 LargeCommittedPages : Uint8B<br>
   +0x068 StackTraceInitVar : <a href="./_RTL_RUN_ONCE.html">_RTL_RUN_ONCE</a><br>
   +0x080 MemStats         : <a href="./_HEAP_RUNTIME_MEMORY_STATS.html">_HEAP_RUNTIME_MEMORY_STATS</a><br>
   +0x0d8 GlobalLockCount  : Uint2B<br>
   +0x0dc GlobalLockOwner  : Uint4B<br>
   +0x0e0 ContextExtendLock : Uint8B<br>
   +0x0e8 AllocatedBase    : Ptr64 UChar<br>
   +0x0f0 UncommittedBase  : Ptr64 UChar<br>
   +0x0f8 ReservedLimit    : Ptr64 UChar<br>
   +0x100 SegContexts      : [2] <a href="./_HEAP_SEG_CONTEXT.html">_HEAP_SEG_CONTEXT</a><br>
   +0x280 VsContext        : <a href="./_HEAP_VS_CONTEXT.html">_HEAP_VS_CONTEXT</a><br>
   +0x340 LfhContext       : <a href="./_HEAP_LFH_CONTEXT.html">_HEAP_LFH_CONTEXT</a><br>
</font></body></html>