<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_EPROCESS</h2>
<font face="arial">   +0x000 Pcb              : <a href="./_KPROCESS.html">_KPROCESS</a><br>
   +0x2e0 ProcessLock      : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x2e8 UniqueProcessId  : Ptr64 Void<br>
   +0x2f0 ActiveProcessLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x300 RundownProtect   : <a href="./_EX_RUNDOWN_REF.html">_EX_RUNDOWN_REF</a><br>
   +0x308 Flags2           : Uint4B<br>
   +0x308 JobNotReallyActive : Pos 0, 1 Bit<br>
   +0x308 AccountingFolded : Pos 1, 1 Bit<br>
   +0x308 NewProcessReported : Pos 2, 1 Bit<br>
   +0x308 ExitProcessReported : Pos 3, 1 Bit<br>
   +0x308 ReportCommitChanges : Pos 4, 1 Bit<br>
   +0x308 LastReportMemory : Pos 5, 1 Bit<br>
   +0x308 ForceWakeCharge  : Pos 6, 1 Bit<br>
   +0x308 CrossSessionCreate : Pos 7, 1 Bit<br>
   +0x308 NeedsHandleRundown : Pos 8, 1 Bit<br>
   +0x308 RefTraceEnabled  : Pos 9, 1 Bit<br>
   +0x308 PicoCreated      : Pos 10, 1 Bit<br>
   +0x308 EmptyJobEvaluated : Pos 11, 1 Bit<br>
   +0x308 DefaultPagePriority : Pos 12, 3 Bits<br>
   +0x308 PrimaryTokenFrozen : Pos 15, 1 Bit<br>
   +0x308 ProcessVerifierTarget : Pos 16, 1 Bit<br>
   +0x308 RestrictSetThreadContext : Pos 17, 1 Bit<br>
   +0x308 AffinityPermanent : Pos 18, 1 Bit<br>
   +0x308 AffinityUpdateEnable : Pos 19, 1 Bit<br>
   +0x308 PropagateNode    : Pos 20, 1 Bit<br>
   +0x308 ExplicitAffinity : Pos 21, 1 Bit<br>
   +0x308 ProcessExecutionState : Pos 22, 2 Bits<br>
   +0x308 EnableReadVmLogging : Pos 24, 1 Bit<br>
   +0x308 EnableWriteVmLogging : Pos 25, 1 Bit<br>
   +0x308 FatalAccessTerminationRequested : Pos 26, 1 Bit<br>
   +0x308 DisableSystemAllowedCpuSet : Pos 27, 1 Bit<br>
   +0x308 ProcessStateChangeRequest : Pos 28, 2 Bits<br>
   +0x308 ProcessStateChangeInProgress : Pos 30, 1 Bit<br>
   +0x308 InPrivate        : Pos 31, 1 Bit<br>
   +0x30c Flags            : Uint4B<br>
   +0x30c CreateReported   : Pos 0, 1 Bit<br>
   +0x30c NoDebugInherit   : Pos 1, 1 Bit<br>
   +0x30c ProcessExiting   : Pos 2, 1 Bit<br>
   +0x30c ProcessDelete    : Pos 3, 1 Bit<br>
   +0x30c ManageExecutableMemoryWrites : Pos 4, 1 Bit<br>
   +0x30c VmDeleted        : Pos 5, 1 Bit<br>
   +0x30c OutswapEnabled   : Pos 6, 1 Bit<br>
   +0x30c Outswapped       : Pos 7, 1 Bit<br>
   +0x30c FailFastOnCommitFail : Pos 8, 1 Bit<br>
   +0x30c Wow64VaSpace4Gb  : Pos 9, 1 Bit<br>
   +0x30c AddressSpaceInitialized : Pos 10, 2 Bits<br>
   +0x30c SetTimerResolution : Pos 12, 1 Bit<br>
   +0x30c BreakOnTermination : Pos 13, 1 Bit<br>
   +0x30c DeprioritizeViews : Pos 14, 1 Bit<br>
   +0x30c WriteWatch       : Pos 15, 1 Bit<br>
   +0x30c ProcessInSession : Pos 16, 1 Bit<br>
   +0x30c OverrideAddressSpace : Pos 17, 1 Bit<br>
   +0x30c HasAddressSpace  : Pos 18, 1 Bit<br>
   +0x30c LaunchPrefetched : Pos 19, 1 Bit<br>
   +0x30c Background       : Pos 20, 1 Bit<br>
   +0x30c VmTopDown        : Pos 21, 1 Bit<br>
   +0x30c ImageNotifyDone  : Pos 22, 1 Bit<br>
   +0x30c PdeUpdateNeeded  : Pos 23, 1 Bit<br>
   +0x30c VdmAllowed       : Pos 24, 1 Bit<br>
   +0x30c ProcessRundown   : Pos 25, 1 Bit<br>
   +0x30c ProcessInserted  : Pos 26, 1 Bit<br>
   +0x30c DefaultIoPriority : Pos 27, 3 Bits<br>
   +0x30c ProcessSelfDelete : Pos 30, 1 Bit<br>
   +0x30c SetTimerResolutionLink : Pos 31, 1 Bit<br>
   +0x310 CreateTime       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x318 ProcessQuotaUsage : [2] Uint8B<br>
   +0x328 ProcessQuotaPeak : [2] Uint8B<br>
   +0x338 PeakVirtualSize  : Uint8B<br>
   +0x340 VirtualSize      : Uint8B<br>
   +0x348 SessionProcessLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x358 ExceptionPortData : Ptr64 Void<br>
   +0x358 ExceptionPortValue : Uint8B<br>
   +0x358 ExceptionPortState : Pos 0, 3 Bits<br>
   +0x360 Token            : <a href="./_EX_FAST_REF.html">_EX_FAST_REF</a><br>
   +0x368 MmReserved       : Uint8B<br>
   +0x370 AddressCreationLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x378 PageTableCommitmentLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x380 RotateInProgress : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x388 ForkInProgress   : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x390 CommitChargeJob  : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x398 CloneRoot        : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x3a0 NumberOfPrivatePages : Uint8B<br>
   +0x3a8 NumberOfLockedPages : Uint8B<br>
   +0x3b0 Win32Process     : Ptr64 Void<br>
   +0x3b8 Job              : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x3c0 SectionObject    : Ptr64 Void<br>
   +0x3c8 SectionBaseAddress : Ptr64 Void<br>
   +0x3d0 Cookie           : Uint4B<br>
   +0x3d8 WorkingSetWatch  : Ptr64 <a href="./_PAGEFAULT_HISTORY.html">_PAGEFAULT_HISTORY</a><br>
   +0x3e0 Win32WindowStation : Ptr64 Void<br>
   +0x3e8 InheritedFromUniqueProcessId : Ptr64 Void<br>
   +0x3f0 OwnerProcessId   : Uint8B<br>
   +0x3f8 Peb              : Ptr64 <a href="./_PEB.html">_PEB</a><br>
   +0x400 Session          : Ptr64 <a href="./_MM_SESSION_SPACE.html">_MM_SESSION_SPACE</a><br>
   +0x408 Spare1           : Ptr64 Void<br>
   +0x410 QuotaBlock       : Ptr64 <a href="./_EPROCESS_QUOTA_BLOCK.html">_EPROCESS_QUOTA_BLOCK</a><br>
   +0x418 ObjectTable      : Ptr64 <a href="./_HANDLE_TABLE.html">_HANDLE_TABLE</a><br>
   +0x420 DebugPort        : Ptr64 Void<br>
   +0x428 WoW64Process     : Ptr64 <a href="./_EWOW64PROCESS.html">_EWOW64PROCESS</a><br>
   +0x430 DeviceMap        : Ptr64 Void<br>
   +0x438 EtwDataSource    : Ptr64 Void<br>
   +0x440 PageDirectoryPte : Uint8B<br>
   +0x448 ImageFilePointer : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x450 ImageFileName    : [15] UChar<br>
   +0x45f PriorityClass    : UChar<br>
   +0x460 SecurityPort     : Ptr64 Void<br>
   +0x468 SeAuditProcessCreationInfo : <a href="./_SE_AUDIT_PROCESS_CREATION_INFO.html">_SE_AUDIT_PROCESS_CREATION_INFO</a><br>
   +0x470 JobLinks         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x480 HighestUserAddress : Ptr64 Void<br>
   +0x488 ThreadListHead   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x498 ActiveThreads    : Uint4B<br>
   +0x49c ImagePathHash    : Uint4B<br>
   +0x4a0 DefaultHardErrorProcessing : Uint4B<br>
   +0x4a4 LastThreadExitStatus : Int4B<br>
   +0x4a8 PrefetchTrace    : <a href="./_EX_FAST_REF.html">_EX_FAST_REF</a><br>
   +0x4b0 LockedPagesList  : Ptr64 Void<br>
   +0x4b8 ReadOperationCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4c0 WriteOperationCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4c8 OtherOperationCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4d0 ReadTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4d8 WriteTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4e0 OtherTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x4e8 CommitChargeLimit : Uint8B<br>
   +0x4f0 CommitCharge     : Uint8B<br>
   +0x4f8 CommitChargePeak : Uint8B<br>
   +0x500 Vm               : <a href="./_MMSUPPORT_FULL.html">_MMSUPPORT_FULL</a><br>
   +0x640 MmProcessLinks   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x650 ModifiedPageCount : Uint4B<br>
   +0x654 ExitStatus       : Int4B<br>
   +0x658 VadRoot          : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x660 VadHint          : Ptr64 Void<br>
   +0x668 VadCount         : Uint8B<br>
   +0x670 VadPhysicalPages : Uint8B<br>
   +0x678 VadPhysicalPagesLimit : Uint8B<br>
   +0x680 AlpcContext      : <a href="./_ALPC_PROCESS_CONTEXT.html">_ALPC_PROCESS_CONTEXT</a><br>
   +0x6a0 TimerResolutionLink : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x6b0 TimerResolutionStackRecord : Ptr64 <a href="./_PO_DIAG_STACK_RECORD.html">_PO_DIAG_STACK_RECORD</a><br>
   +0x6b8 RequestedTimerResolution : Uint4B<br>
   +0x6bc SmallestTimerResolution : Uint4B<br>
   +0x6c0 ExitTime         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x6c8 InvertedFunctionTable : Ptr64 <a href="./_INVERTED_FUNCTION_TABLE.html">_INVERTED_FUNCTION_TABLE</a><br>
   +0x6d0 InvertedFunctionTableLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x6d8 ActiveThreadsHighWatermark : Uint4B<br>
   +0x6dc LargePrivateVadCount : Uint4B<br>
   +0x6e0 ThreadListLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x6e8 WnfContext       : Ptr64 Void<br>
   +0x6f0 ServerSilo       : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x6f8 SignatureLevel   : UChar<br>
   +0x6f9 SectionSignatureLevel : UChar<br>
   +0x6fa Protection       : <a href="./_PS_PROTECTION.html">_PS_PROTECTION</a><br>
   +0x6fb HangCount        : Pos 0, 3 Bits<br>
   +0x6fb GhostCount       : Pos 3, 3 Bits<br>
   +0x6fb PrefilterException : Pos 6, 1 Bit<br>
   +0x6fc Flags3           : Uint4B<br>
   +0x6fc Minimal          : Pos 0, 1 Bit<br>
   +0x6fc ReplacingPageRoot : Pos 1, 1 Bit<br>
   +0x6fc Crashed          : Pos 2, 1 Bit<br>
   +0x6fc JobVadsAreTracked : Pos 3, 1 Bit<br>
   +0x6fc VadTrackingDisabled : Pos 4, 1 Bit<br>
   +0x6fc AuxiliaryProcess : Pos 5, 1 Bit<br>
   +0x6fc SubsystemProcess : Pos 6, 1 Bit<br>
   +0x6fc IndirectCpuSets  : Pos 7, 1 Bit<br>
   +0x6fc RelinquishedCommit : Pos 8, 1 Bit<br>
   +0x6fc HighGraphicsPriority : Pos 9, 1 Bit<br>
   +0x6fc CommitFailLogged : Pos 10, 1 Bit<br>
   +0x6fc ReserveFailLogged : Pos 11, 1 Bit<br>
   +0x6fc SystemProcess    : Pos 12, 1 Bit<br>
   +0x6fc HideImageBaseAddresses : Pos 13, 1 Bit<br>
   +0x6fc AddressPolicyFrozen : Pos 14, 1 Bit<br>
   +0x6fc ProcessFirstResume : Pos 15, 1 Bit<br>
   +0x6fc ForegroundExternal : Pos 16, 1 Bit<br>
   +0x6fc ForegroundSystem : Pos 17, 1 Bit<br>
   +0x6fc HighMemoryPriority : Pos 18, 1 Bit<br>
   +0x6fc EnableProcessSuspendResumeLogging : Pos 19, 1 Bit<br>
   +0x6fc EnableThreadSuspendResumeLogging : Pos 20, 1 Bit<br>
   +0x6fc SecurityDomainChanged : Pos 21, 1 Bit<br>
   +0x6fc SecurityFreezeComplete : Pos 22, 1 Bit<br>
   +0x6fc VmProcessorHost  : Pos 23, 1 Bit<br>
   +0x700 DeviceAsid       : Int4B<br>
   +0x708 SvmData          : Ptr64 Void<br>
   +0x710 SvmProcessLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x718 SvmLock          : Uint8B<br>
   +0x720 SvmProcessDeviceListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x730 LastFreezeInterruptTime : Uint8B<br>
   +0x738 DiskCounters     : Ptr64 <a href="./_PROCESS_DISK_COUNTERS.html">_PROCESS_DISK_COUNTERS</a><br>
   +0x740 PicoContext      : Ptr64 Void<br>
   +0x748 EnclaveTable     : Ptr64 Void<br>
   +0x750 EnclaveNumber    : Uint8B<br>
   +0x758 EnclaveLock      : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x760 HighPriorityFaultsAllowed : Uint4B<br>
   +0x768 EnergyContext    : Ptr64 <a href="./_PO_PROCESS_ENERGY_CONTEXT.html">_PO_PROCESS_ENERGY_CONTEXT</a><br>
   +0x770 VmContext        : Ptr64 Void<br>
   +0x778 SequenceNumber   : Uint8B<br>
   +0x780 CreateInterruptTime : Uint8B<br>
   +0x788 CreateUnbiasedInterruptTime : Uint8B<br>
   +0x790 TotalUnbiasedFrozenTime : Uint8B<br>
   +0x798 LastAppStateUpdateTime : Uint8B<br>
   +0x7a0 LastAppStateUptime : Pos 0, 61 Bits<br>
   +0x7a0 LastAppState     : Pos 61, 3 Bits<br>
   +0x7a8 SharedCommitCharge : Uint8B<br>
   +0x7b0 SharedCommitLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x7b8 SharedCommitLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x7c8 AllowedCpuSets   : Uint8B<br>
   +0x7d0 DefaultCpuSets   : Uint8B<br>
   +0x7c8 AllowedCpuSetsIndirect : Ptr64 Uint8B<br>
   +0x7d0 DefaultCpuSetsIndirect : Ptr64 Uint8B<br>
   +0x7d8 DiskIoAttribution : Ptr64 Void<br>
   +0x7e0 DxgProcess       : Ptr64 Void<br>
   +0x7e8 Win32KFilterSet  : Uint4B<br>
   +0x7f0 ProcessTimerDelay : <a href="./_PS_INTERLOCKED_TIMER_DELAY_VALUES.html">_PS_INTERLOCKED_TIMER_DELAY_VALUES</a><br>
   +0x7f8 KTimerSets       : Uint4B<br>
   +0x7fc KTimer2Sets      : Uint4B<br>
   +0x800 ThreadTimerSets  : Uint4B<br>
   +0x808 VirtualTimerListLock : Uint8B<br>
   +0x810 VirtualTimerListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x820 WakeChannel      : <a href="./_WNF_STATE_NAME.html">_WNF_STATE_NAME</a><br>
   +0x820 WakeInfo         : <a href="./_PS_PROCESS_WAKE_INFORMATION.html">_PS_PROCESS_WAKE_INFORMATION</a><br>
   +0x850 MitigationFlags  : Uint4B<br>
   +0x850 MitigationFlagsValues : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x854 MitigationFlags2 : Uint4B<br>
   +0x854 MitigationFlags2Values : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x858 PartitionObject  : Ptr64 Void<br>
   +0x860 SecurityDomain   : Uint8B<br>
   +0x868 ParentSecurityDomain : Uint8B<br>
   +0x870 CoverageSamplerContext : Ptr64 Void<br>
   +0x878 MmHotPatchContext : Ptr64 Void<br>
</font></body></html>