<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_ETW_SILODRIVERSTATE</h2>
<font face="arial">   +0x000 Silo             : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x008 SiloGlobals      : Ptr64 <a href="./_ESERVERSILO_GLOBALS.html">_ESERVERSILO_GLOBALS</a><br>
   +0x010 MaxLoggers       : Uint4B<br>
   +0x018 EtwpSecurityProviderGuidEntry : <a href="./_ETW_GUID_ENTRY.html">_ETW_GUID_ENTRY</a><br>
   +0x1a8 EtwpLoggerRundown : Ptr64 Ptr64 <a href="./_EX_RUNDOWN_REF_CACHE_AWARE.html">_EX_RUNDOWN_REF_CACHE_AWARE</a><br>
   +0x1b0 EtwpLoggerContext : Ptr64 Ptr64 <a href="./_WMI_LOGGER_CONTEXT.html">_WMI_LOGGER_CONTEXT</a><br>
   +0x1b8 EtwpGuidHashTable : [64] <a href="./_ETW_HASH_BUCKET.html">_ETW_HASH_BUCKET</a><br>
   +0xfb8 EtwpSecurityLoggers : [8] Uint2B<br>
   +0xfc8 EtwpSecurityProviderEnableMask : UChar<br>
   +0xfcc EtwpShutdownInProgress : Int4B<br>
   +0xfd0 EtwpSecurityProviderPID : Uint4B<br>
   +0xfd8 PrivHandleDemuxTable : <a href="./_ETW_PRIV_HANDLE_DEMUX_TABLE.html">_ETW_PRIV_HANDLE_DEMUX_TABLE</a><br>
   +0xff8 EtwpCounters     : <a href="./_ETW_COUNTERS.html">_ETW_COUNTERS</a><br>
   +0x1008 LogfileBytesWritten : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x1010 ProcessorBlocks  : Ptr64 <a href="./_ETW_SILO_TRACING_BLOCK.html">_ETW_SILO_TRACING_BLOCK</a><br>
   +0x1018 ContainerRestoreWnfSubscription : Ptr64 <a href="./_EX_WNF_SUBSCRIPTION.html">_EX_WNF_SUBSCRIPTION</a><br>
   +0x1020 PartitionId      : <a href="./_GUID.html">_GUID</a><br>
   +0x1030 ParentId         : <a href="./_GUID.html">_GUID</a><br>
   +0x1040 QpcOffsetFromRoot : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x1048 PartitionType    : Uint4B<br>
   +0x104c SystemLoggerSettings : <a href="./_ETW_SYSTEM_LOGGER_SETTINGS.html">_ETW_SYSTEM_LOGGER_SETTINGS</a><br>
   +0x11c0 EtwpStartTraceMutex : <a href="./_KMUTANT.html">_KMUTANT</a><br>
</font></body></html>