<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_HEAP_FAILURE_INFORMATION</h2>
<font face="arial">   +0x000 Version          : Uint4B<br>
   +0x004 StructureSize    : Uint4B<br>
   +0x008 FailureType      : <a href="./_HEAP_FAILURE_TYPE.html">_HEAP_FAILURE_TYPE</a><br>
   +0x010 HeapAddress      : Ptr64 Void<br>
   +0x018 Address          : Ptr64 Void<br>
   +0x020 Param1           : Ptr64 Void<br>
   +0x028 Param2           : Ptr64 Void<br>
   +0x030 Param3           : Ptr64 Void<br>
   +0x038 PreviousBlock    : Ptr64 Void<br>
   +0x040 NextBlock        : Ptr64 Void<br>
   +0x048 ExpectedDecodedEntry : <a href="./_FAKE_HEAP_ENTRY.html">_FAKE_HEAP_ENTRY</a><br>
   +0x058 StackTrace       : [32] Ptr64 Void<br>
   +0x158 HeapMajorVersion : UChar<br>
   +0x159 HeapMinorVersion : UChar<br>
   +0x160 ExceptionRecord  : <a href="./_EXCEPTION_RECORD.html">_EXCEPTION_RECORD</a><br>
   +0x200 ContextRecord    : <a href="./_CONTEXT.html">_CONTEXT</a><br>
</font></body></html>