<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_KPRCB</h2>
<font face="arial">   +0x000 MxCsr            : Uint4B<br>
   +0x004 LegacyNumber     : UChar<br>
   +0x005 ReservedMustBeZero : UChar<br>
   +0x006 InterruptRequest : UChar<br>
   +0x007 IdleHalt         : UChar<br>
   +0x008 CurrentThread    : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x010 NextThread       : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x018 IdleThread       : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x020 NestingLevel     : UChar<br>
   +0x021 ClockOwner       : UChar<br>
   +0x022 PendingTickFlags : UChar<br>
   +0x022 PendingTick      : Pos 0, 1 Bit<br>
   +0x022 PendingBackupTick : Pos 1, 1 Bit<br>
   +0x023 IdleState        : UChar<br>
   +0x024 Number           : Uint4B<br>
   +0x028 RspBase          : Uint8B<br>
   +0x030 PrcbLock         : Uint8B<br>
   +0x038 PriorityState    : Ptr64 Char<br>
   +0x040 CpuType          : Char<br>
   +0x041 CpuID            : Char<br>
   +0x042 CpuStep          : Uint2B<br>
   +0x042 CpuStepping      : UChar<br>
   +0x043 CpuModel         : UChar<br>
   +0x044 MHz              : Uint4B<br>
   +0x048 HalReserved      : [8] Uint8B<br>
   +0x088 MinorVersion     : Uint2B<br>
   +0x08a MajorVersion     : Uint2B<br>
   +0x08c BuildType        : UChar<br>
   +0x08d CpuVendor        : UChar<br>
   +0x08e CoresPerPhysicalProcessor : UChar<br>
   +0x08f LogicalProcessorsPerCore : UChar<br>
   +0x090 TscFrequency     : Uint8B<br>
   +0x098 PrcbPad04        : [5] Uint8B<br>
   +0x0c0 ParentNode       : Ptr64 <a href="./_KNODE.html">_KNODE</a><br>
   +0x0c8 GroupSetMember   : Uint8B<br>
   +0x0d0 Group            : UChar<br>
   +0x0d1 GroupIndex       : UChar<br>
   +0x0d2 PrcbPad05        : [2] UChar<br>
   +0x0d4 InitialApicId    : Uint4B<br>
   +0x0d8 ScbOffset        : Uint4B<br>
   +0x0dc ApicMask         : Uint4B<br>
   +0x0e0 AcpiReserved     : Ptr64 Void<br>
   +0x0e8 CFlushSize       : Uint4B<br>
   +0x0ec PrcbFlags        : <a href="./_KPRCBFLAG.html">_KPRCBFLAG</a><br>
   +0x0f0 TrappedSecurityDomain : Uint8B<br>
   +0x0f8 BpbState         : UChar<br>
   +0x0f8 BpbCpuIdle       : Pos 0, 1 Bit<br>
   +0x0f8 BpbFlushRsbOnTrap : Pos 1, 1 Bit<br>
   +0x0f8 BpbIbpbOnReturn  : Pos 2, 1 Bit<br>
   +0x0f8 BpbIbpbOnTrap    : Pos 3, 1 Bit<br>
   +0x0f8 BpbIbpbOnRetpolineExit : Pos 4, 1 Bit<br>
   +0x0f8 BpbStateReserved : Pos 5, 3 Bits<br>
   +0x0f9 BpbFeatures      : UChar<br>
   +0x0f9 BpbClearOnIdle   : Pos 0, 1 Bit<br>
   +0x0f9 BpbEnabled       : Pos 1, 1 Bit<br>
   +0x0f9 BpbSmep          : Pos 2, 1 Bit<br>
   +0x0f9 BpbFeaturesReserved : Pos 3, 5 Bits<br>
   +0x0fa BpbCurrentSpecCtrl : UChar<br>
   +0x0fb BpbKernelSpecCtrl : UChar<br>
   +0x0fc BpbNmiSpecCtrl   : UChar<br>
   +0x0fd BpbUserSpecCtrl  : UChar<br>
   +0x0fe PairRegister     : Int2B<br>
   +0x0f0 PrcbPad11        : [2] Uint8B<br>
   +0x100 ProcessorState   : <a href="./_KPROCESSOR_STATE.html">_KPROCESSOR_STATE</a><br>
   +0x6c0 ExtendedSupervisorState : Ptr64 <a href="./_XSAVE_AREA_HEADER.html">_XSAVE_AREA_HEADER</a><br>
   +0x6c8 ProcessorSignature : Uint4B<br>
   +0x6cc ProcessorFlags   : Uint4B<br>
   +0x6d0 BpbRetpolineExitSpecCtrl : UChar<br>
   +0x6d1 BpbTrappedRetpolineExitSpecCtrl : UChar<br>
   +0x6d2 BpbTrappedBpbState : UChar<br>
   +0x6d2 BpbTrappedCpuIdle : Pos 0, 1 Bit<br>
   +0x6d2 BpbTrappedFlushRsbOnTrap : Pos 1, 1 Bit<br>
   +0x6d2 BpbTrappedIbpbOnReturn : Pos 2, 1 Bit<br>
   +0x6d2 BpbTrappedIbpbOnTrap : Pos 3, 1 Bit<br>
   +0x6d2 BpbTrappedIbpbOnRetpolineExit : Pos 4, 1 Bit<br>
   +0x6d2 BpbtrappedBpbStateReserved : Pos 5, 3 Bits<br>
   +0x6d3 BpbRetpolineState : UChar<br>
   +0x6d3 BpbRunningNonRetpolineCode : Pos 0, 1 Bit<br>
   +0x6d3 BpbIndirectCallsSafe : Pos 1, 1 Bit<br>
   +0x6d3 BpbRetpolineEnabled : Pos 2, 1 Bit<br>
   +0x6d3 BpbRetpolineStateReserved : Pos 3, 5 Bits<br>
   +0x6d4 PrcbPad12b       : Uint4B<br>
   +0x6d0 PrcbPad12a       : Uint8B<br>
   +0x6d8 PrcbPad12        : [3] Uint8B<br>
   +0x6f0 LockQueue        : [17] <a href="./_KSPIN_LOCK_QUEUE.html">_KSPIN_LOCK_QUEUE</a><br>
   +0x800 PPLookasideList  : [16] <a href="./_PP_LOOKASIDE_LIST.html">_PP_LOOKASIDE_LIST</a><br>
   +0x900 PPNxPagedLookasideList : [32] <a href="./_GENERAL_LOOKASIDE_POOL.html">_GENERAL_LOOKASIDE_POOL</a><br>
   +0x1500 PPNPagedLookasideList : [32] <a href="./_GENERAL_LOOKASIDE_POOL.html">_GENERAL_LOOKASIDE_POOL</a><br>
   +0x2100 PPPagedLookasideList : [32] <a href="./_GENERAL_LOOKASIDE_POOL.html">_GENERAL_LOOKASIDE_POOL</a><br>
   +0x2d00 MsrIa32TsxCtrl   : Uint8B<br>
   +0x2d08 DeferredReadyListHead : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x2d10 MmPageFaultCount : Int4B<br>
   +0x2d14 MmCopyOnWriteCount : Int4B<br>
   +0x2d18 MmTransitionCount : Int4B<br>
   +0x2d1c MmDemandZeroCount : Int4B<br>
   +0x2d20 MmPageReadCount  : Int4B<br>
   +0x2d24 MmPageReadIoCount : Int4B<br>
   +0x2d28 MmDirtyPagesWriteCount : Int4B<br>
   +0x2d2c MmDirtyWriteIoCount : Int4B<br>
   +0x2d30 MmMappedPagesWriteCount : Int4B<br>
   +0x2d34 MmMappedWriteIoCount : Int4B<br>
   +0x2d38 KeSystemCalls    : Uint4B<br>
   +0x2d3c KeContextSwitches : Uint4B<br>
   +0x2d40 PrcbPad40        : Uint4B<br>
   +0x2d44 CcFastReadNoWait : Uint4B<br>
   +0x2d48 CcFastReadWait   : Uint4B<br>
   +0x2d4c CcFastReadNotPossible : Uint4B<br>
   +0x2d50 CcCopyReadNoWait : Uint4B<br>
   +0x2d54 CcCopyReadWait   : Uint4B<br>
   +0x2d58 CcCopyReadNoWaitMiss : Uint4B<br>
   +0x2d5c IoReadOperationCount : Int4B<br>
   +0x2d60 IoWriteOperationCount : Int4B<br>
   +0x2d64 IoOtherOperationCount : Int4B<br>
   +0x2d68 IoReadTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x2d70 IoWriteTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x2d78 IoOtherTransferCount : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x2d80 PacketBarrier    : Int4B<br>
   +0x2d84 TargetCount      : Int4B<br>
   +0x2d88 IpiFrozen        : Uint4B<br>
   +0x2d8c PrcbPad30        : Uint4B<br>
   +0x2d90 IsrDpcStats      : Ptr64 Void<br>
   +0x2d98 DeviceInterrupts : Uint4B<br>
   +0x2d9c LookasideIrpFloat : Int4B<br>
   +0x2da0 InterruptLastCount : Uint4B<br>
   +0x2da4 InterruptRate    : Uint4B<br>
   +0x2da8 LastNonHrTimerExpiration : Uint8B<br>
   +0x2db0 PairPrcb         : Ptr64 <a href="./_KPRCB.html">_KPRCB</a><br>
   +0x2db8 PrcbPad35        : [1] Uint8B<br>
   +0x2dc0 InterruptObjectPool : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x2dd0 PrcbPad41        : [6] Uint8B<br>
   +0x2e00 DpcData          : [2] <a href="./_KDPC_DATA.html">_KDPC_DATA</a><br>
   +0x2e50 DpcStack         : Ptr64 Void<br>
   +0x2e58 MaximumDpcQueueDepth : Int4B<br>
   +0x2e5c DpcRequestRate   : Uint4B<br>
   +0x2e60 MinimumDpcRate   : Uint4B<br>
   +0x2e64 DpcLastCount     : Uint4B<br>
   +0x2e68 ThreadDpcEnable  : UChar<br>
   +0x2e69 QuantumEnd       : UChar<br>
   +0x2e6a DpcRoutineActive : UChar<br>
   +0x2e6b IdleSchedule     : UChar<br>
   +0x2e6c DpcRequestSummary : Int4B<br>
   +0x2e6c DpcRequestSlot   : [2] Int2B<br>
   +0x2e6c NormalDpcState   : Int2B<br>
   +0x2e6e ThreadDpcState   : Int2B<br>
   +0x2e6c DpcNormalProcessingActive : Pos 0, 1 Bit<br>
   +0x2e6c DpcNormalProcessingRequested : Pos 1, 1 Bit<br>
   +0x2e6c DpcNormalThreadSignal : Pos 2, 1 Bit<br>
   +0x2e6c DpcNormalTimerExpiration : Pos 3, 1 Bit<br>
   +0x2e6c DpcNormalDpcPresent : Pos 4, 1 Bit<br>
   +0x2e6c DpcNormalLocalInterrupt : Pos 5, 1 Bit<br>
   +0x2e6c DpcNormalSpare   : Pos 6, 10 Bits<br>
   +0x2e6c DpcThreadActive  : Pos 16, 1 Bit<br>
   +0x2e6c DpcThreadRequested : Pos 17, 1 Bit<br>
   +0x2e6c DpcThreadSpare   : Pos 18, 14 Bits<br>
   +0x2e70 LastTimerHand    : Uint4B<br>
   +0x2e74 LastTick         : Uint4B<br>
   +0x2e78 ClockInterrupts  : Uint4B<br>
   +0x2e7c ReadyScanTick    : Uint4B<br>
   +0x2e80 InterruptObject  : [256] Ptr64 Void<br>
   +0x3680 TimerTable       : <a href="./_KTIMER_TABLE.html">_KTIMER_TABLE</a><br>
   +0x5880 DpcGate          : <a href="./_KGATE.html">_KGATE</a><br>
   +0x5898 PrcbPad52        : Ptr64 Void<br>
   +0x58a0 CallDpc          : <a href="./_KDPC.html">_KDPC</a><br>
   +0x58e0 ClockKeepAlive   : Int4B<br>
   +0x58e4 PrcbPad60        : [2] UChar<br>
   +0x58e6 NmiActive        : Uint2B<br>
   +0x58e8 DpcWatchdogPeriod : Int4B<br>
   +0x58ec DpcWatchdogCount : Int4B<br>
   +0x58f0 KeSpinLockOrdering : Int4B<br>
   +0x58f4 DpcWatchdogProfileCumulativeDpcThreshold : Uint4B<br>
   +0x58f8 CachedPtes       : Ptr64 Void<br>
   +0x5900 WaitListHead     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x5910 WaitLock         : Uint8B<br>
   +0x5918 ReadySummary     : Uint4B<br>
   +0x591c AffinitizedSelectionMask : Int4B<br>
   +0x5920 QueueIndex       : Uint4B<br>
   +0x5924 PrcbPad75        : [3] Uint4B<br>
   +0x5930 TimerExpirationDpc : <a href="./_KDPC.html">_KDPC</a><br>
   +0x5970 ScbQueue         : <a href="./_RTL_RB_TREE.html">_RTL_RB_TREE</a><br>
   +0x5980 DispatcherReadyListHead : [32] <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x5b80 InterruptCount   : Uint4B<br>
   +0x5b84 KernelTime       : Uint4B<br>
   +0x5b88 UserTime         : Uint4B<br>
   +0x5b8c DpcTime          : Uint4B<br>
   +0x5b90 InterruptTime    : Uint4B<br>
   +0x5b94 AdjustDpcThreshold : Uint4B<br>
   +0x5b98 DebuggerSavedIRQL : UChar<br>
   +0x5b99 GroupSchedulingOverQuota : UChar<br>
   +0x5b9a DeepSleep        : UChar<br>
   +0x5b9b PrcbPad80        : UChar<br>
   +0x5b9c DpcTimeCount     : Uint4B<br>
   +0x5ba0 DpcTimeLimit     : Uint4B<br>
   +0x5ba4 PeriodicCount    : Uint4B<br>
   +0x5ba8 PeriodicBias     : Uint4B<br>
   +0x5bac AvailableTime    : Uint4B<br>
   +0x5bb0 KeExceptionDispatchCount : Uint4B<br>
   +0x5bb4 ReadyThreadCount : Uint4B<br>
   +0x5bb8 ReadyQueueExpectedRunTime : Uint8B<br>
   +0x5bc0 StartCycles      : Uint8B<br>
   +0x5bc8 TaggedCyclesStart : Uint8B<br>
   +0x5bd0 TaggedCycles     : [2] Uint8B<br>
   +0x5be0 GenerationTarget : Uint8B<br>
   +0x5be8 AffinitizedCycles : Uint8B<br>
   +0x5bf0 ImportantCycles  : Uint8B<br>
   +0x5bf8 UnimportantCycles : Uint8B<br>
   +0x5c00 DpcWatchdogProfileSingleDpcThreshold : Uint4B<br>
   +0x5c04 MmSpinLockOrdering : Int4B<br>
   +0x5c08 CachedStack      : Ptr64 Void<br>
   +0x5c10 PageColor        : Uint4B<br>
   +0x5c14 NodeColor        : Uint4B<br>
   +0x5c18 NodeShiftedColor : Uint4B<br>
   +0x5c1c SecondaryColorMask : Uint4B<br>
   +0x5c20 PrcbPad81        : [6] UChar<br>
   +0x5c26 ExceptionStackActive : UChar<br>
   +0x5c27 TbFlushListActive : UChar<br>
   +0x5c28 ExceptionStack   : Ptr64 Void<br>
   +0x5c30 PrcbPad82        : [1] Uint8B<br>
   +0x5c38 CycleTime        : Uint8B<br>
   +0x5c40 Cycles           : [4] [2] Uint8B<br>
   +0x5c80 CcFastMdlReadNoWait : Uint4B<br>
   +0x5c84 CcFastMdlReadWait : Uint4B<br>
   +0x5c88 CcFastMdlReadNotPossible : Uint4B<br>
   +0x5c8c CcMapDataNoWait  : Uint4B<br>
   +0x5c90 CcMapDataWait    : Uint4B<br>
   +0x5c94 CcPinMappedDataCount : Uint4B<br>
   +0x5c98 CcPinReadNoWait  : Uint4B<br>
   +0x5c9c CcPinReadWait    : Uint4B<br>
   +0x5ca0 CcMdlReadNoWait  : Uint4B<br>
   +0x5ca4 CcMdlReadWait    : Uint4B<br>
   +0x5ca8 CcLazyWriteHotSpots : Uint4B<br>
   +0x5cac CcLazyWriteIos   : Uint4B<br>
   +0x5cb0 CcLazyWritePages : Uint4B<br>
   +0x5cb4 CcDataFlushes    : Uint4B<br>
   +0x5cb8 CcDataPages      : Uint4B<br>
   +0x5cbc CcLostDelayedWrites : Uint4B<br>
   +0x5cc0 CcFastReadResourceMiss : Uint4B<br>
   +0x5cc4 CcCopyReadWaitMiss : Uint4B<br>
   +0x5cc8 CcFastMdlReadResourceMiss : Uint4B<br>
   +0x5ccc CcMapDataNoWaitMiss : Uint4B<br>
   +0x5cd0 CcMapDataWaitMiss : Uint4B<br>
   +0x5cd4 CcPinReadNoWaitMiss : Uint4B<br>
   +0x5cd8 CcPinReadWaitMiss : Uint4B<br>
   +0x5cdc CcMdlReadNoWaitMiss : Uint4B<br>
   +0x5ce0 CcMdlReadWaitMiss : Uint4B<br>
   +0x5ce4 CcReadAheadIos   : Uint4B<br>
   +0x5ce8 MmCacheTransitionCount : Int4B<br>
   +0x5cec MmCacheReadCount : Int4B<br>
   +0x5cf0 MmCacheIoCount   : Int4B<br>
   +0x5cf4 PrcbPad91        : Uint4B<br>
   +0x5cf8 MmInternal       : Ptr64 Void<br>
   +0x5d00 PowerState       : <a href="./_PROCESSOR_POWER_STATE.html">_PROCESSOR_POWER_STATE</a><br>
   +0x5f00 HyperPte         : Ptr64 Void<br>
   +0x5f08 ScbList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x5f18 ForceIdleDpc     : <a href="./_KDPC.html">_KDPC</a><br>
   +0x5f58 DpcWatchdogDpc   : <a href="./_KDPC.html">_KDPC</a><br>
   +0x5f98 DpcWatchdogTimer : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x5fd8 Cache            : [5] <a href="./_CACHE_DESCRIPTOR.html">_CACHE_DESCRIPTOR</a><br>
   +0x6014 CacheCount       : Uint4B<br>
   +0x6018 CachedCommit     : Uint4B<br>
   +0x601c CachedResidentAvailable : Uint4B<br>
   +0x6020 WheaInfo         : Ptr64 Void<br>
   +0x6028 EtwSupport       : Ptr64 Void<br>
   +0x6030 ExSaPageArray    : Ptr64 Void<br>
   +0x6038 KeAlignmentFixupCount : Uint4B<br>
   +0x603c PrcbPad95        : Uint4B<br>
   +0x6040 HypercallPageList : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x6050 StatisticsPage   : Ptr64 Uint8B<br>
   +0x6058 PrcbPad85        : [5] Uint8B<br>
   +0x6080 HypercallCachedPages : Ptr64 Void<br>
   +0x6088 VirtualApicAssist : Ptr64 Void<br>
   +0x6090 PackageProcessorSet : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x6138 PackageId        : Uint4B<br>
   +0x613c PrcbPad86        : Uint4B<br>
   +0x6140 SharedReadyQueueMask : Uint8B<br>
   +0x6148 SharedReadyQueue : Ptr64 <a href="./_KSHARED_READY_QUEUE.html">_KSHARED_READY_QUEUE</a><br>
   +0x6150 SharedQueueScanOwner : Uint4B<br>
   +0x6154 ScanSiblingIndex : Uint4B<br>
   +0x6158 CoreProcessorSet : Uint8B<br>
   +0x6160 ScanSiblingMask  : Uint8B<br>
   +0x6168 LLCMask          : Uint8B<br>
   +0x6170 CacheProcessorMask : [5] Uint8B<br>
   +0x6198 ProcessorProfileControlArea : Ptr64 <a href="./_PROCESSOR_PROFILE_CONTROL_AREA.html">_PROCESSOR_PROFILE_CONTROL_AREA</a><br>
   +0x61a0 ProfileEventIndexAddress : Ptr64 Void<br>
   +0x61a8 DpcWatchdogProfile : Ptr64 Ptr64 Void<br>
   +0x61b0 DpcWatchdogProfileCurrentEmptyCapture : Ptr64 Ptr64 Void<br>
   +0x61b8 SchedulerAssist  : Ptr64 Void<br>
   +0x61c0 SynchCounters    : <a href="./_SYNCH_COUNTERS.html">_SYNCH_COUNTERS</a><br>
   +0x6278 PrcbPad94        : Uint8B<br>
   +0x6280 FsCounters       : <a href="./_FILESYSTEM_DISK_COUNTERS.html">_FILESYSTEM_DISK_COUNTERS</a><br>
   +0x6290 VendorString     : [13] UChar<br>
   +0x629d PrcbPad100       : [3] UChar<br>
   +0x62a0 FeatureBits      : Uint8B<br>
   +0x62a8 UpdateSignature  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x62b0 PteBitCache      : Uint8B<br>
   +0x62b8 PteBitOffset     : Uint4B<br>
   +0x62bc PrcbPad105       : Uint4B<br>
   +0x62c0 Context          : Ptr64 <a href="./_CONTEXT.html">_CONTEXT</a><br>
   +0x62c8 ContextFlagsInit : Uint4B<br>
   +0x62cc PrcbPad115       : Uint4B<br>
   +0x62d0 ExtendedState    : Ptr64 <a href="./_XSAVE_AREA.html">_XSAVE_AREA</a><br>
   +0x62d8 IsrStack         : Ptr64 Void<br>
   +0x62e0 EntropyTimingState : <a href="./_KENTROPY_TIMING_STATE.html">_KENTROPY_TIMING_STATE</a><br>
   +0x6430 PrcbPad110       : Uint8B<br>
   +0x6438 StibpPairingTrace : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x6470 AbSelfIoBoostsList : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x6478 AbPropagateBoostsList : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x6480 AbDpc            : <a href="./_KDPC.html">_KDPC</a><br>
   +0x64c0 IoIrpStackProfilerCurrent : <a href="./_IOP_IRP_STACK_PROFILER.html">_IOP_IRP_STACK_PROFILER</a><br>
   +0x6514 IoIrpStackProfilerPrevious : <a href="./_IOP_IRP_STACK_PROFILER.html">_IOP_IRP_STACK_PROFILER</a><br>
   +0x6568 SecureFault      : <a href="./_KSECURE_FAULT_INFORMATION.html">_KSECURE_FAULT_INFORMATION</a><br>
   +0x6578 PrcbPad120       : Uint8B<br>
   +0x6580 LocalSharedReadyQueue : <a href="./_KSHARED_READY_QUEUE.html">_KSHARED_READY_QUEUE</a><br>
   +0x67f0 PrcbPad125       : [2] Uint8B<br>
   +0x6800 TimerExpirationTraceCount : Uint4B<br>
   +0x6804 PrcbPad127       : Uint4B<br>
   +0x6808 TimerExpirationTrace : [16] <a href="./_KTIMER_EXPIRATION_TRACE.html">_KTIMER_EXPIRATION_TRACE</a><br>
   +0x6908 PrcbPad128       : [7] Uint8B<br>
   +0x6940 Mailbox          : Ptr64 <a href="./_REQUEST_MAILBOX.html">_REQUEST_MAILBOX</a><br>
   +0x6948 PrcbPad130       : [7] Uint8B<br>
   +0x6980 McheckContext    : [2] <a href="./_MACHINE_CHECK_CONTEXT.html">_MACHINE_CHECK_CONTEXT</a><br>
   +0x6a20 PrcbPad134       : [4] Uint8B<br>
   +0x6a40 SelfmapLockHandle : [4] <a href="./_KLOCK_QUEUE_HANDLE.html">_KLOCK_QUEUE_HANDLE</a><br>
   +0x6aa0 PrcbPad134a      : [4] Uint8B<br>
   +0x6ac0 PrcbPad138       : [896] UChar<br>
   +0x6e40 PrcbPad138a      : [64] UChar<br>
   +0x6e80 KernelDirectoryTableBase : Uint8B<br>
   +0x6e88 RspBaseShadow    : Uint8B<br>
   +0x6e90 UserRspShadow    : Uint8B<br>
   +0x6e98 ShadowFlags      : Uint4B<br>
   +0x6e9c PrcbPad138b      : Uint4B<br>
   +0x6ea0 PrcbPad138c      : Uint8B<br>
   +0x6ea8 PrcbPad138d      : Uint2B<br>
   +0x6eaa VerwSelector     : Uint2B<br>
   +0x6eac PrcbPad139       : Uint4B<br>
   +0x6eb0 DbgMceNestingLevel : Uint4B<br>
   +0x6eb4 DbgMceFlags      : Uint4B<br>
   +0x6eb8 PrcbPad140       : [505] Uint8B<br>
   +0x7e80 PrcbPad140a      : [8] Uint8B<br>
   +0x7ec0 PrcbPad141       : [504] Uint8B<br>
   +0x8e80 PrcbPad141a      : [64] UChar<br>
   +0x8ec0 RequestMailbox   : [1] <a href="./_REQUEST_MAILBOX.html">_REQUEST_MAILBOX</a><br>
</font></body></html>