<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_KTRANSACTION</h2>
<font face="arial">   +0x000 OutcomeEvent     : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x018 cookie           : Uint4B<br>
   +0x020 Mutex            : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x058 TreeTx           : Ptr64 <a href="./_KTRANSACTION.html">_KTRANSACTION</a><br>
   +0x060 GlobalNamespaceLink : <a href="./_KTMOBJECT_NAMESPACE_LINK.html">_KTMOBJECT_NAMESPACE_LINK</a><br>
   +0x088 TmNamespaceLink  : <a href="./_KTMOBJECT_NAMESPACE_LINK.html">_KTMOBJECT_NAMESPACE_LINK</a><br>
   +0x0b0 UOW              : <a href="./_GUID.html">_GUID</a><br>
   +0x0c0 State            : <a href="./_KTRANSACTION_STATE.html">_KTRANSACTION_STATE</a><br>
   +0x0c4 Flags            : Uint4B<br>
   +0x0c8 EnlistmentHead   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d8 EnlistmentCount  : Uint4B<br>
   +0x0dc RecoverableEnlistmentCount : Uint4B<br>
   +0x0e0 PrePrepareRequiredEnlistmentCount : Uint4B<br>
   +0x0e4 PrepareRequiredEnlistmentCount : Uint4B<br>
   +0x0e8 OutcomeRequiredEnlistmentCount : Uint4B<br>
   +0x0ec PendingResponses : Uint4B<br>
   +0x0f0 SuperiorEnlistment : Ptr64 <a href="./_KENLISTMENT.html">_KENLISTMENT</a><br>
   +0x0f8 LastLsn          : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x100 PromotedEntry    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x110 PromoterTransaction : Ptr64 <a href="./_KTRANSACTION.html">_KTRANSACTION</a><br>
   +0x118 PromotePropagation : Ptr64 Void<br>
   +0x120 IsolationLevel   : Uint4B<br>
   +0x124 IsolationFlags   : Uint4B<br>
   +0x128 Timeout          : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x130 Description      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x140 RollbackThread   : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x148 RollbackWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x168 RollbackDpc      : <a href="./_KDPC.html">_KDPC</a><br>
   +0x1a8 RollbackTimer    : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x1e8 LsnOrderedEntry  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x1f8 Outcome          : <a href="./_KTRANSACTION_OUTCOME.html">_KTRANSACTION_OUTCOME</a><br>
   +0x200 Tm               : Ptr64 <a href="./_KTM.html">_KTM</a><br>
   +0x208 CommitReservation : Int8B<br>
   +0x210 TransactionHistory : [10] <a href="./_KTRANSACTION_HISTORY.html">_KTRANSACTION_HISTORY</a><br>
   +0x260 TransactionHistoryCount : Uint4B<br>
   +0x268 DTCPrivateInformation : Ptr64 Void<br>
   +0x270 DTCPrivateInformationLength : Uint4B<br>
   +0x278 DTCPrivateInformationMutex : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x2b0 PromotedTxSelfHandle : Ptr64 Void<br>
   +0x2b8 PendingPromotionCount : Uint4B<br>
   +0x2c0 PromotionCompletedEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
</font></body></html>