<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_LDR_DATA_TABLE_ENTRY</h2>
<font face="arial">   +0x000 InLoadOrderLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 InMemoryOrderLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 InInitializationOrderLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x030 DllBase          : Ptr64 Void<br>
   +0x038 EntryPoint       : Ptr64 Void<br>
   +0x040 SizeOfImage      : Uint4B<br>
   +0x048 FullDllName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x058 BaseDllName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x068 FlagGroup        : [4] UChar<br>
   +0x068 Flags            : Uint4B<br>
   +0x068 PackagedBinary   : Pos 0, 1 Bit<br>
   +0x068 MarkedForRemoval : Pos 1, 1 Bit<br>
   +0x068 ImageDll         : Pos 2, 1 Bit<br>
   +0x068 LoadNotificationsSent : Pos 3, 1 Bit<br>
   +0x068 TelemetryEntryProcessed : Pos 4, 1 Bit<br>
   +0x068 ProcessStaticImport : Pos 5, 1 Bit<br>
   +0x068 InLegacyLists    : Pos 6, 1 Bit<br>
   +0x068 InIndexes        : Pos 7, 1 Bit<br>
   +0x068 ShimDll          : Pos 8, 1 Bit<br>
   +0x068 InExceptionTable : Pos 9, 1 Bit<br>
   +0x068 ReservedFlags1   : Pos 10, 2 Bits<br>
   +0x068 LoadInProgress   : Pos 12, 1 Bit<br>
   +0x068 LoadConfigProcessed : Pos 13, 1 Bit<br>
   +0x068 EntryProcessed   : Pos 14, 1 Bit<br>
   +0x068 ProtectDelayLoad : Pos 15, 1 Bit<br>
   +0x068 ReservedFlags3   : Pos 16, 2 Bits<br>
   +0x068 DontCallForThreads : Pos 18, 1 Bit<br>
   +0x068 ProcessAttachCalled : Pos 19, 1 Bit<br>
   +0x068 ProcessAttachFailed : Pos 20, 1 Bit<br>
   +0x068 CorDeferredValidate : Pos 21, 1 Bit<br>
   +0x068 CorImage         : Pos 22, 1 Bit<br>
   +0x068 DontRelocate     : Pos 23, 1 Bit<br>
   +0x068 CorILOnly        : Pos 24, 1 Bit<br>
   +0x068 ChpeImage        : Pos 25, 1 Bit<br>
   +0x068 ReservedFlags5   : Pos 26, 2 Bits<br>
   +0x068 Redirected       : Pos 28, 1 Bit<br>
   +0x068 ReservedFlags6   : Pos 29, 2 Bits<br>
   +0x068 CompatDatabaseProcessed : Pos 31, 1 Bit<br>
   +0x06c ObsoleteLoadCount : Uint2B<br>
   +0x06e TlsIndex         : Uint2B<br>
   +0x070 HashLinks        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x080 TimeDateStamp    : Uint4B<br>
   +0x088 EntryPointActivationContext : Ptr64 <a href="./_ACTIVATION_CONTEXT.html">_ACTIVATION_CONTEXT</a><br>
   +0x090 Lock             : Ptr64 Void<br>
   +0x098 DdagNode         : Ptr64 <a href="./_LDR_DDAG_NODE.html">_LDR_DDAG_NODE</a><br>
   +0x0a0 NodeModuleLink   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0b0 LoadContext      : Ptr64 <a href="./_LDRP_LOAD_CONTEXT.html">_LDRP_LOAD_CONTEXT</a><br>
   +0x0b8 ParentDllBase    : Ptr64 Void<br>
   +0x0c0 SwitchBackContext : Ptr64 Void<br>
   +0x0c8 BaseAddressIndexNode : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x0e0 MappingInfoIndexNode : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x0f8 OriginalBase     : Uint8B<br>
   +0x100 LoadTime         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x108 BaseNameHashValue : Uint4B<br>
   +0x10c LoadReason       : <a href="./_LDR_DLL_LOAD_REASON.html">_LDR_DLL_LOAD_REASON</a><br>
   +0x110 ImplicitPathOptions : Uint4B<br>
   +0x114 ReferenceCount   : Uint4B<br>
   +0x118 DependentLoadFlags : Uint4B<br>
   +0x11c SigningLevel     : UChar<br>
</font></body></html>