<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_MI_SYSTEM_PTE_TYPE</h2>
<font face="arial">   +0x000 Bitmap           : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x010 BasePte          : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x018 Flags            : Uint4B<br>
   +0x01c VaType           : <a href="./_MI_SYSTEM_VA_TYPE.html">_MI_SYSTEM_VA_TYPE</a><br>
   +0x020 FailureCount     : Ptr64 Uint4B<br>
   +0x028 PteFailures      : Uint4B<br>
   +0x030 SpinLock         : Uint8B<br>
   +0x030 GlobalPushLock   : Ptr64 <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x038 TotalSystemPtes  : Uint8B<br>
   +0x040 Hint             : Uint8B<br>
   +0x048 LowestBitEverAllocated : Uint8B<br>
   +0x050 CachedPtes       : Ptr64 <a href="./_MI_CACHED_PTES.html">_MI_CACHED_PTES</a><br>
   +0x058 TotalFreeSystemPtes : Uint8B<br>
</font></body></html>