<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_MI_VISIBLE_PARTITION</h2>
<font face="arial">   +0x000 LowestPhysicalPage : Uint8B<br>
   +0x008 HighestPhysicalPage : Uint8B<br>
   +0x010 NumberOfPhysicalPages : Uint8B<br>
   +0x018 NumberOfPagingFiles : Uint4B<br>
   +0x01c SystemCacheInitialized : UChar<br>
   +0x020 PagingFile       : [16] Ptr64 <a href="./_MMPAGING_FILE.html">_MMPAGING_FILE</a><br>
   +0x0c0 AvailablePages   : Uint8B<br>
   +0x100 ResidentAvailablePages : Uint8B<br>
   +0x140 PartitionWs      : [1] <a href="./_MMSUPPORT_INSTANCE.html">_MMSUPPORT_INSTANCE</a><br>
   +0x200 PartitionWorkingSetLists : [1] <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x228 TotalCommittedPages : Uint8B<br>
   +0x240 ModifiedPageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x280 ModifiedNoWritePageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x2a8 TotalCommitLimit : Uint8B<br>
   +0x2b0 TotalPagesForPagingFile : Uint8B<br>
   +0x2b8 VadPhysicalPages : Uint8B<br>
   +0x2c0 ProcessLockedFilePages : Uint8B<br>
   +0x2c8 SharedCommit     : Uint8B<br>
   +0x2d0 SlabAllocatorPages : Uint8B<br>
   +0x2d8 ChargeCommitmentFailures : [4] Uint4B<br>
   +0x2e8 PageFileTraceIndex : Int4B<br>
   +0x2f0 PageFileTraces   : [32] <a href="./_MI_PAGEFILE_TRACES.html">_MI_PAGEFILE_TRACES</a><br>
</font></body></html>