<html><body>
<h4>Windows 10 x64 (18363.535)</h4><br>
<h2>_PROCESS_ENERGY_VALUES_EXTENSION</h2>
<font face="arial">   +0x000 Timelines        : [14] <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x000 CpuTimeline      : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x008 DiskTimeline     : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x010 NetworkTimeline  : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x018 MBBTimeline      : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x020 ForegroundTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x028 DesktopVisibleTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x030 CompositionRenderedTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x038 CompositionDirtyGeneratedTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x040 CompositionDirtyPropagatedTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x048 InputTimeline    : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x050 AudioInTimeline  : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x058 AudioOutTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x060 DisplayRequiredTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x068 KeyboardInputTimeline : <a href="./_TIMELINE_BITMAP.html">_TIMELINE_BITMAP</a><br>
   +0x070 Durations        : [5] <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x070 InputDuration    : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x078 AudioInDuration  : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x080 AudioOutDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x088 DisplayRequiredDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x090 PSMBackgroundDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x098 KeyboardInput    : Uint4B<br>
   +0x09c MouseInput       : Uint4B<br>
</font></body></html>