<html><body>
<h4>Windows 10 x64 (18363.592)</h4><br>
<h2>_HV_X64_HYPERVISOR_FEATURES</h2>
<font face="arial">   +0x000 PartitionPrivileges : <a href="./_HV_PARTITION_PRIVILEGE_MASK.html">_HV_PARTITION_PRIVILEGE_MASK</a><br>
   +0x008 MaxSupportedCState : Pos 0, 4 Bits<br>
   +0x008 HpetNeededForC3PowerState_Deprecated : Pos 4, 1 Bit<br>
   +0x008 Reserved         : Pos 5, 27 Bits<br>
   +0x00c MwaitAvailable_Deprecated : Pos 0, 1 Bit<br>
   +0x00c GuestDebuggingAvailable : Pos 1, 1 Bit<br>
   +0x00c PerformanceMonitorsAvailable : Pos 2, 1 Bit<br>
   +0x00c CpuDynamicPartitioningAvailable : Pos 3, 1 Bit<br>
   +0x00c XmmRegistersForFastHypercallAvailable : Pos 4, 1 Bit<br>
   +0x00c GuestIdleAvailable : Pos 5, 1 Bit<br>
   +0x00c HypervisorSleepStateSupportAvailable : Pos 6, 1 Bit<br>
   +0x00c NumaDistanceQueryAvailable : Pos 7, 1 Bit<br>
   +0x00c FrequencyRegsAvailable : Pos 8, 1 Bit<br>
   +0x00c SyntheticMachineCheckAvailable : Pos 9, 1 Bit<br>
   +0x00c GuestCrashRegsAvailable : Pos 10, 1 Bit<br>
   +0x00c DebugRegsAvailable : Pos 11, 1 Bit<br>
   +0x00c Npiep1Available  : Pos 12, 1 Bit<br>
   +0x00c DisableHypervisorAvailable : Pos 13, 1 Bit<br>
   +0x00c ExtendedGvaRangesForFlushVirtualAddressListAvailable : Pos 14, 1 Bit<br>
   +0x00c FastHypercallOutputAvailable : Pos 15, 1 Bit<br>
   +0x00c SvmFeaturesAvailable : Pos 16, 1 Bit<br>
   +0x00c SintPollingModeAvailable : Pos 17, 1 Bit<br>
   +0x00c HypercallMsrLockAvailable : Pos 18, 1 Bit<br>
   +0x00c DirectSyntheticTimers : Pos 19, 1 Bit<br>
   +0x00c RegisterPatAvailable : Pos 20, 1 Bit<br>
   +0x00c RegisterBndcfgsAvailable : Pos 21, 1 Bit<br>
   +0x00c WatchdogTimerAvailable : Pos 22, 1 Bit<br>
   +0x00c SyntheticTimeUnhaltedTimerAvailable : Pos 23, 1 Bit<br>
   +0x00c DeviceDomainsAvailable : Pos 24, 1 Bit<br>
   +0x00c S1DeviceDomainsAvailable : Pos 25, 1 Bit<br>
   +0x00c LbrAvailable     : Pos 26, 1 Bit<br>
   +0x00c IptAvailable     : Pos 27, 1 Bit<br>
   +0x00c CrossVtlFlushAvailable : Pos 28, 1 Bit<br>
   +0x00c Reserved1        : Pos 29, 3 Bits<br>
</font></body></html>