<html><body>
<h4>Windows 10 x64 (18363.592)</h4><br>
<h2>_KUSER_SHARED_DATA</h2>
<font face="arial">   +0x000 TickCountLowDeprecated : Uint4B<br>
   +0x004 TickCountMultiplier : Uint4B<br>
   +0x008 InterruptTime    : <a href="./_KSYSTEM_TIME.html">_KSYSTEM_TIME</a><br>
   +0x014 SystemTime       : <a href="./_KSYSTEM_TIME.html">_KSYSTEM_TIME</a><br>
   +0x020 TimeZoneBias     : <a href="./_KSYSTEM_TIME.html">_KSYSTEM_TIME</a><br>
   +0x02c ImageNumberLow   : Uint2B<br>
   +0x02e ImageNumberHigh  : Uint2B<br>
   +0x030 NtSystemRoot     : [260] Wchar<br>
   +0x238 MaxStackTraceDepth : Uint4B<br>
   +0x23c CryptoExponent   : Uint4B<br>
   +0x240 TimeZoneId       : Uint4B<br>
   +0x244 LargePageMinimum : Uint4B<br>
   +0x248 AitSamplingValue : Uint4B<br>
   +0x24c AppCompatFlag    : Uint4B<br>
   +0x250 RNGSeedVersion   : Uint8B<br>
   +0x258 GlobalValidationRunlevel : Uint4B<br>
   +0x25c TimeZoneBiasStamp : Int4B<br>
   +0x260 NtBuildNumber    : Uint4B<br>
   +0x264 NtProductType    : <a href="./_NT_PRODUCT_TYPE.html">_NT_PRODUCT_TYPE</a><br>
   +0x268 ProductTypeIsValid : UChar<br>
   +0x269 Reserved0        : [1] UChar<br>
   +0x26a NativeProcessorArchitecture : Uint2B<br>
   +0x26c NtMajorVersion   : Uint4B<br>
   +0x270 NtMinorVersion   : Uint4B<br>
   +0x274 ProcessorFeatures : [64] UChar<br>
   +0x2b4 Reserved1        : Uint4B<br>
   +0x2b8 Reserved3        : Uint4B<br>
   +0x2bc TimeSlip         : Uint4B<br>
   +0x2c0 AlternativeArchitecture : <a href="./_ALTERNATIVE_ARCHITECTURE_TYPE.html">_ALTERNATIVE_ARCHITECTURE_TYPE</a><br>
   +0x2c4 BootId           : Uint4B<br>
   +0x2c8 SystemExpirationDate : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x2d0 SuiteMask        : Uint4B<br>
   +0x2d4 KdDebuggerEnabled : UChar<br>
   +0x2d5 MitigationPolicies : UChar<br>
   +0x2d5 NXSupportPolicy  : Pos 0, 2 Bits<br>
   +0x2d5 SEHValidationPolicy : Pos 2, 2 Bits<br>
   +0x2d5 CurDirDevicesSkippedForDlls : Pos 4, 2 Bits<br>
   +0x2d5 Reserved         : Pos 6, 2 Bits<br>
   +0x2d6 CyclesPerYield   : Uint2B<br>
   +0x2d8 ActiveConsoleId  : Uint4B<br>
   +0x2dc DismountCount    : Uint4B<br>
   +0x2e0 ComPlusPackage   : Uint4B<br>
   +0x2e4 LastSystemRITEventTickCount : Uint4B<br>
   +0x2e8 NumberOfPhysicalPages : Uint4B<br>
   +0x2ec SafeBootMode     : UChar<br>
   +0x2ed VirtualizationFlags : UChar<br>
   +0x2ee Reserved12       : [2] UChar<br>
   +0x2f0 SharedDataFlags  : Uint4B<br>
   +0x2f0 DbgErrorPortPresent : Pos 0, 1 Bit<br>
   +0x2f0 DbgElevationEnabled : Pos 1, 1 Bit<br>
   +0x2f0 DbgVirtEnabled   : Pos 2, 1 Bit<br>
   +0x2f0 DbgInstallerDetectEnabled : Pos 3, 1 Bit<br>
   +0x2f0 DbgLkgEnabled    : Pos 4, 1 Bit<br>
   +0x2f0 DbgDynProcessorEnabled : Pos 5, 1 Bit<br>
   +0x2f0 DbgConsoleBrokerEnabled : Pos 6, 1 Bit<br>
   +0x2f0 DbgSecureBootEnabled : Pos 7, 1 Bit<br>
   +0x2f0 DbgMultiSessionSku : Pos 8, 1 Bit<br>
   +0x2f0 DbgMultiUsersInSessionSku : Pos 9, 1 Bit<br>
   +0x2f0 DbgStateSeparationEnabled : Pos 10, 1 Bit<br>
   +0x2f0 SpareBits        : Pos 11, 21 Bits<br>
   +0x2f4 DataFlagsPad     : [1] Uint4B<br>
   +0x2f8 TestRetInstruction : Uint8B<br>
   +0x300 QpcFrequency     : Int8B<br>
   +0x308 SystemCall       : Uint4B<br>
   +0x30c SystemCallPad0   : Uint4B<br>
   +0x310 SystemCallPad    : [2] Uint8B<br>
   +0x320 TickCount        : <a href="./_KSYSTEM_TIME.html">_KSYSTEM_TIME</a><br>
   +0x320 TickCountQuad    : Uint8B<br>
   +0x320 ReservedTickCountOverlay : [3] Uint4B<br>
   +0x32c TickCountPad     : [1] Uint4B<br>
   +0x330 Cookie           : Uint4B<br>
   +0x334 CookiePad        : [1] Uint4B<br>
   +0x338 ConsoleSessionForegroundProcessId : Int8B<br>
   +0x340 TimeUpdateLock   : Uint8B<br>
   +0x348 BaselineSystemTimeQpc : Uint8B<br>
   +0x350 BaselineInterruptTimeQpc : Uint8B<br>
   +0x358 QpcSystemTimeIncrement : Uint8B<br>
   +0x360 QpcInterruptTimeIncrement : Uint8B<br>
   +0x368 QpcSystemTimeIncrementShift : UChar<br>
   +0x369 QpcInterruptTimeIncrementShift : UChar<br>
   +0x36a UnparkedProcessorCount : Uint2B<br>
   +0x36c EnclaveFeatureMask : [4] Uint4B<br>
   +0x37c TelemetryCoverageRound : Uint4B<br>
   +0x380 UserModeGlobalLogger : [16] Uint2B<br>
   +0x3a0 ImageFileExecutionOptions : Uint4B<br>
   +0x3a4 LangGenerationCount : Uint4B<br>
   +0x3a8 Reserved4        : Uint8B<br>
   +0x3b0 InterruptTimeBias : Uint8B<br>
   +0x3b8 QpcBias          : Uint8B<br>
   +0x3c0 ActiveProcessorCount : Uint4B<br>
   +0x3c4 ActiveGroupCount : UChar<br>
   +0x3c5 Reserved9        : UChar<br>
   +0x3c6 QpcData          : Uint2B<br>
   +0x3c6 QpcBypassEnabled : UChar<br>
   +0x3c7 QpcShift         : UChar<br>
   +0x3c8 TimeZoneBiasEffectiveStart : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x3d0 TimeZoneBiasEffectiveEnd : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x3d8 XState           : <a href="./_XSTATE_CONFIGURATION.html">_XSTATE_CONFIGURATION</a><br>
</font></body></html>