<html><body>
<h4>Windows 10 x64 (18363.592)</h4><br>
<h2>_PEP_ACPI_EXTENDED_ADDRESS</h2>
<font face="arial">   +0x000 Type             : <a href="./_PEP_ACPI_RESOURCE_TYPE.html">_PEP_ACPI_RESOURCE_TYPE</a><br>
   +0x004 Flags            : <a href="./_PEP_ACPI_RESOURCE_FLAGS.html">_PEP_ACPI_RESOURCE_FLAGS</a><br>
   +0x008 ResourceFlags    : UChar<br>
   +0x009 GeneralFlags     : UChar<br>
   +0x00a TypeSpecificFlags : UChar<br>
   +0x00b RevisionId       : UChar<br>
   +0x00c Reserved         : UChar<br>
   +0x010 Granularity      : Uint8B<br>
   +0x018 MinimumAddress   : Uint8B<br>
   +0x020 MaximumAddress   : Uint8B<br>
   +0x028 TranslationAddress : Uint8B<br>
   +0x030 AddressLength    : Uint8B<br>
   +0x038 TypeAttribute    : Uint8B<br>
   +0x040 DescriptorName   : Ptr64 <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>