<html><body>
<h4>Windows 10 x64 (18363.592)</h4><br>
<h2>_PO_HIBER_PERF</h2>
<font face="arial">   +0x000 HiberIoTicks     : Uint8B<br>
   +0x008 HiberIoCpuTicks  : Uint8B<br>
   +0x010 HiberInitTicks   : Uint8B<br>
   +0x018 HiberHiberFileTicks : Uint8B<br>
   +0x020 HiberCompressTicks : Uint8B<br>
   +0x028 HiberSharedBufferTicks : Uint8B<br>
   +0x030 HiberChecksumTicks : Uint8B<br>
   +0x038 HiberChecksumIoTicks : Uint8B<br>
   +0x040 TotalHibernateTime : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x048 HibernateCompleteTimestamp : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x050 POSTTime         : Uint4B<br>
   +0x054 ResumeBootMgrTime : Uint4B<br>
   +0x058 BootmgrUserInputTime : Uint4B<br>
   +0x060 ResumeAppTicks   : Uint8B<br>
   +0x068 ResumeAppStartTimestamp : Uint8B<br>
   +0x070 ResumeLibraryInitTicks : Uint8B<br>
   +0x078 ResumeInitTicks  : Uint8B<br>
   +0x080 ResumeRestoreImageStartTimestamp : Uint8B<br>
   +0x088 ResumeHiberFileTicks : Uint8B<br>
   +0x090 ResumeIoTicks    : Uint8B<br>
   +0x098 ResumeDecompressTicks : Uint8B<br>
   +0x0a0 ResumeAllocateTicks : Uint8B<br>
   +0x0a8 ResumeUserInOutTicks : Uint8B<br>
   +0x0b0 ResumeMapTicks   : Uint8B<br>
   +0x0b8 ResumeUnmapTicks : Uint8B<br>
   +0x0c0 ResumeChecksumTicks : Uint8B<br>
   +0x0c8 ResumeChecksumIoTicks : Uint8B<br>
   +0x0d0 ResumeKernelSwitchTimestamp : Uint8B<br>
   +0x0d8 CyclesPerMs      : Uint8B<br>
   +0x0e0 WriteLogDataTimestamp : Uint8B<br>
   +0x0e8 KernelReturnFromHandler : Uint8B<br>
   +0x0f0 TimeStampCounterAtSwitchTime : Uint8B<br>
   +0x0f8 HalTscOffset     : Uint8B<br>
   +0x100 HvlTscOffset     : Uint8B<br>
   +0x108 SleeperThreadEnd : Uint8B<br>
   +0x110 PostCmosUpdateTimestamp : Uint8B<br>
   +0x118 KernelReturnSystemPowerStateTimestamp : Uint8B<br>
   +0x120 IoBoundedness    : Uint8B<br>
   +0x128 KernelDecompressTicks : Uint8B<br>
   +0x130 KernelIoTicks    : Uint8B<br>
   +0x138 KernelCopyTicks  : Uint8B<br>
   +0x140 ReadCheckCount   : Uint8B<br>
   +0x148 KernelInitTicks  : Uint8B<br>
   +0x150 KernelResumeHiberFileTicks : Uint8B<br>
   +0x158 KernelIoCpuTicks : Uint8B<br>
   +0x160 KernelSharedBufferTicks : Uint8B<br>
   +0x168 KernelAnimationTicks : Uint8B<br>
   +0x170 KernelChecksumTicks : Uint8B<br>
   +0x178 KernelChecksumIoTicks : Uint8B<br>
   +0x180 AnimationStart   : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x188 AnimationStop    : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x190 DeviceResumeTime : Uint4B<br>
   +0x198 SecurePagesProcessed : Uint8B<br>
   +0x1a0 BootPagesProcessed : Uint8B<br>
   +0x1a8 KernelPagesProcessed : Uint8B<br>
   +0x1b0 BootBytesWritten : Uint8B<br>
   +0x1b8 KernelBytesWritten : Uint8B<br>
   +0x1c0 BootPagesWritten : Uint8B<br>
   +0x1c8 KernelPagesWritten : Uint8B<br>
   +0x1d0 BytesWritten     : Uint8B<br>
   +0x1d8 PagesWritten     : Uint4B<br>
   +0x1dc FileRuns         : Uint4B<br>
   +0x1e0 NoMultiStageResumeReason : Uint4B<br>
   +0x1e4 MaxHuffRatio     : Uint4B<br>
   +0x1e8 AdjustedTotalResumeTime : Uint8B<br>
   +0x1f0 ResumeCompleteTimestamp : Uint8B<br>
</font></body></html>