<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_IRP</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Uint2B<br>
   +0x004 AllocationProcessorNumber : Uint2B<br>
   +0x006 Reserved         : Uint2B<br>
   +0x008 MdlAddress       : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x010 Flags            : Uint4B<br>
   +0x018 AssociatedIrp    : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x020 ThreadListEntry  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x030 IoStatus         : <a href="./_IO_STATUS_BLOCK.html">_IO_STATUS_BLOCK</a><br>
   +0x040 RequestorMode    : Char<br>
   +0x041 PendingReturned  : UChar<br>
   +0x042 StackCount       : Char<br>
   +0x043 CurrentLocation  : Char<br>
   +0x044 Cancel           : UChar<br>
   +0x045 CancelIrql       : UChar<br>
   +0x046 ApcEnvironment   : Char<br>
   +0x047 AllocationFlags  : UChar<br>
   +0x048 UserIosb         : Ptr64 <a href="./_IO_STATUS_BLOCK.html">_IO_STATUS_BLOCK</a><br>
   +0x050 UserEvent        : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x058 Overlay          : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x068 CancelRoutine    : Ptr64     void <br>
   +0x070 UserBuffer       : Ptr64 Void<br>
   +0x078 Tail             : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>