<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_MCI_STATUS_AMD_BITS</h2>
<font face="arial">   +0x000 McaErrorCode     : Pos 0, 16 Bits<br>
   +0x000 ModelErrorCode   : Pos 16, 16 Bits<br>
   +0x000 ImplementationSpecific2 : Pos 32, 11 Bits<br>
   +0x000 Poison           : Pos 43, 1 Bit<br>
   +0x000 Deferred         : Pos 44, 1 Bit<br>
   +0x000 ImplementationSpecific1 : Pos 45, 12 Bits<br>
   +0x000 ContextCorrupt   : Pos 57, 1 Bit<br>
   +0x000 AddressValid     : Pos 58, 1 Bit<br>
   +0x000 MiscValid        : Pos 59, 1 Bit<br>
   +0x000 ErrorEnabled     : Pos 60, 1 Bit<br>
   +0x000 UncorrectedError : Pos 61, 1 Bit<br>
   +0x000 StatusOverFlow   : Pos 62, 1 Bit<br>
   +0x000 Valid            : Pos 63, 1 Bit<br>
</font></body></html>