<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_POP_HIBER_CONTEXT</h2>
<font face="arial">   +0x000 Reset            : UChar<br>
   +0x001 HiberFlags       : UChar<br>
   +0x002 WroteHiberFile   : UChar<br>
   +0x003 KernelPhaseVerificationActive : UChar<br>
   +0x004 InitializationFinished : UChar<br>
   +0x008 NextTableLockHeld : Int4B<br>
   +0x00c BootPhaseFinishedBarrier : Int4B<br>
   +0x010 KernelResumeFinishedBarrier : Int4B<br>
   +0x014 HvCaptureReadyBarrier : Int4B<br>
   +0x018 HvCaptureCompletedBarrier : Int4B<br>
   +0x01c MapFrozen        : UChar<br>
   +0x020 DiscardMap       : <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x020 KernelPhaseMap   : <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x030 BootPhaseMap     : <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x040 ClonedRanges     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x050 ClonedRangeCount : Uint4B<br>
   +0x058 ClonedPageCount  : Uint8B<br>
   +0x060 CurrentMap       : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x068 NextCloneRange   : Ptr64 <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x070 NextPreserve     : Uint8B<br>
   +0x078 LoaderMdl        : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x080 AllocatedMdl     : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x088 PagesOut         : Uint8B<br>
   +0x090 IoPages          : Ptr64 Void<br>
   +0x098 IoPagesCount     : Uint4B<br>
   +0x0a0 CurrentMcb       : Ptr64 Void<br>
   +0x0a8 DumpStack        : Ptr64 <a href="./_DUMP_STACK_CONTEXT.html">_DUMP_STACK_CONTEXT</a><br>
   +0x0b0 WakeState        : Ptr64 <a href="./_KPROCESSOR_STATE.html">_KPROCESSOR_STATE</a><br>
   +0x0b8 IoProgress       : Uint4B<br>
   +0x0bc Status           : Int4B<br>
   +0x0c0 GraphicsProc     : Uint4B<br>
   +0x0c8 MemoryImage      : Ptr64 <a href="./PO_MEMORY_IMAGE.html">PO_MEMORY_IMAGE</a><br>
   +0x0d0 PerformanceStats : Ptr64 Uint4B<br>
   +0x0d8 BootLoaderLogMdl : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x0e0 FirmwareRuntimeInformationMdl : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x0e8 FirmwareRuntimeInformationVa : Ptr64 Void<br>
   +0x0f0 ResumeContext    : Ptr64 Void<br>
   +0x0f8 ResumeContextPages : Uint4B<br>
   +0x0fc SecurePages      : Uint4B<br>
   +0x100 ProcessorCount   : Uint4B<br>
   +0x108 ProcessorContext : Ptr64 <a href="./_POP_PER_PROCESSOR_CONTEXT.html">_POP_PER_PROCESSOR_CONTEXT</a><br>
   +0x110 ProdConsBuffer   : Ptr64 Char<br>
   +0x118 ProdConsSize     : Uint4B<br>
   +0x11c MaxDataPages     : Uint4B<br>
   +0x120 ExtraBuffer      : Ptr64 Void<br>
   +0x128 ExtraBufferSize  : Uint8B<br>
   +0x130 ExtraMapVa       : Ptr64 Void<br>
   +0x138 BitlockerKeyPFN  : Uint8B<br>
   +0x140 IoInfo           : <a href="./_POP_IO_INFO.html">_POP_IO_INFO</a><br>
   +0x1b0 IoChecksums      : Ptr64 Wchar<br>
   +0x1b8 IoChecksumsSize  : Uint8B<br>
   +0x1c0 HardwareConfigurationSignature : Uint4B<br>
   +0x1c4 IumEnabled       : UChar<br>
   +0x1c5 SecureBoot       : UChar<br>
</font></body></html>