<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_PPM_PLATFORM_STATE</h2>
<font face="arial">   +0x000 LevelId          : Uint8B<br>
   +0x008 Latency          : Uint4B<br>
   +0x00c BreakEvenDuration : Uint4B<br>
   +0x010 VetoAccounting   : <a href="./_PPM_VETO_ACCOUNTING.html">_PPM_VETO_ACCOUNTING</a><br>
   +0x038 TransitionDebugger : UChar<br>
   +0x039 Platform         : UChar<br>
   +0x03c DependencyListCount : Uint4B<br>
   +0x040 Processors       : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0e8 Name             : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0f8 DependencyLists  : Ptr64 <a href="./_PPM_SELECTION_DEPENDENCY.html">_PPM_SELECTION_DEPENDENCY</a><br>
   +0x100 Synchronization  : <a href="./_PPM_COORDINATED_SYNCHRONIZATION.html">_PPM_COORDINATED_SYNCHRONIZATION</a><br>
   +0x108 EnterTime        : Uint8B<br>
   +0x140 RefCount         : Int4B<br>
   +0x140 CacheAlign0      : [64] UChar<br>
</font></body></html>