<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_PROC_PERF_DOMAIN</h2>
<font face="arial">   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Master           : Ptr64 <a href="./_PROC_PERF_CHECK_CONTEXT.html">_PROC_PERF_CHECK_CONTEXT</a><br>
   +0x018 Members          : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0c0 DomainContext    : Uint8B<br>
   +0x0c8 ProcessorCount   : Uint4B<br>
   +0x0cc EfficiencyClass  : UChar<br>
   +0x0cd NominalPerformanceClass : UChar<br>
   +0x0ce HighestPerformanceClass : UChar<br>
   +0x0d0 Presence         : <a href="./_PROCESSOR_PRESENCE.html">_PROCESSOR_PRESENCE</a><br>
   +0x0d8 Processors       : Ptr64 <a href="./_PROC_PERF_CONSTRAINT.html">_PROC_PERF_CONSTRAINT</a><br>
   +0x0e0 GetFFHThrottleState : Ptr64     void <br>
   +0x0e8 TimeWindowHandler : Ptr64     void <br>
   +0x0f0 BoostPolicyHandler : Ptr64     void <br>
   +0x0f8 BoostModeHandler : Ptr64     void <br>
   +0x100 AutonomousActivityWindowHandler : Ptr64     void <br>
   +0x108 AutonomousModeHandler : Ptr64     void <br>
   +0x110 ReinitializeHandler : Ptr64     void <br>
   +0x118 PerfSelectionHandler : Ptr64     unsigned long <br>
   +0x120 PerfControlHandler : Ptr64     void <br>
   +0x128 PerfControlHandlerHidden : Ptr64     void <br>
   +0x130 DomainPerfControlHandler : Ptr64     void <br>
   +0x138 MaxFrequency     : Uint4B<br>
   +0x13c NominalFrequency : Uint4B<br>
   +0x140 MaxPercent       : Uint4B<br>
   +0x144 MinPerfPercent   : Uint4B<br>
   +0x148 MinThrottlePercent : Uint4B<br>
   +0x14c AdvertizedMaximumFrequency : Uint4B<br>
   +0x150 MinimumRelativePerformance : Uint8B<br>
   +0x158 NominalRelativePerformance : Uint8B<br>
   +0x160 NominalRelativePerformancePercent : UChar<br>
   +0x161 Coordination     : UChar<br>
   +0x162 HardPlatformCap  : UChar<br>
   +0x163 AffinitizeControl : UChar<br>
   +0x164 EfficientThrottle : UChar<br>
   +0x165 AllowSchedulerDirectedPerfStates : UChar<br>
   +0x166 InitiateAllProcessors : UChar<br>
   +0x167 AutonomousMode   : UChar<br>
   +0x168 ProvideGuidance  : UChar<br>
   +0x16c DesiredPercent   : Uint4B<br>
   +0x170 GuaranteedPercent : Uint4B<br>
   +0x174 EngageResponsivenessOverrides : UChar<br>
   +0x178 QosPolicies      : [5] <a href="./_PROC_PERF_QOS_CLASS_POLICY.html">_PROC_PERF_QOS_CLASS_POLICY</a><br>
   +0x204 QosDisableReasons : [5] Uint4B<br>
   +0x218 QosEquivalencyMasks : [5] Uint2B<br>
   +0x222 QosSupported     : UChar<br>
   +0x224 SelectionGeneration : Uint4B<br>
   +0x228 QosSelection     : [5] <a href="./_PERF_CONTROL_STATE_SELECTION.html">_PERF_CONTROL_STATE_SELECTION</a><br>
   +0x2f0 PerfChangeTime   : Uint8B<br>
   +0x2f8 PerfChangeIntervalCount : Uint4B<br>
   +0x2fc Force            : UChar<br>
   +0x2fd Update           : UChar<br>
   +0x2fe Apply            : UChar<br>
</font></body></html>