<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_RTL_USER_PROCESS_PARAMETERS</h2>
<font face="arial">   +0x000 MaximumLength    : Uint4B<br>
   +0x004 Length           : Uint4B<br>
   +0x008 Flags            : Uint4B<br>
   +0x00c DebugFlags       : Uint4B<br>
   +0x010 ConsoleHandle    : Ptr64 Void<br>
   +0x018 ConsoleFlags     : Uint4B<br>
   +0x020 StandardInput    : Ptr64 Void<br>
   +0x028 StandardOutput   : Ptr64 Void<br>
   +0x030 StandardError    : Ptr64 Void<br>
   +0x038 CurrentDirectory : <a href="./_CURDIR.html">_CURDIR</a><br>
   +0x050 DllPath          : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x060 ImagePathName    : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x070 CommandLine      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x080 Environment      : Ptr64 Void<br>
   +0x088 StartingX        : Uint4B<br>
   +0x08c StartingY        : Uint4B<br>
   +0x090 CountX           : Uint4B<br>
   +0x094 CountY           : Uint4B<br>
   +0x098 CountCharsX      : Uint4B<br>
   +0x09c CountCharsY      : Uint4B<br>
   +0x0a0 FillAttribute    : Uint4B<br>
   +0x0a4 WindowFlags      : Uint4B<br>
   +0x0a8 ShowWindowFlags  : Uint4B<br>
   +0x0b0 WindowTitle      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0c0 DesktopInfo      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0d0 ShellInfo        : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0e0 RuntimeData      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0f0 CurrentDirectores : [32] <a href="./_RTL_DRIVE_LETTER_CURDIR.html">_RTL_DRIVE_LETTER_CURDIR</a><br>
   +0x3f0 EnvironmentSize  : Uint8B<br>
   +0x3f8 EnvironmentVersion : Uint8B<br>
   +0x400 PackageDependencyData : Ptr64 Void<br>
   +0x408 ProcessGroupId   : Uint4B<br>
   +0x40c LoaderThreads    : Uint4B<br>
   +0x410 RedirectionDllName : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x420 HeapPartitionName : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x430 DefaultThreadpoolCpuSetMasks : Ptr64 Uint8B<br>
   +0x438 DefaultThreadpoolCpuSetMaskCount : Uint4B<br>
   +0x43c DefaultThreadpoolThreadMaximum : Uint4B<br>
</font></body></html>