<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_SEGMENT_FLAGS</h2>
<font face="arial">   +0x000 TotalNumberOfPtes4132 : Pos 0, 10 Bits<br>
   +0x000 Spare0           : Pos 10, 1 Bit<br>
   +0x000 SessionDriverProtos : Pos 11, 1 Bit<br>
   +0x000 LargePages       : Pos 12, 1 Bit<br>
   +0x000 DebugSymbolsLoaded : Pos 13, 1 Bit<br>
   +0x000 WriteCombined    : Pos 14, 1 Bit<br>
   +0x000 NoCache          : Pos 15, 1 Bit<br>
   +0x000 Short0           : Uint2B<br>
   +0x002 ImageCetShadowStacksReady : Pos 0, 1 Bit<br>
   +0x002 DefaultProtectionMask : Pos 1, 5 Bits<br>
   +0x002 Binary32         : Pos 6, 1 Bit<br>
   +0x002 ContainsDebug    : Pos 7, 1 Bit<br>
   +0x002 UChar1           : UChar<br>
   +0x003 ForceCollision   : Pos 0, 1 Bit<br>
   +0x003 ImageSigningType : Pos 1, 3 Bits<br>
   +0x003 ImageSigningLevel : Pos 4, 4 Bits<br>
   +0x003 UChar2           : UChar<br>
</font></body></html>