<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>_WNF_NAME_INSTANCE</h2>
<font face="arial">   +0x000 Header           : <a href="./_WNF_NODE_HEADER.html">_WNF_NODE_HEADER</a><br>
   +0x008 RunRef           : <a href="./_EX_RUNDOWN_REF.html">_EX_RUNDOWN_REF</a><br>
   +0x010 TreeLinks        : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x028 StateName        : <a href="./_WNF_STATE_NAME_STRUCT.html">_WNF_STATE_NAME_STRUCT</a><br>
   +0x030 ScopeInstance    : Ptr64 <a href="./_WNF_SCOPE_INSTANCE.html">_WNF_SCOPE_INSTANCE</a><br>
   +0x038 StateNameInfo    : <a href="./_WNF_STATE_NAME_REGISTRATION.html">_WNF_STATE_NAME_REGISTRATION</a><br>
   +0x050 StateDataLock    : <a href="./_WNF_LOCK.html">_WNF_LOCK</a><br>
   +0x058 StateData        : Ptr64 <a href="./_WNF_STATE_DATA.html">_WNF_STATE_DATA</a><br>
   +0x060 CurrentChangeStamp : Uint4B<br>
   +0x068 PermanentDataStore : Ptr64 Void<br>
   +0x070 StateSubscriptionListLock : <a href="./_WNF_LOCK.html">_WNF_LOCK</a><br>
   +0x078 StateSubscriptionListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x088 TemporaryNameListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x098 CreatorProcess   : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x0a0 DataSubscribersCount : Int4B<br>
   +0x0a4 CurrentDeliveryCount : Int4B<br>
</font></body></html>