<html><body>
<h4>Windows 10 x64 (19041.572)</h4><br>
<h2>wil_details_StagingConfig</h2>
<font face="arial">   +0x000 store            : <a href="./wil_FeatureStore.html">wil_FeatureStore</a><br>
   +0x004 forUpdate        : Int4B<br>
   +0x008 readChangeStamp  : Uint4B<br>
   +0x00c readVersion      : UChar<br>
   +0x010 modified         : Int4B<br>
   +0x018 header           : Ptr64 <a href="./wil_details_StagingConfigHeader.html">wil_details_StagingConfigHeader</a><br>
   +0x020 features         : Ptr64 <a href="./wil_details_StagingConfigFeature.html">wil_details_StagingConfigFeature</a><br>
   +0x028 triggers         : Ptr64 <a href="./wil_details_StagingConfigUsageTrigger.html">wil_details_StagingConfigUsageTrigger</a><br>
   +0x030 changedInSession : Int4B<br>
   +0x038 buffer           : Ptr64 Void<br>
   +0x040 bufferSize       : Uint8B<br>
   +0x048 bufferAlloc      : Uint8B<br>
   +0x050 bufferOwned      : Int4B<br>
</font></body></html>