<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_CM_RM</h2>
<font face="arial">   +0x000 RmListEntry      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 TransactionListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 TmHandle         : Ptr64 Void<br>
   +0x028 Tm               : Ptr64 Void<br>
   +0x030 RmHandle         : Ptr64 Void<br>
   +0x038 KtmRm            : Ptr64 Void<br>
   +0x040 RefCount         : Uint4B<br>
   +0x044 ContainerNum     : Uint4B<br>
   +0x048 ContainerSize    : Uint8B<br>
   +0x050 CmHive           : Ptr64 <a href="./_CMHIVE.html">_CMHIVE</a><br>
   +0x058 LogFileObject    : Ptr64 Void<br>
   +0x060 MarshallingContext : Ptr64 Void<br>
   +0x068 RmFlags          : Uint4B<br>
   +0x06c LogStartStatus1  : Int4B<br>
   +0x070 LogStartStatus2  : Int4B<br>
   +0x078 BaseLsn          : Uint8B<br>
   +0x080 RmLock           : Ptr64 <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
</font></body></html>