<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_HEAP_VAMGR_ALLOCATOR</h2>
<font face="arial">   +0x000 TreeLock         : Uint8B<br>
   +0x008 FreeRanges       : <a href="./_RTL_RB_TREE.html">_RTL_RB_TREE</a><br>
   +0x018 VaSpace          : Ptr64 <a href="./_HEAP_VAMGR_VASPACE.html">_HEAP_VAMGR_VASPACE</a><br>
   +0x020 PartitionHandle  : Ptr64 Void<br>
   +0x028 ChunksPerRegion  : Uint2B<br>
   +0x02a RefCount         : Uint2B<br>
   +0x02c AllocatorIndex   : UChar<br>
   +0x02d NumaNode         : UChar<br>
   +0x02e LockType         : Pos 0, 1 Bit<br>
   +0x02e MemoryType       : Pos 1, 2 Bits<br>
   +0x02e ConstrainedVA    : Pos 3, 1 Bit<br>
   +0x02e AllowFreeHead    : Pos 4, 1 Bit<br>
   +0x02e Spare0           : Pos 5, 3 Bits<br>
   +0x02f Spare1           : UChar<br>
</font></body></html>