<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_MM_DRIVER_VERIFIER_DATA</h2>
<font face="arial">   +0x000 Level            : Uint4B<br>
   +0x004 RaiseIrqls       : Uint4B<br>
   +0x008 AcquireSpinLocks : Uint4B<br>
   +0x00c SynchronizeExecutions : Uint4B<br>
   +0x010 AllocationsAttempted : Uint4B<br>
   +0x014 AllocationsSucceeded : Uint4B<br>
   +0x018 AllocationsSucceededSpecialPool : Uint4B<br>
   +0x01c AllocationsWithNoTag : Uint4B<br>
   +0x020 TrimRequests     : Uint4B<br>
   +0x024 Trims            : Uint4B<br>
   +0x028 AllocationsFailed : Uint4B<br>
   +0x02c AllocationsFailedDeliberately : Uint4B<br>
   +0x030 Loads            : Uint4B<br>
   +0x034 Unloads          : Uint4B<br>
   +0x038 UnTrackedPool    : Uint4B<br>
   +0x03c UserTrims        : Uint4B<br>
   +0x040 CurrentPagedPoolAllocations : Uint4B<br>
   +0x044 CurrentNonPagedPoolAllocations : Uint4B<br>
   +0x048 PeakPagedPoolAllocations : Uint4B<br>
   +0x04c PeakNonPagedPoolAllocations : Uint4B<br>
   +0x050 PagedBytes       : Uint8B<br>
   +0x058 NonPagedBytes    : Uint8B<br>
   +0x060 PeakPagedBytes   : Uint8B<br>
   +0x068 PeakNonPagedBytes : Uint8B<br>
   +0x070 BurstAllocationsFailedDeliberately : Uint4B<br>
   +0x074 SessionTrims     : Uint4B<br>
   +0x078 OptionChanges    : Uint4B<br>
   +0x07c VerifyMode       : Uint4B<br>
   +0x080 PreviousBucketName : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x090 ExecutePoolTypes : Uint4B<br>
   +0x094 ExecutePageProtections : Uint4B<br>
   +0x098 ExecutePageMappings : Uint4B<br>
   +0x09c ExecuteWriteSections : Uint4B<br>
   +0x0a0 SectionAlignmentFailures : Uint4B<br>
   +0x0a4 IATInExecutableSection : Uint4B<br>
</font></body></html>