<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_MMINPAGE_FLAGS</h2>
<font face="arial">   +0x000 GetExtents       : Pos 0, 1 Bit<br>
   +0x000 PrefetchSystemVmType : Pos 1, 2 Bits<br>
   +0x000 VaPrefetchReadBlock : Pos 3, 1 Bit<br>
   +0x000 CollidedFlowThrough : Pos 4, 1 Bit<br>
   +0x000 ForceCollisions  : Pos 5, 1 Bit<br>
   +0x000 InPageExpanded   : Pos 6, 1 Bit<br>
   +0x000 IssuedAtLowPriority : Pos 7, 1 Bit<br>
   +0x000 FaultFromStore   : Pos 8, 1 Bit<br>
   +0x000 PagePriority     : Pos 9, 3 Bits<br>
   +0x000 ClusteredPagePriority : Pos 12, 3 Bits<br>
   +0x000 MakeClusterValid : Pos 15, 1 Bit<br>
   +0x000 PerformRelocations : Pos 16, 1 Bit<br>
   +0x000 ZeroLastPage     : Pos 17, 1 Bit<br>
   +0x000 UserFault        : Pos 18, 1 Bit<br>
   +0x000 StandbyProtectionNeeded : Pos 19, 1 Bit<br>
   +0x000 PteChanged       : Pos 20, 1 Bit<br>
   +0x000 PageFileFault    : Pos 21, 1 Bit<br>
   +0x000 PageFilePageHashActive : Pos 22, 1 Bit<br>
   +0x000 CoalescedIo      : Pos 23, 1 Bit<br>
   +0x000 VmLockNotNeeded  : Pos 24, 1 Bit<br>
   +0x000 Spare0           : Pos 25, 1 Bit<br>
   +0x000 Spare1           : Pos 26, 6 Bits<br>
</font></body></html>