<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_POP_PER_PROCESSOR_CONTEXT</h2>
<font face="arial">   +0x000 UncompressedData : Ptr64 UChar<br>
   +0x008 MappingVa        : Ptr64 Void<br>
   +0x010 XpressEncodeWorkspace : Ptr64 Void<br>
   +0x018 CompressedDataBuffer : Ptr64 UChar<br>
   +0x020 CopyTicks        : Uint8B<br>
   +0x028 CompressTicks    : Uint8B<br>
   +0x030 BytesCopied      : Uint8B<br>
   +0x038 PagesProcessed   : Uint8B<br>
   +0x040 DecompressTicks  : Uint8B<br>
   +0x048 ResumeCopyTicks  : Uint8B<br>
   +0x050 SharedBufferTicks : Uint8B<br>
   +0x058 DecompressTicksByMethod : [2] Uint8B<br>
   +0x068 DecompressSizeByMethod : [2] Uint8B<br>
   +0x078 CompressCount    : Uint4B<br>
   +0x07c HuffCompressCount : Uint4B<br>
</font></body></html>