<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_POP_FX_DEVICE</h2>
<font face="arial">   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Irp              : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x018 IrpData          : Ptr64 <a href="./_POP_IRP_DATA.html">_POP_IRP_DATA</a><br>
   +0x020 Status           : <a href="./_POP_FX_DEVICE_STATUS.html">_POP_FX_DEVICE_STATUS</a><br>
   +0x024 PowerReqCall     : Int4B<br>
   +0x028 PowerNotReqCall  : Int4B<br>
   +0x030 DevNode          : Ptr64 <a href="./_DEVICE_NODE.html">_DEVICE_NODE</a><br>
   +0x038 DpmContext       : Ptr64 <a href="./PEPHANDLE__.html">PEPHANDLE__</a><br>
   +0x040 Plugin           : Ptr64 <a href="./_POP_FX_PLUGIN.html">_POP_FX_PLUGIN</a><br>
   +0x048 PluginHandle     : Ptr64 <a href="./PEPHANDLE__.html">PEPHANDLE__</a><br>
   +0x050 AcpiPlugin       : Ptr64 <a href="./_POP_FX_PLUGIN.html">_POP_FX_PLUGIN</a><br>
   +0x058 AcpiPluginHandle : Ptr64 <a href="./PEPHANDLE__.html">PEPHANDLE__</a><br>
   +0x060 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x068 TargetDevice     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x070 Callbacks        : <a href="./_POP_FX_DRIVER_CALLBACKS.html">_POP_FX_DRIVER_CALLBACKS</a><br>
   +0x0c0 DriverContext    : Ptr64 Void<br>
   +0x0c8 AcpiLink         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d8 DeviceId         : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0e8 RemoveLock       : <a href="./_IO_REMOVE_LOCK.html">_IO_REMOVE_LOCK</a><br>
   +0x108 AcpiRemoveLock   : <a href="./_IO_REMOVE_LOCK.html">_IO_REMOVE_LOCK</a><br>
   +0x128 WorkOrder        : <a href="./_POP_FX_WORK_ORDER.html">_POP_FX_WORK_ORDER</a><br>
   +0x160 IdleLock         : Uint8B<br>
   +0x168 IdleTimer        : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x1a8 IdleDpc          : <a href="./_KDPC.html">_KDPC</a><br>
   +0x1e8 IdleTimeout      : Uint8B<br>
   +0x1f0 IdleStamp        : Uint8B<br>
   +0x1f8 NextIrpDeviceObject : [2] Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x208 NextIrpPowerState : [2] <a href="./_POWER_STATE.html">_POWER_STATE</a><br>
   +0x210 NextIrpCallerCompletion : [2] Ptr64     void <br>
   +0x220 NextIrpCallerContext : [2] Ptr64 Void<br>
   +0x230 IrpCompleteEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x248 PowerOnDumpDeviceCallback : Ptr64     unsigned char <br>
   +0x250 Accounting       : <a href="./_POP_FX_ACCOUNTING.html">_POP_FX_ACCOUNTING</a><br>
   +0x330 Flags            : Uint4B<br>
   +0x334 ComponentCount   : Uint4B<br>
   +0x338 Components       : Ptr64 Ptr64 <a href="./_POP_FX_COMPONENT.html">_POP_FX_COMPONENT</a><br>
   +0x340 LogEntries       : Uint4B<br>
   +0x348 Log              : Ptr64 <a href="./_POP_FX_LOG_ENTRY.html">_POP_FX_LOG_ENTRY</a><br>
   +0x350 LogIndex         : Int4B<br>
   +0x358 DripsWatchdogDriverObject : Ptr64 <a href="./_DRIVER_OBJECT.html">_DRIVER_OBJECT</a><br>
   +0x360 DripsWatchdogContext : <a href="./_POP_FX_DRIPS_WATCHDOG_CONTEXT.html">_POP_FX_DRIPS_WATCHDOG_CONTEXT</a><br>
   +0x388 DirectedTimeout  : Uint4B<br>
   +0x390 DirectedWorkOrder : <a href="./_POP_FX_WORK_ORDER.html">_POP_FX_WORK_ORDER</a><br>
   +0x3c8 DirectedWorkWatchdogInfo : <a href="./_POP_FX_WORK_ORDER_WATCHDOG_INFO.html">_POP_FX_WORK_ORDER_WATCHDOG_INFO</a><br>
   +0x478 DirectedLock     : Uint8B<br>
   +0x480 DirectedTransitionCallCount : Int4B<br>
   +0x488 DirectedTransitionState : <a href="./_POP_FX_DEVICE_DIRECTED_TRANSITION_STATE.html">_POP_FX_DEVICE_DIRECTED_TRANSITION_STATE</a><br>
   +0x498 PowerProfile     : Ptr64 <a href="./_POP_DEVICE_POWER_PROFILE.html">_POP_DEVICE_POWER_PROFILE</a><br>
   +0x4a0 FriendlyName     : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>