<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_PPM_IDLE_STATE</h2>
<font face="arial">   +0x000 DomainMembers    : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0a8 Name             : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0b8 Latency          : Uint4B<br>
   +0x0bc BreakEvenDuration : Uint4B<br>
   +0x0c0 Power            : Uint4B<br>
   +0x0c4 StateFlags       : Uint4B<br>
   +0x0c8 VetoAccounting   : <a href="./_PPM_VETO_ACCOUNTING.html">_PPM_VETO_ACCOUNTING</a><br>
   +0x0f0 StateType        : UChar<br>
   +0x0f1 InterruptsEnabled : UChar<br>
   +0x0f2 Interruptible    : UChar<br>
   +0x0f3 ContextRetained  : UChar<br>
   +0x0f4 CacheCoherent    : UChar<br>
   +0x0f5 WakesSpuriously  : UChar<br>
   +0x0f6 PlatformOnly     : UChar<br>
   +0x0f7 NoCState         : UChar<br>
</font></body></html>