<html><body>
<h4>Windows 10 x64 (18362.476)</h4><br>
<h2>_WNF_SUBSCRIPTION</h2>
<font face="arial">   +0x000 Header           : <a href="./_WNF_NODE_HEADER.html">_WNF_NODE_HEADER</a><br>
   +0x008 RunRef           : <a href="./_EX_RUNDOWN_REF.html">_EX_RUNDOWN_REF</a><br>
   +0x010 SubscriptionId   : Uint8B<br>
   +0x018 ProcessSubscriptionListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 Process          : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x030 NameInstance     : Ptr64 <a href="./_WNF_NAME_INSTANCE.html">_WNF_NAME_INSTANCE</a><br>
   +0x038 StateName        : <a href="./_WNF_STATE_NAME_STRUCT.html">_WNF_STATE_NAME_STRUCT</a><br>
   +0x040 StateSubscriptionListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x050 CallbackRoutine  : Uint8B<br>
   +0x058 CallbackContext  : Ptr64 Void<br>
   +0x060 CurrentChangeStamp : Uint4B<br>
   +0x064 SubscribedEventSet : Uint4B<br>
   +0x068 PendingSubscriptionListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x078 SubscriptionState : <a href="./_WNF_SUBSCRIPTION_STATE.html">_WNF_SUBSCRIPTION_STATE</a><br>
   +0x07c SignaledEventSet : Uint4B<br>
   +0x080 InDeliveryEventSet : Uint4B<br>
</font></body></html>