<html><body>
<h4>Windows 10 x64 (18363.836)</h4><br>
<h2>_MI_PARTITION_STORES</h2>
<font face="arial">   +0x000 WriteAllStoreHintedPages : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x004 VirtualPageFileNumber : Uint4B<br>
   +0x008 Registered       : Uint4B<br>
   +0x00c ReadClusterSizeMax : Uint4B<br>
   +0x010 EvictFlushRequestCount : Uint4B<br>
   +0x014 ModifiedWriteDisableCount : Uint4B<br>
   +0x018 WriteIssueFailures : Uint4B<br>
   +0x01c WritesOutstanding : Uint4B<br>
   +0x020 EvictFlushLock   : Int4B<br>
   +0x028 EvictionThread   : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x030 EvictEvent       : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x050 WriteSupportSListHead : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x060 EvictFlushCompleteEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x078 ModifiedWriteFailedBitmap : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x080 StoreProcess     : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x088 DeleteStoredPages : Uint4B<br>
</font></body></html>