<html><body>
<h4>Windows 10 x64 (18363.836)</h4><br>
<h2>_PROC_PERF_DOMAIN</h2>
<font face="arial">   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Master           : Ptr64 <a href="./_KPRCB.html">_KPRCB</a><br>
   +0x018 Members          : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0c0 DomainContext    : Uint8B<br>
   +0x0c8 ProcessorCount   : Uint4B<br>
   +0x0cc EfficiencyClass  : UChar<br>
   +0x0cd NominalPerformanceClass : UChar<br>
   +0x0ce HighestPerformanceClass : UChar<br>
   +0x0cf Hidden           : UChar<br>
   +0x0d0 Processors       : Ptr64 <a href="./_PROC_PERF_CONSTRAINT.html">_PROC_PERF_CONSTRAINT</a><br>
   +0x0d8 GetFFHThrottleState : Ptr64     void <br>
   +0x0e0 TimeWindowHandler : Ptr64     void <br>
   +0x0e8 BoostPolicyHandler : Ptr64     void <br>
   +0x0f0 BoostModeHandler : Ptr64     void <br>
   +0x0f8 AutonomousActivityWindowHandler : Ptr64     void <br>
   +0x100 AutonomousModeHandler : Ptr64     void <br>
   +0x108 ReinitializeHandler : Ptr64     void <br>
   +0x110 PerfSelectionHandler : Ptr64     unsigned long <br>
   +0x118 PerfControlHandler : Ptr64     void <br>
   +0x120 PerfControlHandlerHidden : Ptr64     void <br>
   +0x128 DomainPerfControlHandler : Ptr64     void <br>
   +0x130 MaxFrequency     : Uint4B<br>
   +0x134 NominalFrequency : Uint4B<br>
   +0x138 MaxPercent       : Uint4B<br>
   +0x13c MinPerfPercent   : Uint4B<br>
   +0x140 MinThrottlePercent : Uint4B<br>
   +0x144 AdvertizedMaximumFrequency : Uint4B<br>
   +0x148 MinimumRelativePerformance : Uint8B<br>
   +0x150 NominalRelativePerformance : Uint8B<br>
   +0x158 NominalRelativePerformancePercent : UChar<br>
   +0x159 Coordination     : UChar<br>
   +0x15a HardPlatformCap  : UChar<br>
   +0x15b AffinitizeControl : UChar<br>
   +0x15c EfficientThrottle : UChar<br>
   +0x15d AllowSchedulerDirectedPerfStates : UChar<br>
   +0x15e InitiateAllProcessors : UChar<br>
   +0x15f AutonomousMode   : UChar<br>
   +0x160 ProvideGuidance  : UChar<br>
   +0x164 DesiredPercent   : Uint4B<br>
   +0x168 GuaranteedPercent : Uint4B<br>
   +0x16c EngageResponsivenessOverrides : UChar<br>
   +0x170 QosPolicies      : [4] <a href="./_PROC_PERF_QOS_CLASS_POLICY.html">_PROC_PERF_QOS_CLASS_POLICY</a><br>
   +0x1e0 QosDisableReasons : [4] Uint4B<br>
   +0x1f0 QosEquivalencyMasks : [4] Uint2B<br>
   +0x1f8 QosSupported     : UChar<br>
   +0x1fc SelectionGeneration : Uint4B<br>
   +0x200 QosSelection     : [4] <a href="./_PERF_CONTROL_STATE_SELECTION.html">_PERF_CONTROL_STATE_SELECTION</a><br>
   +0x2a0 PerfChangeTime   : Uint8B<br>
   +0x2a8 PerfChangeIntervalCount : Uint4B<br>
   +0x2ac Force            : UChar<br>
   +0x2ad Update           : UChar<br>
   +0x2ae Apply            : UChar<br>
</font></body></html>