<html><body>
<h4>Windows 10 x64 (18363.836)</h4><br>
<h2>_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS</h2>
<font face="arial">   +0x000 ProcessorType    : Pos 0, 1 Bit<br>
   +0x000 InstructionSet   : Pos 1, 1 Bit<br>
   +0x000 ErrorType        : Pos 2, 1 Bit<br>
   +0x000 Operation        : Pos 3, 1 Bit<br>
   +0x000 Flags            : Pos 4, 1 Bit<br>
   +0x000 Level            : Pos 5, 1 Bit<br>
   +0x000 CPUVersion       : Pos 6, 1 Bit<br>
   +0x000 CPUBrandString   : Pos 7, 1 Bit<br>
   +0x000 ProcessorId      : Pos 8, 1 Bit<br>
   +0x000 TargetAddress    : Pos 9, 1 Bit<br>
   +0x000 RequesterId      : Pos 10, 1 Bit<br>
   +0x000 ResponderId      : Pos 11, 1 Bit<br>
   +0x000 InstructionPointer : Pos 12, 1 Bit<br>
   +0x000 Reserved         : Pos 13, 51 Bits<br>
   +0x000 ValidBits        : Uint8B<br>
</font></body></html>