<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_DUMP_STACK_CONTEXT</h2>
<font face="arial">   +0x000 Init             : <a href="./_DUMP_INITIALIZATION_CONTEXT.html">_DUMP_INITIALIZATION_CONTEXT</a><br>
   +0x108 PartitionOffset  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x110 DumpPointers     : Ptr64 Void<br>
   +0x110 StorageInfo      : Ptr64 Void<br>
   +0x118 UseStorageInfo   : UChar<br>
   +0x11c PointersLength   : Uint4B<br>
   +0x120 ModulePrefix     : Ptr64 Wchar<br>
   +0x128 DriverList       : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x138 InitMsg          : <a href="./_STRING.html">_STRING</a><br>
   +0x148 ProgMsg          : <a href="./_STRING.html">_STRING</a><br>
   +0x158 DoneMsg          : <a href="./_STRING.html">_STRING</a><br>
   +0x168 FileObject       : Ptr64 Void<br>
   +0x170 UsageType        : <a href="./_DEVICE_USAGE_NOTIFICATION_TYPE.html">_DEVICE_USAGE_NOTIFICATION_TYPE</a><br>
</font></body></html>