<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_ETW_SILODRIVERSTATE</h2>
<font face="arial">   +0x000 Silo             : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x008 SiloGlobals      : Ptr64 <a href="./_ESERVERSILO_GLOBALS.html">_ESERVERSILO_GLOBALS</a><br>
   +0x010 MaxLoggers       : Uint4B<br>
   +0x018 EtwpSecurityProviderGuidEntry : <a href="./_ETW_GUID_ENTRY.html">_ETW_GUID_ENTRY</a><br>
   +0x1c0 EtwpLoggerRundown : Ptr64 Ptr64 <a href="./_EX_RUNDOWN_REF_CACHE_AWARE.html">_EX_RUNDOWN_REF_CACHE_AWARE</a><br>
   +0x1c8 EtwpLoggerContext : Ptr64 Ptr64 <a href="./_WMI_LOGGER_CONTEXT.html">_WMI_LOGGER_CONTEXT</a><br>
   +0x1d0 EtwpGuidHashTable : [64] <a href="./_ETW_HASH_BUCKET.html">_ETW_HASH_BUCKET</a><br>
   +0xfd0 EtwpSecurityLoggers : [8] Uint2B<br>
   +0xfe0 EtwpSecurityProviderEnableMask : UChar<br>
   +0xfe4 EtwpShutdownInProgress : Int4B<br>
   +0xfe8 EtwpSecurityProviderPID : Uint4B<br>
   +0xff0 PrivHandleDemuxTable : <a href="./_ETW_PRIV_HANDLE_DEMUX_TABLE.html">_ETW_PRIV_HANDLE_DEMUX_TABLE</a><br>
   +0x1010 EtwpCounters     : <a href="./_ETW_COUNTERS.html">_ETW_COUNTERS</a><br>
   +0x1020 LogfileBytesWritten : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x1028 ProcessorBlocks  : Ptr64 <a href="./_ETW_SILO_TRACING_BLOCK.html">_ETW_SILO_TRACING_BLOCK</a><br>
   +0x1030 ContainerRestoreWnfSubscription : Ptr64 <a href="./_EX_WNF_SUBSCRIPTION.html">_EX_WNF_SUBSCRIPTION</a><br>
   +0x1038 PartitionId      : <a href="./_GUID.html">_GUID</a><br>
   +0x1048 ParentId         : <a href="./_GUID.html">_GUID</a><br>
   +0x1058 QpcOffsetFromRoot : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x1060 PartitionName    : Ptr64 Char<br>
   +0x1068 PartitionNameSize : Uint2B<br>
   +0x106a UnusedPadding    : Uint2B<br>
   +0x106c PartitionType    : Uint4B<br>
   +0x1070 SystemLoggerSettings : <a href="./_ETW_SYSTEM_LOGGER_SETTINGS.html">_ETW_SYSTEM_LOGGER_SETTINGS</a><br>
   +0x11e8 EtwpStartTraceMutex : <a href="./_KMUTANT.html">_KMUTANT</a><br>
</font></body></html>