<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_ETW_WMITRACE_WORK</h2>
<font face="arial">   +0x000 LoggerId         : Uint4B<br>
   +0x004 SiloSessionId    : Uint4B<br>
   +0x008 LoggerName       : [65] Char<br>
   +0x049 FileName         : [129] Char<br>
   +0x0cc MaximumFileSize  : Uint4B<br>
   +0x0d0 MinBuffers       : Uint4B<br>
   +0x0d4 MaxBuffers       : Uint4B<br>
   +0x0d8 BufferSize       : Uint4B<br>
   +0x0dc Mode             : Uint4B<br>
   +0x0e0 FlushTimer       : Uint4B<br>
   +0x008 MatchAny         : Uint8B<br>
   +0x010 MatchAll         : Uint8B<br>
   +0x018 EnableProperty   : Uint4B<br>
   +0x01c Guid             : <a href="./_GUID.html">_GUID</a><br>
   +0x02c Level            : UChar<br>
   +0x0e8 Status           : Int4B<br>
</font></body></html>