<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_PROC_PERF_CONSTRAINT</h2>
<font face="arial">   +0x000 CheckContext     : Ptr64 <a href="./_PROC_PERF_CHECK_CONTEXT.html">_PROC_PERF_CHECK_CONTEXT</a><br>
   +0x008 PerfContext      : Uint8B<br>
   +0x010 Presence         : <a href="./_PROCESSOR_PRESENCE.html">_PROCESSOR_PRESENCE</a><br>
   +0x014 ProcessorId      : Uint4B<br>
   +0x018 PlatformCap      : Uint4B<br>
   +0x01c ThermalCap       : Uint4B<br>
   +0x020 LimitReasons     : Uint4B<br>
   +0x028 PlatformCapStartTime : Uint8B<br>
   +0x030 ProcCap          : Uint4B<br>
   +0x034 ProcFloor        : Uint4B<br>
   +0x038 TargetPercent    : Uint4B<br>
   +0x03c EngageResponsivenessOverrides : UChar<br>
   +0x03d ResponsivenessChangeCount : UChar<br>
   +0x040 Selection        : <a href="./_PERF_CONTROL_STATE_SELECTION.html">_PERF_CONTROL_STATE_SELECTION</a><br>
   +0x068 DomainSelectionGeneration : Uint4B<br>
   +0x06c PreviousFrequency : Uint4B<br>
   +0x070 PreviousPercent  : Uint4B<br>
   +0x074 LatestFrequencyPercent : Uint4B<br>
   +0x078 LatestPerformancePercent : Uint4B<br>
   +0x07c Force            : UChar<br>
   +0x07d UseQosUpdateLock : UChar<br>
   +0x080 QosUpdateLock    : Uint8B<br>
</font></body></html>