<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_SEP_LOGON_SESSION_REFERENCES</h2>
<font face="arial">   +0x000 Next             : Ptr64 <a href="./_SEP_LOGON_SESSION_REFERENCES.html">_SEP_LOGON_SESSION_REFERENCES</a><br>
   +0x008 LogonId          : <a href="./_LUID.html">_LUID</a><br>
   +0x010 BuddyLogonId     : <a href="./_LUID.html">_LUID</a><br>
   +0x018 ReferenceCount   : Int8B<br>
   +0x020 Flags            : Uint4B<br>
   +0x028 pDeviceMap       : Ptr64 <a href="./_DEVICE_MAP.html">_DEVICE_MAP</a><br>
   +0x030 Token            : Ptr64 Void<br>
   +0x038 AccountName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x048 AuthorityName    : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x058 CachedHandlesTable : <a href="./_SEP_CACHED_HANDLES_TABLE.html">_SEP_CACHED_HANDLES_TABLE</a><br>
   +0x068 SharedDataLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x070 SharedClaimAttributes : Ptr64 <a href="./_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION.html">_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION</a><br>
   +0x078 SharedSidValues  : Ptr64 <a href="./_SEP_SID_VALUES_BLOCK.html">_SEP_SID_VALUES_BLOCK</a><br>
   +0x080 RevocationBlock  : <a href="./_OB_HANDLE_REVOCATION_BLOCK.html">_OB_HANDLE_REVOCATION_BLOCK</a><br>
   +0x0a0 ServerSilo       : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x0a8 SiblingAuthId    : <a href="./_LUID.html">_LUID</a><br>
   +0x0b0 TokenList        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
</font></body></html>