<html><body>
<h4>Windows 10 x64 (19042.610)</h4><br>
<h2>_TRACE_LOGFILE_HEADER</h2>
<font face="arial">   +0x000 BufferSize       : Uint4B<br>
   +0x004 Version          : Uint4B<br>
   +0x004 VersionDetail    : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x008 ProviderVersion  : Uint4B<br>
   +0x00c NumberOfProcessors : Uint4B<br>
   +0x010 EndTime          : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 TimerResolution  : Uint4B<br>
   +0x01c MaximumFileSize  : Uint4B<br>
   +0x020 LogFileMode      : Uint4B<br>
   +0x024 BuffersWritten   : Uint4B<br>
   +0x028 LogInstanceGuid  : <a href="./_GUID.html">_GUID</a><br>
   +0x028 StartBuffers     : Uint4B<br>
   +0x02c PointerSize      : Uint4B<br>
   +0x030 EventsLost       : Uint4B<br>
   +0x034 CpuSpeedInMHz    : Uint4B<br>
   +0x038 LoggerName       : Ptr64 Wchar<br>
   +0x040 LogFileName      : Ptr64 Wchar<br>
   +0x048 TimeZone         : <a href="./_RTL_TIME_ZONE_INFORMATION.html">_RTL_TIME_ZONE_INFORMATION</a><br>
   +0x0f8 BootTime         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x100 PerfFreq         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x108 StartTime        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x110 ReservedFlags    : Uint4B<br>
   +0x114 BuffersLost      : Uint4B<br>
</font></body></html>