<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_ESERVERSILO_GLOBALS</h2>
<font face="arial">   +0x000 ObSiloState      : <a href="./_OBP_SILODRIVERSTATE.html">_OBP_SILODRIVERSTATE</a><br>
   +0x2e0 SeSiloState      : <a href="./_SEP_SILOSTATE.html">_SEP_SILOSTATE</a><br>
   +0x310 SeRmSiloState    : <a href="./_SEP_RM_LSA_CONNECTION_STATE.html">_SEP_RM_LSA_CONNECTION_STATE</a><br>
   +0x360 EtwSiloState     : Ptr64 <a href="./_ETW_SILODRIVERSTATE.html">_ETW_SILODRIVERSTATE</a><br>
   +0x368 MiSessionLeaderProcess : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x370 ExpDefaultErrorPortProcess : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x378 ExpDefaultErrorPort : Ptr64 Void<br>
   +0x380 HardErrorState   : Uint4B<br>
   +0x388 WnfSiloState     : <a href="./_WNF_SILODRIVERSTATE.html">_WNF_SILODRIVERSTATE</a><br>
   +0x3c0 DbgkSiloState    : <a href="./_DBGK_SILOSTATE.html">_DBGK_SILOSTATE</a><br>
   +0x3e0 PsProtectedCurrentDirectory : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x3f0 PsProtectedEnvironment : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x400 ApiSetSection    : Ptr64 Void<br>
   +0x408 ApiSetSchema     : Ptr64 Void<br>
   +0x410 OneCoreForwardersEnabled : UChar<br>
   +0x418 NtSystemRoot     : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x428 SiloRootDirectoryName : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x438 Storage          : Ptr64 <a href="./_PSP_STORAGE.html">_PSP_STORAGE</a><br>
   +0x440 State            : <a href="./_SERVERSILO_STATE.html">_SERVERSILO_STATE</a><br>
   +0x444 ExitStatus       : Int4B<br>
   +0x448 DeleteEvent      : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x450 UserSharedData   : Ptr64 <a href="./_SILO_USER_SHARED_DATA.html">_SILO_USER_SHARED_DATA</a><br>
   +0x458 UserSharedSection : Ptr64 Void<br>
   +0x460 TerminateWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
</font></body></html>