<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_FAST_ERESOURCE_INTERNAL</h2>
<font face="arial">   +0x000 SystemResourcesList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 ReservedPointer  : Ptr64 Void<br>
   +0x018 ActiveCount      : Int2B<br>
   +0x01a Flag             : Uint2B<br>
   +0x020 SharedWaiters    : <a href="./_KWAIT_CHAIN.html">_KWAIT_CHAIN</a><br>
   +0x028 ExclusiveWaiters : <a href="./_KWAIT_CHAIN.html">_KWAIT_CHAIN</a><br>
   +0x030 OwnerEntryListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x040 ActiveEntries    : Uint4B<br>
   +0x044 ContentionCount  : Uint4B<br>
   +0x048 NumberOfSharedWaiters : Uint4B<br>
   +0x04c NumberOfExclusiveWaiters : Uint4B<br>
   +0x050 ReservedWin64OnlyPointer : Ptr64 Void<br>
   +0x058 Address          : Ptr64 Void<br>
   +0x058 CreatorBackTraceIndex : Uint8B<br>
   +0x060 SpinLock         : Uint8B<br>
</font></body></html>