<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_MI_PARTITION_STATE</h2>
<font face="arial">   +0x000 PartitionLock    : Uint8B<br>
   +0x008 PartitionIdLock  : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x010 InitialPartitionIdBits : Uint8B<br>
   +0x018 PartitionList    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 PartitionIdBitmap : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x030 InitialPartitionIdBitmap : <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x040 TempPartitionPointers : [1] Ptr64 <a href="./_MI_PARTITION.html">_MI_PARTITION</a><br>
   +0x048 Partition        : Ptr64 Ptr64 <a href="./_MI_PARTITION.html">_MI_PARTITION</a><br>
   +0x050 TotalPagesInChildPartitions : Uint8B<br>
   +0x058 CrossPartitionDenials : Uint4B<br>
   +0x05c MultiplePartitionsExist : UChar<br>
   +0x060 HugeIoPfnBitMap  : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x070 HugePfnDatabase  : Ptr64 <a href="./_MI_HUGE_PFN.html">_MI_HUGE_PFN</a><br>
   +0x080 HugeRangesLock   : Uint8B<br>
</font></body></html>