<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_PEB32</h2>
<font face="arial">   +0x000 InheritedAddressSpace : UChar<br>
   +0x001 ReadImageFileExecOptions : UChar<br>
   +0x002 BeingDebugged    : UChar<br>
   +0x003 BitField         : UChar<br>
   +0x003 ImageUsesLargePages : Pos 0, 1 Bit<br>
   +0x003 IsProtectedProcess : Pos 1, 1 Bit<br>
   +0x003 IsImageDynamicallyRelocated : Pos 2, 1 Bit<br>
   +0x003 SkipPatchingUser32Forwarders : Pos 3, 1 Bit<br>
   +0x003 IsPackagedProcess : Pos 4, 1 Bit<br>
   +0x003 IsAppContainer   : Pos 5, 1 Bit<br>
   +0x003 IsProtectedProcessLight : Pos 6, 1 Bit<br>
   +0x003 IsLongPathAwareProcess : Pos 7, 1 Bit<br>
   +0x004 Mutant           : Uint4B<br>
   +0x008 ImageBaseAddress : Uint4B<br>
   +0x00c Ldr              : Uint4B<br>
   +0x010 ProcessParameters : Uint4B<br>
   +0x014 SubSystemData    : Uint4B<br>
   +0x018 ProcessHeap      : Uint4B<br>
   +0x01c FastPebLock      : Uint4B<br>
   +0x020 AtlThunkSListPtr : Uint4B<br>
   +0x024 IFEOKey          : Uint4B<br>
   +0x028 CrossProcessFlags : Uint4B<br>
   +0x028 ProcessInJob     : Pos 0, 1 Bit<br>
   +0x028 ProcessInitializing : Pos 1, 1 Bit<br>
   +0x028 ProcessUsingVEH  : Pos 2, 1 Bit<br>
   +0x028 ProcessUsingVCH  : Pos 3, 1 Bit<br>
   +0x028 ProcessUsingFTH  : Pos 4, 1 Bit<br>
   +0x028 ProcessPreviouslyThrottled : Pos 5, 1 Bit<br>
   +0x028 ProcessCurrentlyThrottled : Pos 6, 1 Bit<br>
   +0x028 ProcessImagesHotPatched : Pos 7, 1 Bit<br>
   +0x028 ReservedBits0    : Pos 8, 24 Bits<br>
   +0x02c KernelCallbackTable : Uint4B<br>
   +0x02c UserSharedInfoPtr : Uint4B<br>
   +0x030 SystemReserved   : Uint4B<br>
   +0x034 AtlThunkSListPtr32 : Uint4B<br>
   +0x038 ApiSetMap        : Uint4B<br>
   +0x03c TlsExpansionCounter : Uint4B<br>
   +0x040 TlsBitmap        : Uint4B<br>
   +0x044 TlsBitmapBits    : [2] Uint4B<br>
   +0x04c ReadOnlySharedMemoryBase : Uint4B<br>
   +0x050 SharedData       : Uint4B<br>
   +0x054 ReadOnlyStaticServerData : Uint4B<br>
   +0x058 AnsiCodePageData : Uint4B<br>
   +0x05c OemCodePageData  : Uint4B<br>
   +0x060 UnicodeCaseTableData : Uint4B<br>
   +0x064 NumberOfProcessors : Uint4B<br>
   +0x068 NtGlobalFlag     : Uint4B<br>
   +0x070 CriticalSectionTimeout : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x078 HeapSegmentReserve : Uint4B<br>
   +0x07c HeapSegmentCommit : Uint4B<br>
   +0x080 HeapDeCommitTotalFreeThreshold : Uint4B<br>
   +0x084 HeapDeCommitFreeBlockThreshold : Uint4B<br>
   +0x088 NumberOfHeaps    : Uint4B<br>
   +0x08c MaximumNumberOfHeaps : Uint4B<br>
   +0x090 ProcessHeaps     : Uint4B<br>
   +0x094 GdiSharedHandleTable : Uint4B<br>
   +0x098 ProcessStarterHelper : Uint4B<br>
   +0x09c GdiDCAttributeList : Uint4B<br>
   +0x0a0 LoaderLock       : Uint4B<br>
   +0x0a4 OSMajorVersion   : Uint4B<br>
   +0x0a8 OSMinorVersion   : Uint4B<br>
   +0x0ac OSBuildNumber    : Uint2B<br>
   +0x0ae OSCSDVersion     : Uint2B<br>
   +0x0b0 OSPlatformId     : Uint4B<br>
   +0x0b4 ImageSubsystem   : Uint4B<br>
   +0x0b8 ImageSubsystemMajorVersion : Uint4B<br>
   +0x0bc ImageSubsystemMinorVersion : Uint4B<br>
   +0x0c0 ActiveProcessAffinityMask : Uint4B<br>
   +0x0c4 GdiHandleBuffer  : [34] Uint4B<br>
   +0x14c PostProcessInitRoutine : Uint4B<br>
   +0x150 TlsExpansionBitmap : Uint4B<br>
   +0x154 TlsExpansionBitmapBits : [32] Uint4B<br>
   +0x1d4 SessionId        : Uint4B<br>
   +0x1d8 AppCompatFlags   : <a href="./_ULARGE_INTEGER.html">_ULARGE_INTEGER</a><br>
   +0x1e0 AppCompatFlagsUser : <a href="./_ULARGE_INTEGER.html">_ULARGE_INTEGER</a><br>
   +0x1e8 pShimData        : Uint4B<br>
   +0x1ec AppCompatInfo    : Uint4B<br>
   +0x1f0 CSDVersion       : <a href="./_STRING32.html">_STRING32</a><br>
   +0x1f8 ActivationContextData : Uint4B<br>
   +0x1fc ProcessAssemblyStorageMap : Uint4B<br>
   +0x200 SystemDefaultActivationContextData : Uint4B<br>
   +0x204 SystemAssemblyStorageMap : Uint4B<br>
   +0x208 MinimumStackCommit : Uint4B<br>
   +0x20c SparePointers    : [4] Uint4B<br>
   +0x21c SpareUlongs      : [5] Uint4B<br>
   +0x230 WerRegistrationData : Uint4B<br>
   +0x234 WerShipAssertPtr : Uint4B<br>
   +0x238 pUnused          : Uint4B<br>
   +0x23c pImageHeaderHash : Uint4B<br>
   +0x240 TracingFlags     : Uint4B<br>
   +0x240 HeapTracingEnabled : Pos 0, 1 Bit<br>
   +0x240 CritSecTracingEnabled : Pos 1, 1 Bit<br>
   +0x240 LibLoaderTracingEnabled : Pos 2, 1 Bit<br>
   +0x240 SpareTracingBits : Pos 3, 29 Bits<br>
   +0x248 CsrServerReadOnlySharedMemoryBase : Uint8B<br>
   +0x250 TppWorkerpListLock : Uint4B<br>
   +0x254 TppWorkerpList   : <a href="./LIST_ENTRY32.html">LIST_ENTRY32</a><br>
   +0x25c WaitOnAddressHashTable : [128] Uint4B<br>
   +0x45c TelemetryCoverageHeader : Uint4B<br>
   +0x460 CloudFileFlags   : Uint4B<br>
   +0x464 CloudFileDiagFlags : Uint4B<br>
   +0x468 PlaceholderCompatibilityMode : Char<br>
   +0x469 PlaceholderCompatibilityModeReserved : [7] Char<br>
   +0x470 LeapSecondData   : Uint4B<br>
   +0x474 LeapSecondFlags  : Uint4B<br>
   +0x474 SixtySecondEnabled : Pos 0, 1 Bit<br>
   +0x474 Reserved         : Pos 1, 31 Bits<br>
   +0x478 NtGlobalFlag2    : Uint4B<br>
</font></body></html>