<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_PNP_DEVICE_EVENT_ENTRY</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Argument         : Uint4B<br>
   +0x014 ArgumentStatus   : Int4B<br>
   +0x018 CallerEvent      : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x020 Callback         : Ptr64     void <br>
   +0x028 Context          : Ptr64 Void<br>
   +0x030 VetoType         : Ptr64 <a href="./_PNP_VETO_TYPE.html">_PNP_VETO_TYPE</a><br>
   +0x038 VetoName         : Ptr64 <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x040 RefCount         : Uint4B<br>
   +0x044 Lock             : Uint4B<br>
   +0x048 Cancel           : UChar<br>
   +0x050 Parent           : Ptr64 <a href="./_PNP_DEVICE_EVENT_ENTRY.html">_PNP_DEVICE_EVENT_ENTRY</a><br>
   +0x058 ActivityId       : <a href="./_GUID.html">_GUID</a><br>
   +0x068 Watchdog         : Ptr64 <a href="./_PNP_WATCHDOG.html">_PNP_WATCHDOG</a><br>
   +0x070 Data             : <a href="./_PLUGPLAY_EVENT_BLOCK.html">_PLUGPLAY_EVENT_BLOCK</a><br>
</font></body></html>