<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>_WHEA_MEMORY_ERROR_SECTION_VALIDBITS</h2>
<font face="arial">   +0x000 ErrorStatus      : Pos 0, 1 Bit<br>
   +0x000 PhysicalAddress  : Pos 1, 1 Bit<br>
   +0x000 PhysicalAddressMask : Pos 2, 1 Bit<br>
   +0x000 Node             : Pos 3, 1 Bit<br>
   +0x000 Card             : Pos 4, 1 Bit<br>
   +0x000 Module           : Pos 5, 1 Bit<br>
   +0x000 Bank             : Pos 6, 1 Bit<br>
   +0x000 Device           : Pos 7, 1 Bit<br>
   +0x000 Row              : Pos 8, 1 Bit<br>
   +0x000 Column           : Pos 9, 1 Bit<br>
   +0x000 BitPosition      : Pos 10, 1 Bit<br>
   +0x000 RequesterId      : Pos 11, 1 Bit<br>
   +0x000 ResponderId      : Pos 12, 1 Bit<br>
   +0x000 TargetId         : Pos 13, 1 Bit<br>
   +0x000 ErrorType        : Pos 14, 1 Bit<br>
   +0x000 RankNumber       : Pos 15, 1 Bit<br>
   +0x000 CardHandle       : Pos 16, 1 Bit<br>
   +0x000 ModuleHandle     : Pos 17, 1 Bit<br>
   +0x000 ExtendedRow      : Pos 18, 1 Bit<br>
   +0x000 BankGroup        : Pos 19, 1 Bit<br>
   +0x000 BankAddress      : Pos 20, 1 Bit<br>
   +0x000 ChipIdentification : Pos 21, 1 Bit<br>
   +0x000 Reserved         : Pos 22, 42 Bits<br>
   +0x000 ValidBits        : Uint8B<br>
</font></body></html>