<html><body>
<h4>Windows 10 x64 (18362.449)</h4><br>
<h2>PO_MEMORY_IMAGE</h2>
<font face="arial">   +0x000 Signature        : Uint4B<br>
   +0x004 ImageType        : Uint4B<br>
   +0x008 CheckSum         : Uint4B<br>
   +0x00c LengthSelf       : Uint4B<br>
   +0x010 PageSelf         : Uint8B<br>
   +0x018 PageSize         : Uint4B<br>
   +0x020 SystemTime       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x028 InterruptTime    : Uint8B<br>
   +0x030 FeatureFlags     : Uint8B<br>
   +0x038 HiberFlags       : UChar<br>
   +0x039 spare            : [3] UChar<br>
   +0x03c NoHiberPtes      : Uint4B<br>
   +0x040 HiberVa          : Uint8B<br>
   +0x048 NoFreePages      : Uint4B<br>
   +0x04c FreeMapCheck     : Uint4B<br>
   +0x050 WakeCheck        : Uint4B<br>
   +0x058 NumPagesForLoader : Uint8B<br>
   +0x060 FirstSecureRestorePage : Uint8B<br>
   +0x068 FirstBootRestorePage : Uint8B<br>
   +0x070 FirstKernelRestorePage : Uint8B<br>
   +0x078 FirstChecksumRestorePage : Uint8B<br>
   +0x080 NoChecksumEntries : Uint8B<br>
   +0x088 PerfInfo         : <a href="./_PO_HIBER_PERF.html">_PO_HIBER_PERF</a><br>
   +0x280 FirmwareRuntimeInformationPages : Uint4B<br>
   +0x288 FirmwareRuntimeInformation : [1] Uint8B<br>
   +0x290 SpareUlong       : Uint4B<br>
   +0x294 NoBootLoaderLogPages : Uint4B<br>
   +0x298 BootLoaderLogPages : [24] Uint8B<br>
   +0x358 NotUsed          : Uint4B<br>
   +0x35c ResumeContextCheck : Uint4B<br>
   +0x360 ResumeContextPages : Uint4B<br>
   +0x364 Hiberboot        : UChar<br>
   +0x365 SecureLaunched   : UChar<br>
   +0x366 SecureBoot       : UChar<br>
   +0x368 HvPageTableRoot  : Uint8B<br>
   +0x370 HvEntryPoint     : Uint8B<br>
   +0x378 HvReservedTransitionAddress : Uint8B<br>
   +0x380 HvReservedTransitionAddressSize : Uint8B<br>
   +0x388 BootFlags        : Uint8B<br>
   +0x390 RestoreProcessorStateRoutine : Uint8B<br>
   +0x398 HighestPhysicalPage : Uint8B<br>
   +0x3a0 BitlockerKeyPfns : [4] Uint8B<br>
   +0x3c0 HardwareSignature : Uint4B<br>
   +0x3c8 SMBiosTablePhysicalAddress : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x3d0 SMBiosTableLength : Uint4B<br>
   +0x3d4 SMBiosMajorVersion : UChar<br>
   +0x3d5 SMBiosMinorVersion : UChar<br>
   +0x3d6 HiberResumeXhciHandoffSkip : UChar<br>
   +0x3d7 InitializeUSBCore : UChar<br>
   +0x3d8 ValidUSBCoreId   : UChar<br>
   +0x3d9 USBCoreId        : UChar<br>
   +0x3da SkipMemoryMapValidation : UChar<br>
</font></body></html>