<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_HEAP_FREE_ENTRY</h2>
<font face="arial">   +0x000 HeapEntry        : <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x000 UnpackedEntry    : <a href="./_HEAP_UNPACKED_ENTRY.html">_HEAP_UNPACKED_ENTRY</a><br>
   +0x000 PreviousBlockPrivateData : Ptr64 Void<br>
   +0x008 Size             : Uint2B<br>
   +0x00a Flags            : UChar<br>
   +0x00b SmallTagIndex    : UChar<br>
   +0x008 SubSegmentCode   : Uint4B<br>
   +0x00c PreviousSize     : Uint2B<br>
   +0x00e SegmentOffset    : UChar<br>
   +0x00e LFHFlags         : UChar<br>
   +0x00f UnusedBytes      : UChar<br>
   +0x008 CompactHeader    : Uint8B<br>
   +0x000 ExtendedEntry    : <a href="./_HEAP_EXTENDED_ENTRY.html">_HEAP_EXTENDED_ENTRY</a><br>
   +0x000 Reserved         : Ptr64 Void<br>
   +0x008 FunctionIndex    : Uint2B<br>
   +0x00a ContextValue     : Uint2B<br>
   +0x008 InterceptorValue : Uint4B<br>
   +0x00c UnusedBytesLength : Uint2B<br>
   +0x00e EntryOffset      : UChar<br>
   +0x00f ExtendedBlockSignature : UChar<br>
   +0x000 ReservedForAlignment : Ptr64 Void<br>
   +0x008 Code1            : Uint4B<br>
   +0x00c Code2            : Uint2B<br>
   +0x00e Code3            : UChar<br>
   +0x00f Code4            : UChar<br>
   +0x00c Code234          : Uint4B<br>
   +0x008 AgregateCode     : Uint8B<br>
   +0x010 FreeList         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
</font></body></html>