<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_INTERRUPT_FUNCTION_TABLE</h2>
<font face="arial">   +0x000 InitializeLocalUnit : Ptr64     long <br>
   +0x008 InitializeIoUnit : Ptr64     long <br>
   +0x010 SetPriority      : Ptr64     void <br>
   +0x018 GetLocalUnitError : Ptr64     unsigned long <br>
   +0x020 ClearLocalUnitError : Ptr64     void <br>
   +0x028 GetLogicalId     : Ptr64     long <br>
   +0x030 SetLogicalId     : Ptr64     long <br>
   +0x038 AcceptAndGetSource : Ptr64     _<a href="./_INTERRUPT_RESULT.html">_INTERRUPT_RESULT</a><br>
   +0x040 EndOfInterrupt   : Ptr64     void <br>
   +0x048 FastEndOfInterrupt : Ptr64     void <br>
   +0x050 SetLineState     : Ptr64     long <br>
   +0x058 RequestInterrupt : Ptr64     long <br>
   +0x060 StartProcessor   : Ptr64     long <br>
   +0x068 GenerateMessage  : Ptr64     long <br>
   +0x070 ConvertId        : Ptr64     long <br>
   +0x078 SaveLocalInterrupts : Ptr64     long <br>
   +0x080 ReplayLocalInterrupts : Ptr64     long <br>
   +0x088 DeinitializeLocalUnit : Ptr64     long <br>
   +0x090 DeinitializeIoUnit : Ptr64     long <br>
   +0x098 QueryAndGetSource : Ptr64     _<a href="./_INTERRUPT_RESULT.html">_INTERRUPT_RESULT</a><br>
   +0x0a0 DeactivateInterrupt : Ptr64     void <br>
   +0x0a8 DirectedEndOfInterrupt : Ptr64     void <br>
   +0x0b0 QueryLocalUnitInfo : Ptr64     long <br>
</font></body></html>