<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_KTHREAD</h2>
<font face="arial">   +0x000 Header           : <a href="./_DISPATCHER_HEADER.html">_DISPATCHER_HEADER</a><br>
   +0x018 SListFaultAddress : Ptr64 Void<br>
   +0x020 QuantumTarget    : Uint8B<br>
   +0x028 InitialStack     : Ptr64 Void<br>
   +0x030 StackLimit       : Ptr64 Void<br>
   +0x038 StackBase        : Ptr64 Void<br>
   +0x040 ThreadLock       : Uint8B<br>
   +0x048 CycleTime        : Uint8B<br>
   +0x050 CurrentRunTime   : Uint4B<br>
   +0x054 ExpectedRunTime  : Uint4B<br>
   +0x058 KernelStack      : Ptr64 Void<br>
   +0x060 StateSaveArea    : Ptr64 <a href="./_XSAVE_FORMAT.html">_XSAVE_FORMAT</a><br>
   +0x068 SchedulingGroup  : Ptr64 <a href="./_KSCHEDULING_GROUP.html">_KSCHEDULING_GROUP</a><br>
   +0x070 WaitRegister     : <a href="./_KWAIT_STATUS_REGISTER.html">_KWAIT_STATUS_REGISTER</a><br>
   +0x071 Running          : UChar<br>
   +0x072 Alerted          : [2] UChar<br>
   +0x074 AutoBoostActive  : Pos 0, 1 Bit<br>
   +0x074 ReadyTransition  : Pos 1, 1 Bit<br>
   +0x074 WaitNext         : Pos 2, 1 Bit<br>
   +0x074 SystemAffinityActive : Pos 3, 1 Bit<br>
   +0x074 Alertable        : Pos 4, 1 Bit<br>
   +0x074 UserStackWalkActive : Pos 5, 1 Bit<br>
   +0x074 ApcInterruptRequest : Pos 6, 1 Bit<br>
   +0x074 QuantumEndMigrate : Pos 7, 1 Bit<br>
   +0x074 UmsDirectedSwitchEnable : Pos 8, 1 Bit<br>
   +0x074 TimerActive      : Pos 9, 1 Bit<br>
   +0x074 SystemThread     : Pos 10, 1 Bit<br>
   +0x074 ProcessDetachActive : Pos 11, 1 Bit<br>
   +0x074 CalloutActive    : Pos 12, 1 Bit<br>
   +0x074 ScbReadyQueue    : Pos 13, 1 Bit<br>
   +0x074 ApcQueueable     : Pos 14, 1 Bit<br>
   +0x074 ReservedStackInUse : Pos 15, 1 Bit<br>
   +0x074 UmsPerformingSyscall : Pos 16, 1 Bit<br>
   +0x074 TimerSuspended   : Pos 17, 1 Bit<br>
   +0x074 SuspendedWaitMode : Pos 18, 1 Bit<br>
   +0x074 SuspendSchedulerApcWait : Pos 19, 1 Bit<br>
   +0x074 CetUserShadowStack : Pos 20, 1 Bit<br>
   +0x074 BypassProcessFreeze : Pos 21, 1 Bit<br>
   +0x074 Reserved         : Pos 22, 10 Bits<br>
   +0x074 MiscFlags        : Int4B<br>
   +0x078 ThreadFlagsSpare : Pos 0, 2 Bits<br>
   +0x078 AutoAlignment    : Pos 2, 1 Bit<br>
   +0x078 DisableBoost     : Pos 3, 1 Bit<br>
   +0x078 AlertedByThreadId : Pos 4, 1 Bit<br>
   +0x078 QuantumDonation  : Pos 5, 1 Bit<br>
   +0x078 EnableStackSwap  : Pos 6, 1 Bit<br>
   +0x078 GuiThread        : Pos 7, 1 Bit<br>
   +0x078 DisableQuantum   : Pos 8, 1 Bit<br>
   +0x078 ChargeOnlySchedulingGroup : Pos 9, 1 Bit<br>
   +0x078 DeferPreemption  : Pos 10, 1 Bit<br>
   +0x078 QueueDeferPreemption : Pos 11, 1 Bit<br>
   +0x078 ForceDeferSchedule : Pos 12, 1 Bit<br>
   +0x078 SharedReadyQueueAffinity : Pos 13, 1 Bit<br>
   +0x078 FreezeCount      : Pos 14, 1 Bit<br>
   +0x078 TerminationApcRequest : Pos 15, 1 Bit<br>
   +0x078 AutoBoostEntriesExhausted : Pos 16, 1 Bit<br>
   +0x078 KernelStackResident : Pos 17, 1 Bit<br>
   +0x078 TerminateRequestReason : Pos 18, 2 Bits<br>
   +0x078 ProcessStackCountDecremented : Pos 20, 1 Bit<br>
   +0x078 RestrictedGuiThread : Pos 21, 1 Bit<br>
   +0x078 VpBackingThread  : Pos 22, 1 Bit<br>
   +0x078 ThreadFlagsSpare2 : Pos 23, 1 Bit<br>
   +0x078 EtwStackTraceApcInserted : Pos 24, 8 Bits<br>
   +0x078 ThreadFlags      : Int4B<br>
   +0x07c Tag              : UChar<br>
   +0x07d SystemHeteroCpuPolicy : UChar<br>
   +0x07e UserHeteroCpuPolicy : Pos 0, 7 Bits<br>
   +0x07e ExplicitSystemHeteroCpuPolicy : Pos 7, 1 Bit<br>
   +0x07f RunningNonRetpolineCode : Pos 0, 1 Bit<br>
   +0x07f SpecCtrlSpare    : Pos 1, 7 Bits<br>
   +0x07f SpecCtrl         : UChar<br>
   +0x080 SystemCallNumber : Uint4B<br>
   +0x084 ReadyTime        : Uint4B<br>
   +0x088 FirstArgument    : Ptr64 Void<br>
   +0x090 TrapFrame        : Ptr64 <a href="./_KTRAP_FRAME.html">_KTRAP_FRAME</a><br>
   +0x098 ApcState         : <a href="./_KAPC_STATE.html">_KAPC_STATE</a><br>
   +0x098 ApcStateFill     : [43] UChar<br>
   +0x0c3 Priority         : Char<br>
   +0x0c4 UserIdealProcessor : Uint4B<br>
   +0x0c8 WaitStatus       : Int8B<br>
   +0x0d0 WaitBlockList    : Ptr64 <a href="./_KWAIT_BLOCK.html">_KWAIT_BLOCK</a><br>
   +0x0d8 WaitListEntry    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d8 SwapListEntry    : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x0e8 Queue            : Ptr64 <a href="./_DISPATCHER_HEADER.html">_DISPATCHER_HEADER</a><br>
   +0x0f0 Teb              : Ptr64 Void<br>
   +0x0f8 RelativeTimerBias : Uint8B<br>
   +0x100 Timer            : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x140 WaitBlock        : [4] <a href="./_KWAIT_BLOCK.html">_KWAIT_BLOCK</a><br>
   +0x140 WaitBlockFill4   : [20] UChar<br>
   +0x154 ContextSwitches  : Uint4B<br>
   +0x140 WaitBlockFill5   : [68] UChar<br>
   +0x184 State            : UChar<br>
   +0x185 Spare13          : Char<br>
   +0x186 WaitIrql         : UChar<br>
   +0x187 WaitMode         : Char<br>
   +0x140 WaitBlockFill6   : [116] UChar<br>
   +0x1b4 WaitTime         : Uint4B<br>
   +0x140 WaitBlockFill7   : [164] UChar<br>
   +0x1e4 KernelApcDisable : Int2B<br>
   +0x1e6 SpecialApcDisable : Int2B<br>
   +0x1e4 CombinedApcDisable : Uint4B<br>
   +0x140 WaitBlockFill8   : [40] UChar<br>
   +0x168 ThreadCounters   : Ptr64 <a href="./_KTHREAD_COUNTERS.html">_KTHREAD_COUNTERS</a><br>
   +0x140 WaitBlockFill9   : [88] UChar<br>
   +0x198 XStateSave       : Ptr64 <a href="./_XSTATE_SAVE.html">_XSTATE_SAVE</a><br>
   +0x140 WaitBlockFill10  : [136] UChar<br>
   +0x1c8 Win32Thread      : Ptr64 Void<br>
   +0x140 WaitBlockFill11  : [176] UChar<br>
   +0x1f0 Ucb              : Ptr64 <a href="./_UMS_CONTROL_BLOCK.html">_UMS_CONTROL_BLOCK</a><br>
   +0x1f8 Uch              : Ptr64 <a href="./_KUMS_CONTEXT_HEADER.html">_KUMS_CONTEXT_HEADER</a><br>
   +0x200 ThreadFlags2     : Int4B<br>
   +0x200 BamQosLevel      : Pos 0, 8 Bits<br>
   +0x200 ThreadFlags2Reserved : Pos 8, 24 Bits<br>
   +0x204 Spare21          : Uint4B<br>
   +0x208 QueueListEntry   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x218 NextProcessor    : Uint4B<br>
   +0x218 NextProcessorNumber : Pos 0, 31 Bits<br>
   +0x218 SharedReadyQueue : Pos 31, 1 Bit<br>
   +0x21c QueuePriority    : Int4B<br>
   +0x220 Process          : Ptr64 <a href="./_KPROCESS.html">_KPROCESS</a><br>
   +0x228 UserAffinity     : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x228 UserAffinityFill : [10] UChar<br>
   +0x232 PreviousMode     : Char<br>
   +0x233 BasePriority     : Char<br>
   +0x234 PriorityDecrement : Char<br>
   +0x234 ForegroundBoost  : Pos 0, 4 Bits<br>
   +0x234 UnusualBoost     : Pos 4, 4 Bits<br>
   +0x235 Preempted        : UChar<br>
   +0x236 AdjustReason     : UChar<br>
   +0x237 AdjustIncrement  : Char<br>
   +0x238 AffinityVersion  : Uint8B<br>
   +0x240 Affinity         : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x240 AffinityFill     : [10] UChar<br>
   +0x24a ApcStateIndex    : UChar<br>
   +0x24b WaitBlockCount   : UChar<br>
   +0x24c IdealProcessor   : Uint4B<br>
   +0x250 NpxState         : Uint8B<br>
   +0x258 SavedApcState    : <a href="./_KAPC_STATE.html">_KAPC_STATE</a><br>
   +0x258 SavedApcStateFill : [43] UChar<br>
   +0x283 WaitReason       : UChar<br>
   +0x284 SuspendCount     : Char<br>
   +0x285 Saturation       : Char<br>
   +0x286 SListFaultCount  : Uint2B<br>
   +0x288 SchedulerApc     : <a href="./_KAPC.html">_KAPC</a><br>
   +0x288 SchedulerApcFill0 : [1] UChar<br>
   +0x289 ResourceIndex    : UChar<br>
   +0x288 SchedulerApcFill1 : [3] UChar<br>
   +0x28b QuantumReset     : UChar<br>
   +0x288 SchedulerApcFill2 : [4] UChar<br>
   +0x28c KernelTime       : Uint4B<br>
   +0x288 SchedulerApcFill3 : [64] UChar<br>
   +0x2c8 WaitPrcb         : Ptr64 <a href="./_KPRCB.html">_KPRCB</a><br>
   +0x288 SchedulerApcFill4 : [72] UChar<br>
   +0x2d0 LegoData         : Ptr64 Void<br>
   +0x288 SchedulerApcFill5 : [83] UChar<br>
   +0x2db CallbackNestingLevel : UChar<br>
   +0x2dc UserTime         : Uint4B<br>
   +0x2e0 SuspendEvent     : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x2f8 ThreadListEntry  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x308 MutantListHead   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x318 AbEntrySummary   : UChar<br>
   +0x319 AbWaitEntryCount : UChar<br>
   +0x31a AbAllocationRegionCount : UChar<br>
   +0x31b SystemPriority   : Char<br>
   +0x31c SecureThreadCookie : Uint4B<br>
   +0x320 LockEntries      : Ptr64 <a href="./_KLOCK_ENTRY.html">_KLOCK_ENTRY</a><br>
   +0x328 PropagateBoostsEntry : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x330 IoSelfBoostsEntry : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x338 PriorityFloorCounts : [16] UChar<br>
   +0x348 PriorityFloorCountsReserved : [16] UChar<br>
   +0x358 PriorityFloorSummary : Uint4B<br>
   +0x35c AbCompletedIoBoostCount : Int4B<br>
   +0x360 AbCompletedIoQoSBoostCount : Int4B<br>
   +0x364 KeReferenceCount : Int2B<br>
   +0x366 AbOrphanedEntrySummary : UChar<br>
   +0x367 AbOwnedEntryCount : UChar<br>
   +0x368 ForegroundLossTime : Uint4B<br>
   +0x370 GlobalForegroundListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x370 ForegroundDpcStackListEntry : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x378 InGlobalForegroundList : Uint8B<br>
   +0x380 ReadOperationCount : Int8B<br>
   +0x388 WriteOperationCount : Int8B<br>
   +0x390 OtherOperationCount : Int8B<br>
   +0x398 ReadTransferCount : Int8B<br>
   +0x3a0 WriteTransferCount : Int8B<br>
   +0x3a8 OtherTransferCount : Int8B<br>
   +0x3b0 QueuedScb        : Ptr64 <a href="./_KSCB.html">_KSCB</a><br>
   +0x3b8 ThreadTimerDelay : Uint4B<br>
   +0x3bc ThreadFlags3     : Int4B<br>
   +0x3bc ThreadFlags3Reserved : Pos 0, 8 Bits<br>
   +0x3bc PpmPolicy        : Pos 8, 2 Bits<br>
   +0x3bc ThreadFlags3Reserved2 : Pos 10, 22 Bits<br>
   +0x3c0 TracingPrivate   : [1] Uint8B<br>
   +0x3c8 SchedulerAssist  : Ptr64 Void<br>
   +0x3d0 AbWaitObject     : Ptr64 Void<br>
   +0x3d8 ReservedPreviousReadyTimeValue : Uint4B<br>
   +0x3e0 KernelWaitTime   : Uint8B<br>
   +0x3e8 UserWaitTime     : Uint8B<br>
   +0x3f0 GlobalUpdateVpThreadPriorityListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x3f0 UpdateVpThreadPriorityDpcStackListEntry : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x3f8 InGlobalUpdateVpThreadPriorityList : Uint8B<br>
   +0x400 SchedulerAssistPriorityFloor : Int4B<br>
   +0x404 Spare28          : Uint4B<br>
   +0x408 EndPadding       : [5] Uint8B<br>
</font></body></html>