<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_MI_SYSTEM_IMAGE_STATE</h2>
<font face="arial">   +0x000 FixupList        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 LoadLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x018 LoadLockOwner    : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x020 LoadLockCount    : Uint4B<br>
   +0x024 FixupLock        : Int4B<br>
   +0x028 FirstLoadEver    : UChar<br>
   +0x029 LargePageAll     : UChar<br>
   +0x030 LastPage         : Uint8B<br>
   +0x038 LargePageList    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 StrongCodeLoadFailureList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x058 SystemBase       : [1] Ptr64 <a href="./_KLDR_DATA_TABLE_ENTRY.html">_KLDR_DATA_TABLE_ENTRY</a><br>
   +0x060 BeingDeleted     : Ptr64 <a href="./_KLDR_DATA_TABLE_ENTRY.html">_KLDR_DATA_TABLE_ENTRY</a><br>
   +0x068 MappingRangesPushLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x070 MappingRanges    : [2] Ptr64 <a href="./_MI_DRIVER_VA.html">_MI_DRIVER_VA</a><br>
   +0x080 PageCount        : Uint8B<br>
   +0x088 PageCounts       : <a href="./_MM_SYSTEM_PAGE_COUNTS.html">_MM_SYSTEM_PAGE_COUNTS</a><br>
   +0x098 CollidedLock     : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0a0 ImageTree        : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
</font></body></html>