<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_MI_NODE_INFORMATION</h2>
<font face="arial">   +0x000 FreeLargePages   : [3] <a href="./_MI_FREE_LARGE_PAGES.html">_MI_FREE_LARGE_PAGES</a><br>
   +0xc90 LargePageRebuildTimer : <a href="./_MI_REBUILD_LARGE_PAGE_TIMER.html">_MI_REBUILD_LARGE_PAGE_TIMER</a><br>
   +0xcb8 StandbyPageList  : [4] [8] <a href="./_MMPFNLIST_SHORT.html">_MMPFNLIST_SHORT</a><br>
   +0xfc0 FreePageListHeadsBitmap : [2] <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0xfe0 FreePageListHeadsBitmapBuffer : [16] Uint4B<br>
   +0x1020 FreeCount        : [2] Uint8B<br>
   +0x1030 TotalPages       : [4] Uint8B<br>
   +0x1050 TotalPagesEntireNode : Uint8B<br>
   +0x1058 CurrentHugeRangeColor : Uint4B<br>
   +0x1060 HugeIoRangeFreeCount : [2] Uint8B<br>
   +0x1070 MmShiftedColor   : Uint4B<br>
   +0x1074 Color            : Uint4B<br>
   +0x1078 ChannelFreeCount : [4] [2] Uint8B<br>
   +0x10b8 Flags            : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x10bc LargeListMoveInProgress : Uint4B<br>
   +0x10c0 LargeListWaiters : Ptr64 <a href="./_MI_LARGE_PAGE_LISTS_CHANGING.html">_MI_LARGE_PAGE_LISTS_CHANGING</a><br>
   +0x10c8 NodeLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x10d0 ZeroThreadHugeMapLock : Uint8B<br>
   +0x10d8 ChannelStatus    : UChar<br>
   +0x10d9 ChannelOrdering  : [4] UChar<br>
   +0x10dd LockedChannelOrdering : [4] UChar<br>
   +0x10e1 PowerAttribute   : [4] UChar<br>
   +0x10e8 LargePageLock    : Uint8B<br>
   +0x10f0 PageColorTable   : <a href="./_MI_PAGE_COLORS.html">_MI_PAGE_COLORS</a><br>
   +0x1100 NumberOfPagesGoingBad : Uint8B<br>
   +0x1108 WriteCalibration : <a href="./_MI_WRITE_CALIBRATION.html">_MI_WRITE_CALIBRATION</a><br>
   +0x1128 BootZeroContext  : Ptr64 Void<br>
   +0x1130 BootZeroPageTimesPerProcessor : Ptr64 Void<br>
   +0x1138 ZeroingVaBase    : Ptr64 Void<br>
   +0x1140 TotalBytesToZero : Uint8B<br>
   +0x1148 PerProcessorNumberOfBytesToZero : Uint8B<br>
   +0x1150 ZeroingContext   : Ptr64 Void<br>
   +0x1158 ZeroingProcessorCount : Uint4B<br>
   +0x115c ZeroHand         : Int4B<br>
   +0x1160 FinishedProcessors : Int4B<br>
   +0x1168 CyclesToZeroOneLargePage : Uint8B<br>
   +0x1170 ScaledCyclesToZeroOneLargePage : Ptr64 Uint8B<br>
   +0x1178 GroupAffinity    : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x1188 ProcessorCount   : Uint2B<br>
   +0x118a BackgroundZeroingActive : UChar<br>
   +0x1190 ZeroingPhysicalMemoryBlock : Ptr64 <a href="./_PHYSICAL_MEMORY_DESCRIPTOR.html">_PHYSICAL_MEMORY_DESCRIPTOR</a><br>
</font></body></html>