<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_MI_SECTION_STATE</h2>
<font face="arial">   +0x000 SectionObjectPointersLock : Int4B<br>
   +0x008 SectionBasedRoot : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x010 SectionBasedLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x018 UnusedSegmentPagedPool : Uint8B<br>
   +0x020 DataSectionProtectionMask : Uint4B<br>
   +0x028 HighSectionBase  : Ptr64 Void<br>
   +0x030 PhysicalSubsection : <a href="./_MSUBSECTION.html">_MSUBSECTION</a><br>
   +0x0c0 PhysicalControlArea : <a href="./_CONTROL_AREA.html">_CONTROL_AREA</a><br>
   +0x140 PurgingExtentPages : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x168 DanglingExtentPages : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x170 DanglingExtentsWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x190 DanglingExtentsDeletionWaitList : <a href="./_MI_EXTENT_DELETION_WAIT_BLOCK.html">_MI_EXTENT_DELETION_WAIT_BLOCK</a><br>
   +0x1b0 FileOnlyMemoryPfnsCreated : UChar<br>
   +0x1b1 DanglingExtentsWorkerActive : UChar<br>
   +0x1b2 PurgingExtentsNeedWatchdog : UChar<br>
   +0x1b8 PrototypePtesTree : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x1c0 PrototypePtesTreeSpinLock : Int4B<br>
   +0x1c8 RelocateBitmapsLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x1d0 ImageBitMapNative : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x1e0 ImageBiasNative  : Uint8B<br>
   +0x1e8 OverflowArea     : <a href="./_MI_DLL_OVERFLOW_AREA.html">_MI_DLL_OVERFLOW_AREA</a><br>
   +0x208 Wow              : [1] <a href="./_MI_SECTION_WOW_STATE.html">_MI_SECTION_WOW_STATE</a><br>
   +0x248 ImageBiasWow     : Uint8B<br>
   +0x250 ImageBitMapWowScratch : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x260 ImageBitMap64Low : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x270 ImageBias64Low   : Uint8B<br>
   +0x278 ApiSetSection    : Ptr64 Void<br>
   +0x280 ApiSetSchema     : Ptr64 Void<br>
   +0x288 ApiSetSchemaSize : Uint8B<br>
   +0x290 LostDataFiles    : Uint4B<br>
   +0x294 LostDataPages    : Uint4B<br>
   +0x298 ImageFailureReason : Uint4B<br>
   +0x2a0 CfgBitMapSection : Ptr64 <a href="./_SECTION.html">_SECTION</a><br>
   +0x2a8 CfgBitMapControlArea : Ptr64 <a href="./_CONTROL_AREA.html">_CONTROL_AREA</a><br>
   +0x2b0 KernelCfgBitMap  : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x2c0 KernelCfgBitMapLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x2c8 ImageCfgFailure  : Uint4B<br>
   +0x2cc RetpolineReservePages : Uint4B<br>
   +0x2d0 RetpolineStubMdl : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x2d8 KernelRetpolineBitMap : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x2e8 RetpolineRoutines : Ptr64 <a href="./_RTL_RETPOLINE_ROUTINES.html">_RTL_RETPOLINE_ROUTINES</a><br>
   +0x2f0 RetpolineRevertPte : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x2f8 NonRetpolineImageLoadList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x308 RetpolineStubPages : Uint4B<br>
   +0x30c RetpolineBootStatus : Int4B<br>
   +0x310 ImageBreakpointEnabled : Uint4B<br>
   +0x314 ImageBreakpointChecksum : Uint4B<br>
   +0x318 ImageBreakpointSize : Uint4B<br>
   +0x31c ImageValidationFailed : Int4B<br>
   +0x320 ImageExtentTree  : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x328 ImageExtentTreeLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x330 HotPatchReserveSize : Uint4B<br>
</font></body></html>