<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_PEP_ACPI_GPIO_RESOURCE</h2>
<font face="arial">   +0x000 Type             : <a href="./_PEP_ACPI_RESOURCE_TYPE.html">_PEP_ACPI_RESOURCE_TYPE</a><br>
   +0x004 Flags            : <a href="./_PEP_ACPI_RESOURCE_FLAGS.html">_PEP_ACPI_RESOURCE_FLAGS</a><br>
   +0x008 InterruptType    : <a href="./_KINTERRUPT_MODE.html">_KINTERRUPT_MODE</a><br>
   +0x00c InterruptPolarity : <a href="./_KINTERRUPT_POLARITY.html">_KINTERRUPT_POLARITY</a><br>
   +0x010 PinConfig        : <a href="./_GPIO_PIN_CONFIG_TYPE.html">_GPIO_PIN_CONFIG_TYPE</a><br>
   +0x014 IoRestrictionType : <a href="./_GPIO_PIN_IORESTRICTION_TYPE.html">_GPIO_PIN_IORESTRICTION_TYPE</a><br>
   +0x018 DriveStrength    : Uint2B<br>
   +0x01a DebounceTimeout  : Uint2B<br>
   +0x020 PinTable         : Ptr64 Wchar<br>
   +0x028 PinCount         : Uint2B<br>
   +0x02a ResourceSourceIndex : UChar<br>
   +0x030 ResourceSourceName : Ptr64 <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x038 VendorData       : Ptr64 UChar<br>
   +0x040 VendorDataLength : Uint2B<br>
</font></body></html>