<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_POP_FX_DEVICE_STATUS</h2>
<font face="arial">   +0x000 Value            : Int4B<br>
   +0x000 SystemTransition : Pos 0, 1 Bit<br>
   +0x000 PepD0Notify      : Pos 1, 1 Bit<br>
   +0x000 IdleTimerOn      : Pos 2, 1 Bit<br>
   +0x000 IgnoreIdleTimeout : Pos 3, 1 Bit<br>
   +0x000 IrpInUse         : Pos 4, 1 Bit<br>
   +0x000 IrpPending       : Pos 5, 1 Bit<br>
   +0x000 DPNRDeviceNotified : Pos 6, 1 Bit<br>
   +0x000 DPNRReceivedFromPep : Pos 7, 1 Bit<br>
   +0x000 IrpFirstPendingIndex : Pos 8, 1 Bit<br>
   +0x000 IrpLastPendingIndex : Pos 9, 1 Bit<br>
   +0x000 SIrpBlocked      : Pos 10, 1 Bit<br>
   +0x000 BlockFastResume  : Pos 11, 1 Bit<br>
   +0x000 DirectedPoweredDown : Pos 12, 1 Bit<br>
   +0x000 DirectedTransitionInProgress : Pos 13, 1 Bit<br>
   +0x000 Reserved         : Pos 14, 18 Bits<br>
</font></body></html>