<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_REGISTERED_INTERRUPT_CONTROLLER</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 InternalData     : Ptr64 Void<br>
   +0x018 InternalDataSize : Uint4B<br>
   +0x020 FunctionTable    : <a href="./_INTERRUPT_FUNCTION_TABLE.html">_INTERRUPT_FUNCTION_TABLE</a><br>
   +0x0d8 KnownType        : <a href="./_KNOWN_CONTROLLER_TYPE.html">_KNOWN_CONTROLLER_TYPE</a><br>
   +0x0dc Capabilities     : Uint4B<br>
   +0x0e0 Flags            : Uint4B<br>
   +0x0e4 MaxPriority      : Uint4B<br>
   +0x0e8 UnitId           : Uint4B<br>
   +0x0f0 LinesHead        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x100 OutputLinesHead  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x110 MinLine          : Int4B<br>
   +0x114 MaxLine          : Int4B<br>
   +0x118 MaxClusterSize   : Uint4B<br>
   +0x11c MaxClusters      : Uint4B<br>
   +0x120 InterruptReplayDataSize : Uint4B<br>
   +0x124 Problem          : <a href="./_INTERRUPT_PROBLEM.html">_INTERRUPT_PROBLEM</a><br>
   +0x128 ProblemStatus    : Int4B<br>
   +0x130 ProblemSourceFile : Ptr64 Char<br>
   +0x138 ProblemSourceLine : Uint4B<br>
   +0x13c CustomProblem    : Uint4B<br>
   +0x140 CustomProblemStatus : Int4B<br>
   +0x148 ResourceId       : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x158 PowerHandle      : Ptr64 <a href="./POHANDLE__.html">POHANDLE__</a><br>
</font></body></html>