<html><body>
<h4>Windows 10 x64 (19042.572) 20H2</h4><br>
<h2>_SYSTEM_POWER_POLICY</h2>
<font face="arial">   +0x000 Revision         : Uint4B<br>
   +0x004 PowerButton      : <a href="./POWER_ACTION_POLICY.html">POWER_ACTION_POLICY</a><br>
   +0x010 SleepButton      : <a href="./POWER_ACTION_POLICY.html">POWER_ACTION_POLICY</a><br>
   +0x01c LidClose         : <a href="./POWER_ACTION_POLICY.html">POWER_ACTION_POLICY</a><br>
   +0x028 LidOpenWake      : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x02c Reserved         : Uint4B<br>
   +0x030 Idle             : <a href="./POWER_ACTION_POLICY.html">POWER_ACTION_POLICY</a><br>
   +0x03c IdleTimeout      : Uint4B<br>
   +0x040 IdleSensitivity  : UChar<br>
   +0x041 DynamicThrottle  : UChar<br>
   +0x042 Spare2           : [2] UChar<br>
   +0x044 MinSleep         : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x048 MaxSleep         : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x04c ReducedLatencySleep : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x050 WinLogonFlags    : Uint4B<br>
   +0x054 Spare3           : Uint4B<br>
   +0x058 DozeS4Timeout    : Uint4B<br>
   +0x05c BroadcastCapacityResolution : Uint4B<br>
   +0x060 DischargePolicy  : [4] <a href="./SYSTEM_POWER_LEVEL.html">SYSTEM_POWER_LEVEL</a><br>
   +0x0c0 VideoTimeout     : Uint4B<br>
   +0x0c4 VideoDimDisplay  : UChar<br>
   +0x0c8 VideoReserved    : [3] Uint4B<br>
   +0x0d4 SpindownTimeout  : Uint4B<br>
   +0x0d8 OptimizeForPower : UChar<br>
   +0x0d9 FanThrottleTolerance : UChar<br>
   +0x0da ForcedThrottle   : UChar<br>
   +0x0db MinThrottle      : UChar<br>
   +0x0dc OverThrottled    : <a href="./POWER_ACTION_POLICY.html">POWER_ACTION_POLICY</a><br>
</font></body></html>