<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_HEADLESS_LOADER_BLOCK</h2>
<font face="arial">   +0x000 UsedBiosSettings : UChar<br>
   +0x001 DataBits         : UChar<br>
   +0x002 StopBits         : UChar<br>
   +0x003 Parity           : UChar<br>
   +0x004 BaudRate         : Uint4B<br>
   +0x008 PortNumber       : Uint4B<br>
   +0x010 PortAddress      : Ptr64 UChar<br>
   +0x018 PciDeviceId      : Uint2B<br>
   +0x01a PciVendorId      : Uint2B<br>
   +0x01c PciBusNumber     : UChar<br>
   +0x01e PciBusSegment    : Uint2B<br>
   +0x020 PciSlotNumber    : UChar<br>
   +0x021 PciFunctionNumber : UChar<br>
   +0x024 PciFlags         : Uint4B<br>
   +0x028 SystemGUID       : <a href="./_GUID.html">_GUID</a><br>
   +0x038 IsMMIODevice     : UChar<br>
   +0x039 TerminalType     : UChar<br>
   +0x03a InterfaceType    : UChar<br>
   +0x03b RegisterBitWidth : UChar<br>
   +0x03c RegisterAccessSize : UChar<br>
</font></body></html>