<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_HIVE_LIST_ENTRY</h2>
<font face="arial">   +0x000 FileName         : Ptr64 Wchar<br>
   +0x008 BaseName         : Ptr64 Wchar<br>
   +0x010 RegRootName      : Ptr64 Wchar<br>
   +0x018 CmHive           : Ptr64 <a href="./_CMHIVE.html">_CMHIVE</a><br>
   +0x020 HHiveFlags       : Uint4B<br>
   +0x024 CmHiveFlags      : Uint4B<br>
   +0x028 CmKcbCacheSize   : Uint4B<br>
   +0x030 CmHive2          : Ptr64 <a href="./_CMHIVE.html">_CMHIVE</a><br>
   +0x038 HiveMounted      : UChar<br>
   +0x039 ThreadFinished   : UChar<br>
   +0x03a ThreadStarted    : UChar<br>
   +0x03b Allocate         : UChar<br>
   +0x03c WinPERequired    : UChar<br>
   +0x040 StartEvent       : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x058 FinishedEvent    : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x070 MountLock        : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x088 FilePath         : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>