<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_KPROCESS</h2>
<font face="arial">   +0x000 Header           : <a href="./_DISPATCHER_HEADER.html">_DISPATCHER_HEADER</a><br>
   +0x018 ProfileListHead  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 DirectoryTableBase : Uint8B<br>
   +0x030 ThreadListHead   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x040 ProcessLock      : Uint4B<br>
   +0x044 ProcessTimerDelay : Uint4B<br>
   +0x048 DeepFreezeStartTime : Uint8B<br>
   +0x050 Affinity         : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0f8 ReadyListHead    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x108 SwapListEntry    : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x110 ActiveProcessors : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x1b8 AutoAlignment    : Pos 0, 1 Bit<br>
   +0x1b8 DisableBoost     : Pos 1, 1 Bit<br>
   +0x1b8 DisableQuantum   : Pos 2, 1 Bit<br>
   +0x1b8 DeepFreeze       : Pos 3, 1 Bit<br>
   +0x1b8 TimerVirtualization : Pos 4, 1 Bit<br>
   +0x1b8 CheckStackExtents : Pos 5, 1 Bit<br>
   +0x1b8 CacheIsolationEnabled : Pos 6, 1 Bit<br>
   +0x1b8 PpmPolicy        : Pos 7, 3 Bits<br>
   +0x1b8 VaSpaceDeleted   : Pos 10, 1 Bit<br>
   +0x1b8 ReservedFlags    : Pos 11, 21 Bits<br>
   +0x1b8 ProcessFlags     : Int4B<br>
   +0x1bc ActiveGroupsMask : Uint4B<br>
   +0x1c0 BasePriority     : Char<br>
   +0x1c1 QuantumReset     : Char<br>
   +0x1c2 Visited          : Char<br>
   +0x1c3 Flags            : <a href="./_KEXECUTE_OPTIONS.html">_KEXECUTE_OPTIONS</a><br>
   +0x1c4 ThreadSeed       : [20] Uint2B<br>
   +0x1ec IdealProcessor   : [20] Uint2B<br>
   +0x214 IdealNode        : [20] Uint2B<br>
   +0x23c IdealGlobalNode  : Uint2B<br>
   +0x23e Spare1           : Uint2B<br>
   +0x240 StackCount       : <a href="./_KSTACK_COUNT.html">_KSTACK_COUNT</a><br>
   +0x248 ProcessListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x258 CycleTime        : Uint8B<br>
   +0x260 ContextSwitches  : Uint8B<br>
   +0x268 SchedulingGroup  : Ptr64 <a href="./_KSCHEDULING_GROUP.html">_KSCHEDULING_GROUP</a><br>
   +0x270 FreezeCount      : Uint4B<br>
   +0x274 KernelTime       : Uint4B<br>
   +0x278 UserTime         : Uint4B<br>
   +0x27c ReadyTime        : Uint4B<br>
   +0x280 UserDirectoryTableBase : Uint8B<br>
   +0x288 AddressPolicy    : UChar<br>
   +0x289 Spare2           : [71] UChar<br>
   +0x2d0 InstrumentationCallback : Ptr64 Void<br>
   +0x2d8 SecureState      : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>