<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_MI_FLAGS</h2>
<font face="arial">   +0x000 EntireFlags      : Int4B<br>
   +0x000 VerifierEnabled  : Pos 0, 1 Bit<br>
   +0x000 KernelVerifierEnabled : Pos 1, 1 Bit<br>
   +0x000 LargePageKernel  : Pos 2, 1 Bit<br>
   +0x000 StopOn4d         : Pos 3, 1 Bit<br>
   +0x000 InitializationPhase : Pos 4, 2 Bits<br>
   +0x000 PageKernelStacks : Pos 6, 1 Bit<br>
   +0x000 CheckZeroPages   : Pos 7, 1 Bit<br>
   +0x000 ProcessorPrewalks : Pos 8, 1 Bit<br>
   +0x000 ProcessorPostwalks : Pos 9, 1 Bit<br>
   +0x000 CoverageBuild    : Pos 10, 1 Bit<br>
   +0x000 AccessBitReplacementDisabled : Pos 11, 1 Bit<br>
   +0x000 CheckExecute     : Pos 12, 1 Bit<br>
   +0x000 ProtectedPagesEnabled : Pos 13, 1 Bit<br>
   +0x000 SecureRelocations : Pos 14, 1 Bit<br>
   +0x000 StrongPageIdentity : Pos 15, 1 Bit<br>
   +0x000 StrongCodeGuarantees : Pos 16, 1 Bit<br>
   +0x000 HardCodeGuarantees : Pos 17, 1 Bit<br>
   +0x000 ExecutePagePrivilegeRequired : Pos 18, 1 Bit<br>
   +0x000 SecureKernelCfgEnabled : Pos 19, 1 Bit<br>
   +0x000 FullHvci         : Pos 20, 1 Bit<br>
   +0x000 BootDebuggerActive : Pos 21, 1 Bit<br>
   +0x000 ExceptionHandlingReady : Pos 22, 1 Bit<br>
   +0x000 ShadowStacksSupported : Pos 23, 1 Bit<br>
   +0x000 AccessBitFenceRequired : Pos 24, 1 Bit<br>
   +0x000 PfnDatabaseExists : Pos 25, 1 Bit<br>
   +0x000 DeferredHotAddsCompleted : Pos 26, 1 Bit<br>
   +0x000 KernelHalLargeSectionAlignment : Pos 27, 1 Bit<br>
</font></body></html>