<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_MI_PARTITION_CORE</h2>
<font face="arial">   +0x000 PartitionId      : Uint2B<br>
   +0x004 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x008 Signature        : Uint4B<br>
   +0x00c MemoryConfigurationChanged : UChar<br>
   +0x010 NodeInformation  : Ptr64 <a href="./_MI_NODE_INFORMATION.html">_MI_NODE_INFORMATION</a><br>
   +0x018 PageRoot         : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x020 MemoryNodeRuns   : Ptr64 <a href="./_PHYSICAL_MEMORY_DESCRIPTOR.html">_PHYSICAL_MEMORY_DESCRIPTOR</a><br>
   +0x028 MemoryBlockReferences : Uint8B<br>
   +0x030 PfnUnmapWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x050 PfnUnmapCount    : Uint8B<br>
   +0x058 PfnUnmapWaitList : Ptr64 Void<br>
   +0x060 MemoryRuns       : Ptr64 <a href="./_PHYSICAL_MEMORY_DESCRIPTOR.html">_PHYSICAL_MEMORY_DESCRIPTOR</a><br>
   +0x068 ExitEvent        : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x080 SystemThreadHandles : [5] Ptr64 Void<br>
   +0x0a8 PartitionObject  : Ptr64 <a href="./_EPARTITION.html">_EPARTITION</a><br>
   +0x0b0 PartitionSystemThreadsLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0b8 DynamicMemoryPushLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0c0 DynamicMemoryLock : Int4B<br>
   +0x0c4 PfnUnmapActive   : UChar<br>
   +0x0c8 TemporaryMemoryEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x0e0 RootDirectory    : Ptr64 Void<br>
   +0x0e8 KernelObjectsDirectory : Ptr64 Void<br>
   +0x0f0 MemoryEvents     : [11] Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x148 MemoryEventHandles : [11] Ptr64 Void<br>
   +0x1a0 TotalHugeIoRanges : Uint8B<br>
   +0x1a8 NonChargedSecurePages : Uint8B<br>
</font></body></html>