<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_MI_SYSTEM_PTE_STATE</h2>
<font face="arial">   +0x000 MdlTrackerLookaside : <a href="./_NPAGED_LOOKASIDE_LIST.html">_NPAGED_LOOKASIDE_LIST</a><br>
   +0x080 DeadPteTrackerSListHead : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x090 PteTrackerLock   : Uint8B<br>
   +0x098 PteTrackingBitmap : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x0a8 CachedPteHeads   : Ptr64 <a href="./_MI_CACHED_PTES.html">_MI_CACHED_PTES</a><br>
   +0x0b0 CachedKernelStackPteHeads : Ptr64 <a href="./_MI_CACHED_PTES.html">_MI_CACHED_PTES</a><br>
   +0x0b8 SystemViewPteInfo : <a href="./_MI_SYSTEM_PTE_TYPE.html">_MI_SYSTEM_PTE_TYPE</a><br>
   +0x118 KernelStackPteInfo : <a href="./_MI_SYSTEM_PTE_TYPE.html">_MI_SYSTEM_PTE_TYPE</a><br>
   +0x178 StackGrowthFailures : Uint4B<br>
   +0x17c KernelStackPages : UChar<br>
   +0x17d TrackPtesAborted : UChar<br>
   +0x17e AdjustCounter    : UChar<br>
   +0x180 ReservedMappingLock : Int4B<br>
   +0x188 ReservedMappingTree : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x190 ReservedMappingPageTablePfns : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x198 OutswappedKernelStackRoot : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x1a0 OutswappedKernelStackLock : Int4B<br>
   +0x1a8 UltraSpaceContext : <a href="./_MI_ULTRA_VA_CONTEXT.html">_MI_ULTRA_VA_CONTEXT</a><br>
   +0x1e8 NumberOfUltraMdlMaps : Uint4B<br>
   +0x1f0 UltraMdlNodeMappings : Ptr64 <a href="./_MI_ULTRA_MDL_NODE.html">_MI_ULTRA_MDL_NODE</a><br>
</font></body></html>