<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_OBJECT_HEADER</h2>
<font face="arial">   +0x000 PointerCount     : Int8B<br>
   +0x008 HandleCount      : Int8B<br>
   +0x008 NextToFree       : Ptr64 Void<br>
   +0x010 Lock             : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x018 TypeIndex        : UChar<br>
   +0x019 TraceFlags       : UChar<br>
   +0x019 DbgRefTrace      : Pos 0, 1 Bit<br>
   +0x019 DbgTracePermanent : Pos 1, 1 Bit<br>
   +0x01a InfoMask         : UChar<br>
   +0x01b Flags            : UChar<br>
   +0x01b NewObject        : Pos 0, 1 Bit<br>
   +0x01b KernelObject     : Pos 1, 1 Bit<br>
   +0x01b KernelOnlyAccess : Pos 2, 1 Bit<br>
   +0x01b ExclusiveObject  : Pos 3, 1 Bit<br>
   +0x01b PermanentObject  : Pos 4, 1 Bit<br>
   +0x01b DefaultSecurityQuota : Pos 5, 1 Bit<br>
   +0x01b SingleHandleEntry : Pos 6, 1 Bit<br>
   +0x01b DeletedInline    : Pos 7, 1 Bit<br>
   +0x01c Reserved         : Uint4B<br>
   +0x020 ObjectCreateInfo : Ptr64 <a href="./_OBJECT_CREATE_INFORMATION.html">_OBJECT_CREATE_INFORMATION</a><br>
   +0x020 QuotaBlockCharged : Ptr64 Void<br>
   +0x028 SecurityDescriptor : Ptr64 Void<br>
   +0x030 Body             : <a href="./_QUAD.html">_QUAD</a><br>
</font></body></html>