<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_PROCESSOR_IDLE_CONSTRAINTS</h2>
<font face="arial">   +0x000 TotalTime        : Uint8B<br>
   +0x008 IdleTime         : Uint8B<br>
   +0x010 ExpectedIdleDuration : Uint8B<br>
   +0x018 MaxIdleDuration  : Uint8B<br>
   +0x020 OverrideState    : Uint4B<br>
   +0x024 TimeCheck        : Uint4B<br>
   +0x028 PromotePercent   : UChar<br>
   +0x029 DemotePercent    : UChar<br>
   +0x02a Parked           : UChar<br>
   +0x02b Interruptible    : UChar<br>
   +0x02c PlatformIdle     : UChar<br>
   +0x02d ExpectedWakeReason : UChar<br>
   +0x02e IdleStateMax     : UChar<br>
</font></body></html>