<html><body>
<h4>Windows 10 x64 (18362.356)</h4><br>
<h2>_PROC_PERF_CHECK</h2>
<font face="arial">   +0x000 LastActive       : Uint8B<br>
   +0x008 LastTime         : Uint8B<br>
   +0x010 LastStall        : Uint8B<br>
   +0x018 LastResponsivenessEvents : Uint4B<br>
   +0x020 LastPerfCheckSnap : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x078 CurrentSnap      : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x0d0 LastDeliveredSnap : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x128 LastDeliveredPerformance : Uint4B<br>
   +0x12c LastDeliveredFrequency : Uint4B<br>
   +0x130 TaggedThreadPercent : [2] UChar<br>
   +0x132 Class0FloorPerfSelection : UChar<br>
   +0x133 Class1MinimumPerfSelection : UChar<br>
   +0x134 CurrentResponsivenessEvents : Uint4B<br>
</font></body></html>