<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_DEVICE_DESCRIPTION</h2>
<font face="arial">   +0x000 Version          : Uint4B<br>
   +0x004 Master           : UChar<br>
   +0x005 ScatterGather    : UChar<br>
   +0x006 DemandMode       : UChar<br>
   +0x007 AutoInitialize   : UChar<br>
   +0x008 Dma32BitAddresses : UChar<br>
   +0x009 IgnoreCount      : UChar<br>
   +0x00a Reserved1        : UChar<br>
   +0x00b Dma64BitAddresses : UChar<br>
   +0x00c BusNumber        : Uint4B<br>
   +0x010 DmaChannel       : Uint4B<br>
   +0x014 InterfaceType    : <a href="./_INTERFACE_TYPE.html">_INTERFACE_TYPE</a><br>
   +0x018 DmaWidth         : <a href="./_DMA_WIDTH.html">_DMA_WIDTH</a><br>
   +0x01c DmaSpeed         : <a href="./_DMA_SPEED.html">_DMA_SPEED</a><br>
   +0x020 MaximumLength    : Uint4B<br>
   +0x024 DmaPort          : Uint4B<br>
   +0x028 DmaAddressWidth  : Uint4B<br>
   +0x02c DmaControllerInstance : Uint4B<br>
   +0x030 DmaRequestLine   : Uint4B<br>
   +0x038 DeviceAddress    : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
</font></body></html>