<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_ETIMER</h2>
<font face="arial">   +0x000 KeTimer          : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x040 Lock             : Uint8B<br>
   +0x048 TimerApc         : <a href="./_KAPC.html">_KAPC</a><br>
   +0x0a0 TimerDpc         : <a href="./_KDPC.html">_KDPC</a><br>
   +0x0e0 ActiveTimerListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0f0 Period           : Uint4B<br>
   +0x0f4 TimerFlags       : Char<br>
   +0x0f4 ApcAssociated    : Pos 0, 1 Bit<br>
   +0x0f4 FlushDpcs        : Pos 1, 1 Bit<br>
   +0x0f4 Paused           : Pos 2, 1 Bit<br>
   +0x0f4 Spare1           : Pos 3, 5 Bits<br>
   +0x0f5 DueTimeType      : UChar<br>
   +0x0f6 Spare2           : Uint2B<br>
   +0x0f8 WakeReason       : Ptr64 <a href="./_DIAGNOSTIC_CONTEXT.html">_DIAGNOSTIC_CONTEXT</a><br>
   +0x100 WakeTimerListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x110 VirtualizedTimerCookie : Ptr64 Void<br>
   +0x118 VirtualizedTimerLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x128 DueTime          : Uint8B<br>
   +0x130 CoalescingWindow : Uint4B<br>
</font></body></html>