<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_ETW_REALTIME_CONSUMER</h2>
<font face="arial">   +0x000 Links            : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 ProcessHandle    : Ptr64 Void<br>
   +0x018 ProcessObject    : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x020 NextNotDelivered : Ptr64 Void<br>
   +0x028 RealtimeConnectContext : Ptr64 Void<br>
   +0x030 DisconnectEvent  : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x038 DataAvailableEvent : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x040 UserBufferCount  : Ptr64 Uint4B<br>
   +0x048 UserBufferListHead : Ptr64 <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x050 BuffersLost      : Uint4B<br>
   +0x054 EmptyBuffersCount : Uint4B<br>
   +0x058 LoggerId         : Uint2B<br>
   +0x05a Flags            : UChar<br>
   +0x05a ShutDownRequested : Pos 0, 1 Bit<br>
   +0x05a NewBuffersLost   : Pos 1, 1 Bit<br>
   +0x05a Disconnected     : Pos 2, 1 Bit<br>
   +0x05a Notified         : Pos 3, 1 Bit<br>
   +0x05a Wow              : Pos 4, 1 Bit<br>
   +0x060 ReservedBufferSpaceBitMap : <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x070 ReservedBufferSpace : Ptr64 UChar<br>
   +0x078 ReservedBufferSpaceSize : Uint4B<br>
   +0x07c UserPagesAllocated : Uint4B<br>
   +0x080 UserPagesReused  : Uint4B<br>
   +0x088 EventsLostCount  : Ptr64 Uint4B<br>
   +0x090 BuffersLostCount : Ptr64 Uint4B<br>
   +0x098 SiloState        : Ptr64 <a href="./_ETW_SILODRIVERSTATE.html">_ETW_SILODRIVERSTATE</a><br>
</font></body></html>