<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_HANDLE_TABLE_ENTRY</h2>
<font face="arial">   +0x000 VolatileLowValue : Int8B<br>
   +0x000 LowValue         : Int8B<br>
   +0x000 InfoTable        : Ptr64 <a href="./_HANDLE_TABLE_ENTRY_INFO.html">_HANDLE_TABLE_ENTRY_INFO</a><br>
   +0x008 HighValue        : Int8B<br>
   +0x008 NextFreeHandleEntry : Ptr64 <a href="./_HANDLE_TABLE_ENTRY.html">_HANDLE_TABLE_ENTRY</a><br>
   +0x008 LeafHandleValue  : <a href="./_EXHANDLE.html">_EXHANDLE</a><br>
   +0x000 RefCountField    : Int8B<br>
   +0x000 Unlocked         : Pos 0, 1 Bit<br>
   +0x000 RefCnt           : Pos 1, 16 Bits<br>
   +0x000 Attributes       : Pos 17, 3 Bits<br>
   +0x000 ObjectPointerBits : Pos 20, 44 Bits<br>
   +0x008 GrantedAccessBits : Pos 0, 25 Bits<br>
   +0x008 NoRightsUpgrade  : Pos 25, 1 Bit<br>
   +0x008 Spare1           : Pos 26, 6 Bits<br>
   +0x00c Spare2           : Uint4B<br>
</font></body></html>