<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_KEXCEPTION_FRAME</h2>
<font face="arial">   +0x000 P1Home           : Uint8B<br>
   +0x008 P2Home           : Uint8B<br>
   +0x010 P3Home           : Uint8B<br>
   +0x018 P4Home           : Uint8B<br>
   +0x020 P5               : Uint8B<br>
   +0x028 Spare1           : Uint8B<br>
   +0x030 Xmm6             : <a href="./_M128A.html">_M128A</a><br>
   +0x040 Xmm7             : <a href="./_M128A.html">_M128A</a><br>
   +0x050 Xmm8             : <a href="./_M128A.html">_M128A</a><br>
   +0x060 Xmm9             : <a href="./_M128A.html">_M128A</a><br>
   +0x070 Xmm10            : <a href="./_M128A.html">_M128A</a><br>
   +0x080 Xmm11            : <a href="./_M128A.html">_M128A</a><br>
   +0x090 Xmm12            : <a href="./_M128A.html">_M128A</a><br>
   +0x0a0 Xmm13            : <a href="./_M128A.html">_M128A</a><br>
   +0x0b0 Xmm14            : <a href="./_M128A.html">_M128A</a><br>
   +0x0c0 Xmm15            : <a href="./_M128A.html">_M128A</a><br>
   +0x0d0 TrapFrame        : Uint8B<br>
   +0x0d8 OutputBuffer     : Uint8B<br>
   +0x0e0 OutputLength     : Uint8B<br>
   +0x0e8 Spare2           : Uint8B<br>
   +0x0f0 MxCsr            : Uint8B<br>
   +0x0f8 Rbp              : Uint8B<br>
   +0x100 Rbx              : Uint8B<br>
   +0x108 Rdi              : Uint8B<br>
   +0x110 Rsi              : Uint8B<br>
   +0x118 R12              : Uint8B<br>
   +0x120 R13              : Uint8B<br>
   +0x128 R14              : Uint8B<br>
   +0x130 R15              : Uint8B<br>
   +0x138 Return           : Uint8B<br>
</font></body></html>