<html><body>
<h4>Windows 10 x64 (18362.418)</h4><br>
<h2>_MI_SYSTEM_INFORMATION</h2>
<font face="arial">   +0x000 Pools            : <a href="./_MI_POOL_STATE.html">_MI_POOL_STATE</a><br>
   +0x0c0 Sections         : <a href="./_MI_SECTION_STATE.html">_MI_SECTION_STATE</a><br>
   +0x400 SystemImages     : <a href="./_MI_SYSTEM_IMAGE_STATE.html">_MI_SYSTEM_IMAGE_STATE</a><br>
   +0x4a0 Sessions         : <a href="./_MI_SESSION_STATE.html">_MI_SESSION_STATE</a><br>
   +0x1520 Processes        : <a href="./_MI_PROCESS_STATE.html">_MI_PROCESS_STATE</a><br>
   +0x1580 Hardware         : <a href="./_MI_HARDWARE_STATE.html">_MI_HARDWARE_STATE</a><br>
   +0x1740 SystemVa         : <a href="./_MI_SYSTEM_VA_STATE.html">_MI_SYSTEM_VA_STATE</a><br>
   +0x1bc0 PageCombines     : <a href="./_MI_COMBINE_STATE.html">_MI_COMBINE_STATE</a><br>
   +0x1be0 PageLists        : <a href="./_MI_PAGELIST_STATE.html">_MI_PAGELIST_STATE</a><br>
   +0x1c40 Partitions       : <a href="./_MI_PARTITION_STATE.html">_MI_PARTITION_STATE</a><br>
   +0x1d00 Shutdowns        : <a href="./_MI_SHUTDOWN_STATE.html">_MI_SHUTDOWN_STATE</a><br>
   +0x1d78 Errors           : <a href="./_MI_ERROR_STATE.html">_MI_ERROR_STATE</a><br>
   +0x1e40 AccessLog        : <a href="./_MI_ACCESS_LOG_STATE.html">_MI_ACCESS_LOG_STATE</a><br>
   +0x1ec0 Debugger         : <a href="./_MI_DEBUGGER_STATE.html">_MI_DEBUGGER_STATE</a><br>
   +0x1fe0 Standby          : <a href="./_MI_STANDBY_STATE.html">_MI_STANDBY_STATE</a><br>
   +0x2080 SystemPtes       : <a href="./_MI_SYSTEM_PTE_STATE.html">_MI_SYSTEM_PTE_STATE</a><br>
   +0x2280 IoPages          : <a href="./_MI_IO_PAGE_STATE.html">_MI_IO_PAGE_STATE</a><br>
   +0x22f0 PagingIo         : <a href="./_MI_PAGING_IO_STATE.html">_MI_PAGING_IO_STATE</a><br>
   +0x2340 CommonPages      : <a href="./_MI_COMMON_PAGE_STATE.html">_MI_COMMON_PAGE_STATE</a><br>
   +0x2400 Trims            : <a href="./_MI_SYSTEM_TRIM_STATE.html">_MI_SYSTEM_TRIM_STATE</a><br>
   +0x2440 Cookie           : Uint8B<br>
   +0x2448 BootRegistryRuns : Ptr64 Ptr64 Void<br>
   +0x2450 ZeroingDisabled  : Int4B<br>
   +0x2454 FullyInitialized : UChar<br>
   +0x2455 SafeBooted       : UChar<br>
   +0x2458 TraceLogging     : Ptr64 <a href="./_TlgProvider_t.html">_TlgProvider_t</a><br>
   +0x2480 Vs               : <a href="./_MI_VISIBLE_STATE.html">_MI_VISIBLE_STATE</a><br>
</font></body></html>