<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_AGGREGATED_PAYLOAD_FILTER</h2>
<font face="arial">   +0x000 MagicValue       : Pos 0, 12 Bits<br>
   +0x000 DescriptorVersion : Pos 12, 4 Bits<br>
   +0x002 Size             : Uint2B<br>
   +0x004 PredicateCount   : Uint2B<br>
   +0x006 Reserved         : Uint2B<br>
   +0x008 HashedEventIdBitmap : Uint8B<br>
   +0x010 ProviderGuid     : <a href="./_GUID.html">_GUID</a><br>
   +0x020 EachEventTableOffset : Uint2B<br>
   +0x022 EachEventTableLength : Uint2B<br>
   +0x024 PayloadDecoderTableOffset : Uint2B<br>
   +0x026 PayloadDecoderTableLength : Uint2B<br>
   +0x028 EventFilterTableOffset : Uint2B<br>
   +0x02a EventFilterTableLength : Uint2B<br>
   +0x02c UNICODEStringTableOffset : Uint2B<br>
   +0x02e UNICODEStringTableLength : Uint2B<br>
   +0x030 ANSIStringTableOffset : Uint2B<br>
   +0x032 ANSIStringTableLength : Uint2B<br>
   +0x038 PredicateTable   : [1] <a href="./_EVENT_PAYLOAD_PREDICATE.html">_EVENT_PAYLOAD_PREDICATE</a><br>
</font></body></html>