<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_EVENT_HEADER</h2>
<font face="arial">   +0x000 Size             : Uint2B<br>
   +0x002 HeaderType       : Uint2B<br>
   +0x004 Flags            : Uint2B<br>
   +0x006 EventProperty    : Uint2B<br>
   +0x008 ThreadId         : Uint4B<br>
   +0x00c ProcessId        : Uint4B<br>
   +0x010 TimeStamp        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 ProviderId       : <a href="./_GUID.html">_GUID</a><br>
   +0x028 EventDescriptor  : <a href="./_EVENT_DESCRIPTOR.html">_EVENT_DESCRIPTOR</a><br>
   +0x038 KernelTime       : Uint4B<br>
   +0x03c UserTime         : Uint4B<br>
   +0x038 ProcessorTime    : Uint8B<br>
   +0x040 ActivityId       : <a href="./_GUID.html">_GUID</a><br>
</font></body></html>