<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_HEAP</h2>
<font face="arial">   +0x000 Segment          : <a href="./_HEAP_SEGMENT.html">_HEAP_SEGMENT</a><br>
   +0x000 Entry            : <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x010 SegmentSignature : Uint4B<br>
   +0x014 SegmentFlags     : Uint4B<br>
   +0x018 SegmentListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 Heap             : Ptr64 <a href="./_HEAP.html">_HEAP</a><br>
   +0x030 BaseAddress      : Ptr64 Void<br>
   +0x038 NumberOfPages    : Uint4B<br>
   +0x040 FirstEntry       : Ptr64 <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x048 LastValidEntry   : Ptr64 <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x050 NumberOfUnCommittedPages : Uint4B<br>
   +0x054 NumberOfUnCommittedRanges : Uint4B<br>
   +0x058 SegmentAllocatorBackTraceIndex : Uint2B<br>
   +0x05a Reserved         : Uint2B<br>
   +0x060 UCRSegmentList   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x070 Flags            : Uint4B<br>
   +0x074 ForceFlags       : Uint4B<br>
   +0x078 CompatibilityFlags : Uint4B<br>
   +0x07c EncodeFlagMask   : Uint4B<br>
   +0x080 Encoding         : <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x090 Interceptor      : Uint4B<br>
   +0x094 VirtualMemoryThreshold : Uint4B<br>
   +0x098 Signature        : Uint4B<br>
   +0x0a0 SegmentReserve   : Uint8B<br>
   +0x0a8 SegmentCommit    : Uint8B<br>
   +0x0b0 DeCommitFreeBlockThreshold : Uint8B<br>
   +0x0b8 DeCommitTotalFreeThreshold : Uint8B<br>
   +0x0c0 TotalFreeSize    : Uint8B<br>
   +0x0c8 MaximumAllocationSize : Uint8B<br>
   +0x0d0 ProcessHeapsListIndex : Uint2B<br>
   +0x0d2 HeaderValidateLength : Uint2B<br>
   +0x0d8 HeaderValidateCopy : Ptr64 Void<br>
   +0x0e0 NextAvailableTagIndex : Uint2B<br>
   +0x0e2 MaximumTagIndex  : Uint2B<br>
   +0x0e8 TagEntries       : Ptr64 <a href="./_HEAP_TAG_ENTRY.html">_HEAP_TAG_ENTRY</a><br>
   +0x0f0 UCRList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x100 AlignRound       : Uint8B<br>
   +0x108 AlignMask        : Uint8B<br>
   +0x110 VirtualAllocdBlocks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x120 SegmentList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x130 AllocatorBackTraceIndex : Uint2B<br>
   +0x134 NonDedicatedListLength : Uint4B<br>
   +0x138 BlocksIndex      : Ptr64 Void<br>
   +0x140 UCRIndex         : Ptr64 Void<br>
   +0x148 PseudoTagEntries : Ptr64 <a href="./_HEAP_PSEUDO_TAG_ENTRY.html">_HEAP_PSEUDO_TAG_ENTRY</a><br>
   +0x150 FreeLists        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x160 LockVariable     : Ptr64 <a href="./_HEAP_LOCK.html">_HEAP_LOCK</a><br>
   +0x168 CommitRoutine    : Ptr64     long <br>
   +0x170 StackTraceInitVar : <a href="./_RTL_RUN_ONCE.html">_RTL_RUN_ONCE</a><br>
   +0x178 CommitLimitData  : <a href="./_RTL_HEAP_MEMORY_LIMIT_DATA.html">_RTL_HEAP_MEMORY_LIMIT_DATA</a><br>
   +0x198 FrontEndHeap     : Ptr64 Void<br>
   +0x1a0 FrontHeapLockCount : Uint2B<br>
   +0x1a2 FrontEndHeapType : UChar<br>
   +0x1a3 RequestedFrontEndHeapType : UChar<br>
   +0x1a8 FrontEndHeapUsageData : Ptr64 Wchar<br>
   +0x1b0 FrontEndHeapMaximumIndex : Uint2B<br>
   +0x1b2 FrontEndHeapStatusBitmap : [129] UChar<br>
   +0x238 Counters         : <a href="./_HEAP_COUNTERS.html">_HEAP_COUNTERS</a><br>
   +0x2b0 TuningParameters : <a href="./_HEAP_TUNING_PARAMETERS.html">_HEAP_TUNING_PARAMETERS</a><br>
</font></body></html>