<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_HEAP_SEGMENT</h2>
<font face="arial">   +0x000 Entry            : <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x010 SegmentSignature : Uint4B<br>
   +0x014 SegmentFlags     : Uint4B<br>
   +0x018 SegmentListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 Heap             : Ptr64 <a href="./_HEAP.html">_HEAP</a><br>
   +0x030 BaseAddress      : Ptr64 Void<br>
   +0x038 NumberOfPages    : Uint4B<br>
   +0x040 FirstEntry       : Ptr64 <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x048 LastValidEntry   : Ptr64 <a href="./_HEAP_ENTRY.html">_HEAP_ENTRY</a><br>
   +0x050 NumberOfUnCommittedPages : Uint4B<br>
   +0x054 NumberOfUnCommittedRanges : Uint4B<br>
   +0x058 SegmentAllocatorBackTraceIndex : Uint2B<br>
   +0x05a Reserved         : Uint2B<br>
   +0x060 UCRSegmentList   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
</font></body></html>