<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_INTERRUPT_VECTOR_DATA</h2>
<font face="arial">   +0x000 Type             : INTERRUPT_CONNECTION_TYPE<br>
   +0x004 Vector           : Uint4B<br>
   +0x008 Irql             : UChar<br>
   +0x00c Polarity         : <a href="./_KINTERRUPT_POLARITY.html">_KINTERRUPT_POLARITY</a><br>
   +0x010 Mode             : <a href="./_KINTERRUPT_MODE.html">_KINTERRUPT_MODE</a><br>
   +0x018 TargetProcessors : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x028 IntRemapInfo     : <a href="./_INTERRUPT_REMAPPING_INFO.html">_INTERRUPT_REMAPPING_INFO</a><br>
   +0x038 ControllerInput  : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x040 HvDeviceId       : Uint8B<br>
   +0x048 XapicMessage     : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x048 Hypertransport   : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x048 GenericMessage   : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x048 MessageRequest   : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>