<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_KAPC</h2>
<font face="arial">   +0x000 Type             : UChar<br>
   +0x001 SpareByte0       : UChar<br>
   +0x002 Size             : UChar<br>
   +0x003 SpareByte1       : UChar<br>
   +0x004 SpareLong0       : Uint4B<br>
   +0x008 Thread           : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x010 ApcListEntry     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 KernelRoutine    : Ptr64     void <br>
   +0x028 RundownRoutine   : Ptr64     void <br>
   +0x030 NormalRoutine    : Ptr64     void <br>
   +0x020 Reserved         : [3] Ptr64 Void<br>
   +0x038 NormalContext    : Ptr64 Void<br>
   +0x040 SystemArgument1  : Ptr64 Void<br>
   +0x048 SystemArgument2  : Ptr64 Void<br>
   +0x050 ApcStateIndex    : Char<br>
   +0x051 ApcMode          : Char<br>
   +0x052 Inserted         : UChar<br>
</font></body></html>