<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_MI_PARTITION_PAGE_LISTS</h2>
<font face="arial">   +0x000 FreePagesByColor : [2] Ptr64 <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x040 ZeroedPageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x080 FreePageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x0c0 StandbyPageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x100 StandbyPageListByPriority : [8] <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x240 ModifiedPageListNoReservation : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x280 ModifiedPageListByReservation : [16] <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x500 MappedPageListHead : [16] <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x780 BadPageListHead  : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x7c0 EnclavePageListHead : <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x7e8 FreePageSlist    : [2] Ptr64 <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x7f8 PageLocationList : [8] Ptr64 <a href="./_MMPFNLIST.html">_MMPFNLIST</a><br>
   +0x838 StandbyRepurposedByPriority : [8] Uint4B<br>
   +0x880 TransitionSharedPages : Uint8B<br>
   +0x888 TransitionSharedPagesPeak : [6] Uint8B<br>
   +0x8b8 MappedPageListHeadEvent : [16] <a href="./_KEVENT.html">_KEVENT</a><br>
   +0xa38 DecayClusterTimerHeads : [4] <a href="./_MI_DECAY_TIMER_LINK.html">_MI_DECAY_TIMER_LINK</a><br>
   +0xa58 DecayHand        : Uint4B<br>
   +0xa5c StandbyListDiscard : UChar<br>
   +0xa5d FreeListDiscard  : UChar<br>
   +0xa5e PfnBitMapsReady  : UChar<br>
   +0xa60 LastDecayHandUpdateTime : Uint8B<br>
   +0xa68 LastChanceLdwContext : <a href="./_MI_LDW_WORK_CONTEXT.html">_MI_LDW_WORK_CONTEXT</a><br>
   +0xac0 AvailableEventsLock : Uint8B<br>
   +0xac8 AvailablePageWaitStates : [3] <a href="./_MI_AVAILABLE_PAGE_WAIT_STATES.html">_MI_AVAILABLE_PAGE_WAIT_STATES</a><br>
   +0xb28 MirrorListLocks  : Ptr64 Void<br>
   +0xb40 TransitionPrivatePages : Uint8B<br>
   +0xb48 LargePfnBitMap   : [2] <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0xb68 LargePageListHeads : Ptr64 <a href="./_MI_FREE_LARGE_PAGE_LIST.html">_MI_FREE_LARGE_PAGE_LIST</a><br>
   +0xb70 LargePageCandidates : [2] <a href="./_MI_LARGE_PAGE_CANDIDATES.html">_MI_LARGE_PAGE_CANDIDATES</a><br>
   +0xf80 RebuildLargePageWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0xfa0 RebuildLargePageCandidates : UChar<br>
   +0xfa1 RebuildLargePageActive : UChar<br>
   +0xfa4 LargePageRebuildLock : Int4B<br>
   +0xfa8 LowMemoryThreshold : Uint8B<br>
   +0xfb0 HighMemoryThreshold : Uint8B<br>
   +0xfb8 SlabContexts     : [2] [4] <a href="./_MI_SLAB_ALLOCATOR_CONTEXT.html">_MI_SLAB_ALLOCATOR_CONTEXT</a><br>
   +0x1378 SlabPfnBitMap    : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x1388 HugePfnLists     : Ptr64 Void<br>
   +0x1390 AvailableHugeIoRanges : Uint8B<br>
</font></body></html>