<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_POP_FX_COMPONENT</h2>
<font face="arial">   +0x000 Id               : <a href="./_GUID.html">_GUID</a><br>
   +0x010 Index            : Uint4B<br>
   +0x018 WorkOrder        : <a href="./_POP_FX_WORK_ORDER.html">_POP_FX_WORK_ORDER</a><br>
   +0x050 Device           : Ptr64 <a href="./_POP_FX_DEVICE.html">_POP_FX_DEVICE</a><br>
   +0x058 Flags            : <a href="./_POP_FX_COMPONENT_FLAGS.html">_POP_FX_COMPONENT_FLAGS</a><br>
   +0x060 Resident         : Int4B<br>
   +0x068 ActiveEvent      : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x080 IdleLock         : Uint8B<br>
   +0x088 IdleConditionComplete : Int4B<br>
   +0x08c IdleStateComplete : Int4B<br>
   +0x090 IdleStamp        : Uint8B<br>
   +0x098 CurrentIdleState : Uint4B<br>
   +0x09c IdleStateCount   : Uint4B<br>
   +0x0a0 IdleStates       : Ptr64 <a href="./_POP_FX_IDLE_STATE.html">_POP_FX_IDLE_STATE</a><br>
   +0x0a8 DeepestWakeableIdleState : Uint4B<br>
   +0x0ac ProviderCount    : Uint4B<br>
   +0x0b0 Providers        : Ptr64 <a href="./_POP_FX_PROVIDER.html">_POP_FX_PROVIDER</a><br>
   +0x0b8 IdleProviderCount : Uint4B<br>
   +0x0bc DependentCount   : Uint4B<br>
   +0x0c0 Dependents       : Ptr64 <a href="./_POP_FX_DEPENDENT.html">_POP_FX_DEPENDENT</a><br>
   +0x0c8 Accounting       : <a href="./_POP_FX_ACCOUNTING.html">_POP_FX_ACCOUNTING</a><br>
   +0x1a8 Performance      : Ptr64 <a href="./_POP_FX_PERF_INFO.html">_POP_FX_PERF_INFO</a><br>
   +0x1b0 PowerProfile     : Ptr64 <a href="./_POP_COMPONENT_POWER_PROFILE.html">_POP_COMPONENT_POWER_PROFILE</a><br>
</font></body></html>