<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_PPM_SELECTION_STATISTICS</h2>
<font face="arial">   +0x000 SelectedCount    : Uint8B<br>
   +0x008 VetoCount        : Uint8B<br>
   +0x010 PreVetoCount     : Uint8B<br>
   +0x018 WrongProcessorCount : Uint8B<br>
   +0x020 LatencyCount     : Uint8B<br>
   +0x028 IdleDurationCount : Uint8B<br>
   +0x030 DeviceDependencyCount : Uint8B<br>
   +0x038 ProcessorDependencyCount : Uint8B<br>
   +0x040 PlatformOnlyCount : Uint8B<br>
   +0x048 InterruptibleCount : Uint8B<br>
   +0x050 LegacyOverrideCount : Uint8B<br>
   +0x058 CstateCheckCount : Uint8B<br>
   +0x060 NoCStateCount    : Uint8B<br>
   +0x068 CoordinatedDependencyCount : Uint8B<br>
   +0x070 NotClockOwnerCount : Uint8B<br>
   +0x078 PreVetoAccounting : Ptr64 <a href="./_PPM_VETO_ACCOUNTING.html">_PPM_VETO_ACCOUNTING</a><br>
</font></body></html>