<html><body>
<h4>Windows 10 x64 (18363.720)</h4><br>
<h2>_WAIT_CONTEXT_BLOCK</h2>
<font face="arial">   +0x000 WaitQueueEntry   : <a href="./_KDEVICE_QUEUE_ENTRY.html">_KDEVICE_QUEUE_ENTRY</a><br>
   +0x000 DmaWaitEntry     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 NumberOfChannels : Uint4B<br>
   +0x014 SyncCallback     : Pos 0, 1 Bit<br>
   +0x014 DmaContext       : Pos 1, 1 Bit<br>
   +0x014 ZeroMapRegisters : Pos 2, 1 Bit<br>
   +0x014 Reserved         : Pos 3, 9 Bits<br>
   +0x014 NumberOfRemapPages : Pos 12, 20 Bits<br>
   +0x018 DeviceRoutine    : Ptr64     _<a href="./_IO_ALLOCATION_ACTION.html">_IO_ALLOCATION_ACTION</a><br>
   +0x020 DeviceContext    : Ptr64 Void<br>
   +0x028 NumberOfMapRegisters : Uint4B<br>
   +0x030 DeviceObject     : Ptr64 Void<br>
   +0x038 CurrentIrp       : Ptr64 Void<br>
   +0x040 BufferChainingDpc : Ptr64 <a href="./_KDPC.html">_KDPC</a><br>
</font></body></html>