<html><body>
<h4>Windows 10 1903 x64 (18362.53)</h4><br>
<h2>_DEVOBJ_EXTENSION</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Uint2B<br>
   +0x008 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x010 PowerFlags       : Uint4B<br>
   +0x018 Dope             : Ptr64 <a href="./_DEVICE_OBJECT_POWER_EXTENSION.html">_DEVICE_OBJECT_POWER_EXTENSION</a><br>
   +0x020 ExtensionFlags   : Uint4B<br>
   +0x028 DeviceNode       : Ptr64 Void<br>
   +0x030 AttachedTo       : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x038 StartIoCount     : Int4B<br>
   +0x03c StartIoKey       : Int4B<br>
   +0x040 StartIoFlags     : Uint4B<br>
   +0x048 Vpb              : Ptr64 <a href="./_VPB.html">_VPB</a><br>
   +0x050 DependencyNode   : Ptr64 Void<br>
   +0x058 InterruptContext : Ptr64 Void<br>
   +0x060 VerifierContext  : Ptr64 Void<br>
</font></body></html>