<html><body>
<h4>Windows 10 1903 x64 (18362.53)</h4><br>
<h2>_HBASE_BLOCK</h2>
<font face="arial">   +0x000 Signature        : Uint4B<br>
   +0x004 Sequence1        : Uint4B<br>
   +0x008 Sequence2        : Uint4B<br>
   +0x00c TimeStamp        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x014 Major            : Uint4B<br>
   +0x018 Minor            : Uint4B<br>
   +0x01c Type             : Uint4B<br>
   +0x020 Format           : Uint4B<br>
   +0x024 RootCell         : Uint4B<br>
   +0x028 Length           : Uint4B<br>
   +0x02c Cluster          : Uint4B<br>
   +0x030 FileName         : [64] UChar<br>
   +0x070 RmId             : <a href="./_GUID.html">_GUID</a><br>
   +0x080 LogId            : <a href="./_GUID.html">_GUID</a><br>
   +0x090 Flags            : Uint4B<br>
   +0x094 TmId             : <a href="./_GUID.html">_GUID</a><br>
   +0x0a4 GuidSignature    : Uint4B<br>
   +0x0a8 LastReorganizeTime : Uint8B<br>
   +0x0b0 Reserved1        : [83] Uint4B<br>
   +0x1fc CheckSum         : Uint4B<br>
   +0x200 Reserved2        : [882] Uint4B<br>
   +0xfc8 ThawTmId         : <a href="./_GUID.html">_GUID</a><br>
   +0xfd8 ThawRmId         : <a href="./_GUID.html">_GUID</a><br>
   +0xfe8 ThawLogId        : <a href="./_GUID.html">_GUID</a><br>
   +0xff8 BootType         : Uint4B<br>
   +0xffc BootRecover      : Uint4B<br>
</font></body></html>