<html><body>
<h4>Windows 10 1903 x64 (18362.53)</h4><br>
<h2>_IMAGE_ROM_OPTIONAL_HEADER</h2>
<font face="arial">   +0x000 Magic            : Uint2B<br>
   +0x002 MajorLinkerVersion : UChar<br>
   +0x003 MinorLinkerVersion : UChar<br>
   +0x004 SizeOfCode       : Uint4B<br>
   +0x008 SizeOfInitializedData : Uint4B<br>
   +0x00c SizeOfUninitializedData : Uint4B<br>
   +0x010 AddressOfEntryPoint : Uint4B<br>
   +0x014 BaseOfCode       : Uint4B<br>
   +0x018 BaseOfData       : Uint4B<br>
   +0x01c BaseOfBss        : Uint4B<br>
   +0x020 GprMask          : Uint4B<br>
   +0x024 CprMask          : [4] Uint4B<br>
   +0x034 GpValue          : Uint4B<br>
</font></body></html>