<html><body>
<h4>Windows 10 1903 x64 (18362.53)</h4><br>
<h2>_MI_COMMON_PAGE_STATE</h2>
<font face="arial">   +0x000 PageOfOnesPfn    : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x008 PageOfOnes       : Uint8B<br>
   +0x010 DummyPagePfn     : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x018 DummyPage        : Uint8B<br>
   +0x020 PageOfZeroes     : Uint8B<br>
   +0x028 ZeroMapping      : Ptr64 Void<br>
   +0x030 OnesMapping      : Ptr64 Void<br>
   +0x038 ZeroCrc          : Uint8B<br>
   +0x040 OnesCrc          : Uint8B<br>
   +0x048 BitmapGapFrames  : [4] Uint8B<br>
   +0x068 PfnGapFrames     : [4] Uint8B<br>
   +0x088 PageTableOfZeroes : Uint8B<br>
   +0x090 PdeOfZeroes      : <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x098 PageTableOfOnes  : Uint8B<br>
   +0x0a0 PdeOfOnes        : <a href="./_MMPTE.html">_MMPTE</a><br>
</font></body></html>