<html><body>
<h4>Windows 10 1903 x64 (18362.53)</h4><br>
<h2>_MI_PARTITION_SEGMENTS</h2>
<font face="arial">   +0x000 SegmentListLock  : Int4B<br>
   +0x004 DeleteOnCloseCount : Uint4B<br>
   +0x008 FsControlAreaCount : Int8B<br>
   +0x010 PfControlAreaCount : Int8B<br>
   +0x018 CloneHeaderCount : Int8B<br>
   +0x020 DeleteSubsectionCleanup : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x038 UnusedSegmentCleanup : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x050 SubsectionDeletePtes : Uint8B<br>
   +0x058 AttemptForCantExtend : <a href="./_MMPAGE_FILE_EXPANSION.html">_MMPAGE_FILE_EXPANSION</a><br>
   +0x0b0 DereferenceSegmentHeader : <a href="./_MMDEREFERENCE_SEGMENT_HEADER.html">_MMDEREFERENCE_SEGMENT_HEADER</a><br>
   +0x100 DeleteOnCloseList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x110 DeleteOnCloseTimer : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x150 DeleteOnCloseTimerActive : UChar<br>
   +0x151 SegmentDereferenceThreadExists : UChar<br>
   +0x158 SegmentDereferenceActiveControlArea : Ptr64 Void<br>
   +0x160 UnusedSegmentPagedPool : Uint8B<br>
   +0x168 UnusedSegmentList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x178 UnusedSubsectionList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x188 DeleteSubsectionList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x198 ControlAreaDeleteEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x1b0 ControlAreaDeleteList : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x1b8 FreeSystemCache  : <a href="./_MI_PTE_CHAIN_HEAD.html">_MI_PTE_CHAIN_HEAD</a><br>
   +0x1d0 CloneDereferenceEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x1f0 CloneProtosSListHead : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x200 SystemCacheInitLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x208 PagefileExtensionWaiters : Uint4B<br>
   +0x20c PagefileExtensionRequests : Uint4B<br>
   +0x210 PagefileExtensionWaitEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x228 SharedCharges    : [7] <a href="./_MI_CROSS_PARTITION_CHARGES.html">_MI_CROSS_PARTITION_CHARGES</a><br>
   +0x308 SharedChargesDrainEvent : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x310 ControlAreasDrainEvent : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x318 CloneHeaderDrainEvent : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x320 ProbeRundownReference : Ptr64 <a href="./_EX_RUNDOWN_REF_CACHE_AWARE.html">_EX_RUNDOWN_REF_CACHE_AWARE</a><br>
</font></body></html>