<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_CONTROL_AREA</h2>
<font face="arial">   +0x000 Segment          : Ptr64 <a href="./_SEGMENT.html">_SEGMENT</a><br>
   +0x008 ListHead         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x008 AweContext       : Ptr64 Void<br>
   +0x018 NumberOfSectionReferences : Uint8B<br>
   +0x020 NumberOfPfnReferences : Uint8B<br>
   +0x028 NumberOfMappedViews : Uint8B<br>
   +0x030 NumberOfUserReferences : Uint8B<br>
   +0x038 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x03c u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x040 FilePointer      : <a href="./_EX_FAST_REF.html">_EX_FAST_REF</a><br>
   +0x048 ControlAreaLock  : Int4B<br>
   +0x04c ModifiedWriteCount : Uint4B<br>
   +0x050 WaitList         : Ptr64 <a href="./_MI_CONTROL_AREA_WAIT_BLOCK.html">_MI_CONTROL_AREA_WAIT_BLOCK</a><br>
   +0x058 u2               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x068 FileObjectLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x070 LockedPages      : Uint8B<br>
   +0x078 u3               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>