<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_HALP_DMA_CHANNEL</h2>
<font face="arial">   +0x000 ChannelNumber    : Uint4B<br>
   +0x004 Initialized      : UChar<br>
   +0x005 Busy             : UChar<br>
   +0x006 Complete         : UChar<br>
   +0x008 CurrentCompletionRoutine : Ptr64     void <br>
   +0x010 CurrentCompletionContext : Ptr64 Void<br>
   +0x018 CurrentChildAdapter : Ptr64 <a href="./_ADAPTER_OBJECT.html">_ADAPTER_OBJECT</a><br>
   +0x020 CurrentInterruptType : <a href="./_DMA_INTERRUPT_TYPE.html">_DMA_INTERRUPT_TYPE</a><br>
   +0x028 Dpc              : <a href="./_KDPC.html">_KDPC</a><br>
   +0x068 GeneratesInterrupt : UChar<br>
   +0x06c Gsi              : Int4B<br>
   +0x070 InterruptPolarity : <a href="./_KINTERRUPT_POLARITY.html">_KINTERRUPT_POLARITY</a><br>
   +0x074 InterruptMode    : <a href="./_KINTERRUPT_MODE.html">_KINTERRUPT_MODE</a><br>
   +0x078 CommonBufferLength : Uint4B<br>
   +0x080 CommonBufferVirtualAddress : Ptr64 Void<br>
   +0x088 CommonBufferLogicalAddress : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x090 AdapterQueue     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
</font></body></html>