<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_HALP_DMA_DOMAIN_OBJECT</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 MaximumPhysicalAddress : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 BoundaryAddressMultiple : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x020 CacheCoherent    : UChar<br>
   +0x021 FirmwareReserved : UChar<br>
   +0x028 IommuDomainPointer : Ptr64 Void<br>
   +0x030 LaState          : Ptr64 Void<br>
   +0x038 LaStateLock      : Uint8B<br>
   +0x040 TranslationType  : <a href="./_EXT_IOMMU_TRANSLATION_TYPE.html">_EXT_IOMMU_TRANSLATION_TYPE</a><br>
   +0x048 OwningAdapter    : Ptr64 <a href="./_ADAPTER_OBJECT.html">_ADAPTER_OBJECT</a><br>
   +0x050 CommonBufferRoot : <a href="./_RTL_RB_TREE.html">_RTL_RB_TREE</a><br>
   +0x060 CommonBufferTreeLock : Uint8B<br>
   +0x068 VectorCommonBufferListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x078 VectorCommonBufferLock : Uint8B<br>
   +0x080 DomainRefCount   : Uint4B<br>
</font></body></html>