<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_KTIMER2</h2>
<font face="arial">   +0x000 Header           : <a href="./_DISPATCHER_HEADER.html">_DISPATCHER_HEADER</a><br>
   +0x018 RbNodes          : [2] <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x018 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 DueTime          : [2] Uint8B<br>
   +0x058 Period           : Int8B<br>
   +0x060 Callback         : Ptr64     void <br>
   +0x068 CallbackContext  : Ptr64 Void<br>
   +0x070 DisableCallback  : Ptr64     void <br>
   +0x078 DisableContext   : Ptr64 Void<br>
   +0x080 AbsoluteSystemTime : UChar<br>
   +0x081 TypeFlags        : UChar<br>
   +0x081 Unused           : Pos 0, 1 Bit<br>
   +0x081 IdleResilient    : Pos 1, 1 Bit<br>
   +0x081 HighResolution   : Pos 2, 1 Bit<br>
   +0x081 NoWake           : Pos 3, 1 Bit<br>
   +0x081 PseudoHighRes    : Pos 4, 1 Bit<br>
   +0x081 Unused1          : Pos 5, 3 Bits<br>
   +0x082 CollectionIndex  : [2] UChar<br>
</font></body></html>