<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_KUMS_CONTEXT_HEADER</h2>
<font face="arial">   +0x000 P1Home           : Uint8B<br>
   +0x008 P2Home           : Uint8B<br>
   +0x010 P3Home           : Uint8B<br>
   +0x018 P4Home           : Uint8B<br>
   +0x020 StackTop         : Ptr64 Void<br>
   +0x028 StackSize        : Uint8B<br>
   +0x030 RspOffset        : Uint8B<br>
   +0x038 Rip              : Uint8B<br>
   +0x040 FltSave          : Ptr64 <a href="./_XSAVE_FORMAT.html">_XSAVE_FORMAT</a><br>
   +0x048 Volatile         : Pos 0, 1 Bit<br>
   +0x048 Reserved         : Pos 1, 63 Bits<br>
   +0x048 Flags            : Uint8B<br>
   +0x050 TrapFrame        : Ptr64 <a href="./_KTRAP_FRAME.html">_KTRAP_FRAME</a><br>
   +0x058 ExceptionFrame   : Ptr64 <a href="./_KEXCEPTION_FRAME.html">_KEXCEPTION_FRAME</a><br>
   +0x060 SourceThread     : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x068 Return           : Uint8B<br>
</font></body></html>