<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_MI_PAGING_IO_STATE</h2>
<font face="arial">   +0x000 PageFileHead     : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x008 PageFileHeadSpinLock : Int4B<br>
   +0x00c PrefetchSeekThreshold : Int4B<br>
   +0x010 InPageSinglePages : Uint4B<br>
   +0x020 InPageSupportSListHead : [2] <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x040 ReservedInPageSupportSListHead : [2] <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x060 InPageSupportSListMinimum : [2] UChar<br>
   +0x068 FirstReservedInPageBlock : [2] Ptr64 <a href="./_MMINPAGE_SUPPORT.html">_MMINPAGE_SUPPORT</a><br>
   +0x078 LastReservedInPageBlock : [2] Ptr64 <a href="./_MMINPAGE_SUPPORT.html">_MMINPAGE_SUPPORT</a><br>
   +0x088 ReservedPtes     : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x090 ReservedPtesLock : Uint8B<br>
   +0x098 ReservedPtesBitBuffer : Uint4B<br>
   +0x09c DelayPageFaults  : Int4B<br>
   +0x0a0 FileCompressionBoundary : Uint4B<br>
   +0x0a4 MdlsAdjusted     : UChar<br>
</font></body></html>