<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_MMSUPPORT_FLAGS</h2>
<font face="arial">   +0x000 WorkingSetType   : Pos 0, 3 Bits<br>
   +0x000 Reserved0        : Pos 3, 3 Bits<br>
   +0x000 MaximumWorkingSetHard : Pos 6, 1 Bit<br>
   +0x000 MinimumWorkingSetHard : Pos 7, 1 Bit<br>
   +0x001 SessionMaster    : Pos 0, 1 Bit<br>
   +0x001 TrimmerState     : Pos 1, 2 Bits<br>
   +0x001 Reserved         : Pos 3, 1 Bit<br>
   +0x001 PageStealers     : Pos 4, 4 Bits<br>
   +0x000 u1               : Uint2B<br>
   +0x002 MemoryPriority   : UChar<br>
   +0x003 WsleDeleted      : Pos 0, 1 Bit<br>
   +0x003 SvmEnabled       : Pos 1, 1 Bit<br>
   +0x003 ForceAge         : Pos 2, 1 Bit<br>
   +0x003 ForceTrim        : Pos 3, 1 Bit<br>
   +0x003 NewMaximum       : Pos 4, 1 Bit<br>
   +0x003 CommitReleaseState : Pos 5, 2 Bits<br>
   +0x003 u2               : UChar<br>
</font></body></html>