<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_RTL_UMS_CONTEXT</h2>
<font face="arial">   +0x000 Link             : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x010 Context          : <a href="./_CONTEXT.html">_CONTEXT</a><br>
   +0x4e0 Teb              : Ptr64 Void<br>
   +0x4e8 UserContext      : Ptr64 Void<br>
   +0x4f0 ScheduledThread  : Pos 0, 1 Bit<br>
   +0x4f0 Suspended        : Pos 1, 1 Bit<br>
   +0x4f0 VolatileContext  : Pos 2, 1 Bit<br>
   +0x4f0 Terminated       : Pos 3, 1 Bit<br>
   +0x4f0 DebugActive      : Pos 4, 1 Bit<br>
   +0x4f0 RunningOnSelfThread : Pos 5, 1 Bit<br>
   +0x4f0 DenyRunningOnSelfThread : Pos 6, 1 Bit<br>
   +0x4f0 Flags            : Int4B<br>
   +0x4f8 KernelUpdateLock : Pos 0, 2 Bits<br>
   +0x4f8 PrimaryClientID  : Pos 2, 62 Bits<br>
   +0x4f8 ContextLock      : Uint8B<br>
   +0x500 PrimaryUmsContext : Ptr64 <a href="./_RTL_UMS_CONTEXT.html">_RTL_UMS_CONTEXT</a><br>
   +0x508 SwitchCount      : Uint4B<br>
   +0x50c KernelYieldCount : Uint4B<br>
   +0x510 MixedYieldCount  : Uint4B<br>
   +0x514 YieldCount       : Uint4B<br>
</font></body></html>