<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_SUBSECTION</h2>
<font face="arial">   +0x000 ControlArea      : Ptr64 <a href="./_CONTROL_AREA.html">_CONTROL_AREA</a><br>
   +0x008 SubsectionBase   : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x010 NextSubsection   : Ptr64 <a href="./_SUBSECTION.html">_SUBSECTION</a><br>
   +0x018 GlobalPerSessionHead : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x018 CreationWaitList : Ptr64 <a href="./_MI_CONTROL_AREA_WAIT_BLOCK.html">_MI_CONTROL_AREA_WAIT_BLOCK</a><br>
   +0x018 SessionDriverProtos : Ptr64 <a href="./_MI_PER_SESSION_PROTOS.html">_MI_PER_SESSION_PROTOS</a><br>
   +0x020 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x024 StartingSector   : Uint4B<br>
   +0x028 NumberOfFullSectors : Uint4B<br>
   +0x02c PtesInSubsection : Uint4B<br>
   +0x030 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x034 UnusedPtes       : Pos 0, 30 Bits<br>
   +0x034 ExtentQueryNeeded : Pos 30, 1 Bit<br>
   +0x034 DirtyPages       : Pos 31, 1 Bit<br>
</font></body></html>