<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>_TOKEN_ACCESS_INFORMATION</h2>
<font face="arial">   +0x000 SidHash          : Ptr64 <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x008 RestrictedSidHash : Ptr64 <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x010 Privileges       : Ptr64 <a href="./_TOKEN_PRIVILEGES.html">_TOKEN_PRIVILEGES</a><br>
   +0x018 AuthenticationId : <a href="./_LUID.html">_LUID</a><br>
   +0x020 TokenType        : <a href="./_TOKEN_TYPE.html">_TOKEN_TYPE</a><br>
   +0x024 ImpersonationLevel : <a href="./_SECURITY_IMPERSONATION_LEVEL.html">_SECURITY_IMPERSONATION_LEVEL</a><br>
   +0x028 MandatoryPolicy  : <a href="./_TOKEN_MANDATORY_POLICY.html">_TOKEN_MANDATORY_POLICY</a><br>
   +0x02c Flags            : Uint4B<br>
   +0x030 AppContainerNumber : Uint4B<br>
   +0x038 PackageSid       : Ptr64 Void<br>
   +0x040 CapabilitiesHash : Ptr64 <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x048 TrustLevelSid    : Ptr64 Void<br>
   +0x050 SecurityAttributes : Ptr64 Void<br>
</font></body></html>