<html><body>
<h4>Windows 10 x64 (19041.508)</h4><br>
<h2>SYSTEM_POWER_CAPABILITIES</h2>
<font face="arial">   +0x000 PowerButtonPresent : UChar<br>
   +0x001 SleepButtonPresent : UChar<br>
   +0x002 LidPresent       : UChar<br>
   +0x003 SystemS1         : UChar<br>
   +0x004 SystemS2         : UChar<br>
   +0x005 SystemS3         : UChar<br>
   +0x006 SystemS4         : UChar<br>
   +0x007 SystemS5         : UChar<br>
   +0x008 HiberFilePresent : UChar<br>
   +0x009 FullWake         : UChar<br>
   +0x00a VideoDimPresent  : UChar<br>
   +0x00b ApmPresent       : UChar<br>
   +0x00c UpsPresent       : UChar<br>
   +0x00d ThermalControl   : UChar<br>
   +0x00e ProcessorThrottle : UChar<br>
   +0x00f ProcessorMinThrottle : UChar<br>
   +0x010 ProcessorMaxThrottle : UChar<br>
   +0x011 FastSystemS4     : UChar<br>
   +0x012 Hiberboot        : UChar<br>
   +0x013 WakeAlarmPresent : UChar<br>
   +0x014 AoAc             : UChar<br>
   +0x015 DiskSpinDown     : UChar<br>
   +0x016 HiberFileType    : UChar<br>
   +0x017 AoAcConnectivitySupported : UChar<br>
   +0x018 spare3           : [6] UChar<br>
   +0x01e SystemBatteriesPresent : UChar<br>
   +0x01f BatteriesAreShortTerm : UChar<br>
   +0x020 BatteryScale     : [3] <a href="./BATTERY_REPORTING_SCALE.html">BATTERY_REPORTING_SCALE</a><br>
   +0x038 AcOnLineWake     : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x03c SoftLidWake      : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x040 RtcWake          : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x044 MinDeviceWakeState : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x048 DefaultLowLatencyWake : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
</font></body></html>