<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_ALPC_COMPLETION_LIST_HEADER</h2>
<font face="arial">   +0x000 StartMagic       : Uint8B<br>
   +0x008 TotalSize        : Uint4B<br>
   +0x00c ListOffset       : Uint4B<br>
   +0x010 ListSize         : Uint4B<br>
   +0x014 BitmapOffset     : Uint4B<br>
   +0x018 BitmapSize       : Uint4B<br>
   +0x01c DataOffset       : Uint4B<br>
   +0x020 DataSize         : Uint4B<br>
   +0x024 AttributeFlags   : Uint4B<br>
   +0x028 AttributeSize    : Uint4B<br>
   +0x040 State            : <a href="./_ALPC_COMPLETION_LIST_STATE.html">_ALPC_COMPLETION_LIST_STATE</a><br>
   +0x048 LastMessageId    : Uint4B<br>
   +0x04c LastCallbackId   : Uint4B<br>
   +0x080 PostCount        : Uint4B<br>
   +0x0c0 ReturnCount      : Uint4B<br>
   +0x100 LogSequenceNumber : Uint4B<br>
   +0x140 UserLock         : <a href="./_RTL_SRWLOCK.html">_RTL_SRWLOCK</a><br>
   +0x148 EndMagic         : Uint8B<br>
</font></body></html>