<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_KENLISTMENT</h2>
<font face="arial">   +0x000 cookie           : Uint4B<br>
   +0x008 NamespaceLink    : <a href="./_KTMOBJECT_NAMESPACE_LINK.html">_KTMOBJECT_NAMESPACE_LINK</a><br>
   +0x030 EnlistmentId     : <a href="./_GUID.html">_GUID</a><br>
   +0x040 Mutex            : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x078 NextSameTx       : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x088 NextSameRm       : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x098 ResourceManager  : Ptr64 <a href="./_KRESOURCEMANAGER.html">_KRESOURCEMANAGER</a><br>
   +0x0a0 Transaction      : Ptr64 <a href="./_KTRANSACTION.html">_KTRANSACTION</a><br>
   +0x0a8 State            : <a href="./_KENLISTMENT_STATE.html">_KENLISTMENT_STATE</a><br>
   +0x0ac Flags            : Uint4B<br>
   +0x0b0 NotificationMask : Uint4B<br>
   +0x0b8 Key              : Ptr64 Void<br>
   +0x0c0 KeyRefCount      : Uint4B<br>
   +0x0c8 RecoveryInformation : Ptr64 Void<br>
   +0x0d0 RecoveryInformationLength : Uint4B<br>
   +0x0d8 DynamicNameInformation : Ptr64 Void<br>
   +0x0e0 DynamicNameInformationLength : Uint4B<br>
   +0x0e8 FinalNotification : Ptr64 <a href="./_KTMNOTIFICATION_PACKET.html">_KTMNOTIFICATION_PACKET</a><br>
   +0x0f0 SupSubEnlistment : Ptr64 <a href="./_KENLISTMENT.html">_KENLISTMENT</a><br>
   +0x0f8 SupSubEnlHandle  : Ptr64 Void<br>
   +0x100 SubordinateTxHandle : Ptr64 Void<br>
   +0x108 CrmEnlistmentEnId : <a href="./_GUID.html">_GUID</a><br>
   +0x118 CrmEnlistmentTmId : <a href="./_GUID.html">_GUID</a><br>
   +0x128 CrmEnlistmentRmId : <a href="./_GUID.html">_GUID</a><br>
   +0x138 NextHistory      : Uint4B<br>
   +0x13c History          : [20] <a href="./_KENLISTMENT_HISTORY.html">_KENLISTMENT_HISTORY</a><br>
</font></body></html>