<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_MI_SESSION_STATE</h2>
<font face="arial">   +0x000 SystemSession    : <a href="./_MMSESSION.html">_MMSESSION</a><br>
   +0x020 CodePageEdited   : UChar<br>
   +0x028 DynamicVaBitBuffer : Ptr64 Uint8B<br>
   +0x030 DynamicVaBitBufferPages : Uint8B<br>
   +0x038 DynamicVaStart   : Ptr64 Void<br>
   +0x040 ImageVaStart     : Ptr64 Void<br>
   +0x048 SystemViewBuckets : [256] <a href="./_MI_HUGE_SYSTEM_VIEW_HEAD.html">_MI_HUGE_SYSTEM_VIEW_HEAD</a><br>
   +0x1048 DynamicPtesBitBuffer : Ptr64 Uint4B<br>
   +0x1050 IdLock           : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x1058 LeaderProcess    : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x1060 InitializeLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x1068 WorkingSetList   : Ptr64 <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x1070 SessionBase      : Ptr64 Void<br>
   +0x1078 SessionCore      : Ptr64 Void<br>
   +0x1080 SessionIdNodes   : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
</font></body></html>