<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_POP_DEVICE_SYS_STATE</h2>
<font face="arial">   +0x000 IrpMinor         : UChar<br>
   +0x004 SystemState      : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x008 SpinLock         : Uint8B<br>
   +0x010 Thread           : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x018 AbortEvent       : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x020 ReadySemaphore   : Ptr64 <a href="./_KSEMAPHORE.html">_KSEMAPHORE</a><br>
   +0x028 FinishedSemaphore : Ptr64 <a href="./_KSEMAPHORE.html">_KSEMAPHORE</a><br>
   +0x030 Order            : <a href="./_PO_DEVICE_NOTIFY_ORDER.html">_PO_DEVICE_NOTIFY_ORDER</a><br>
   +0x1b0 Pending          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x1c0 Status           : Int4B<br>
   +0x1c8 FailedDevice     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x1d0 Waking           : UChar<br>
   +0x1d1 Cancelled        : UChar<br>
   +0x1d2 IgnoreErrors     : UChar<br>
   +0x1d3 IgnoreNotImplemented : UChar<br>
   +0x1d4 TimeRefreshLockAcquired : UChar<br>
</font></body></html>