<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_PROCESSOR_POWER_STATE</h2>
<font face="arial">   +0x000 IdleStates       : Ptr64 <a href="./_PPM_IDLE_STATES.html">_PPM_IDLE_STATES</a><br>
   +0x008 IdleAccounting   : Ptr64 <a href="./_PROC_IDLE_ACCOUNTING.html">_PROC_IDLE_ACCOUNTING</a><br>
   +0x010 IdleTimeLast     : Uint8B<br>
   +0x018 IdleTimeTotal    : Uint8B<br>
   +0x020 IdleTimeEntry    : Uint8B<br>
   +0x028 IdleTimeExpiration : Uint8B<br>
   +0x030 NonInterruptibleTransition : UChar<br>
   +0x031 PepWokenTransition : UChar<br>
   +0x032 HvTargetState    : UChar<br>
   +0x033 SoftParked       : UChar<br>
   +0x034 TargetIdleState  : Uint4B<br>
   +0x038 IdlePolicy       : <a href="./_PROC_IDLE_POLICY.html">_PROC_IDLE_POLICY</a><br>
   +0x040 Synchronization  : <a href="./_PPM_IDLE_SYNCHRONIZATION_STATE.html">_PPM_IDLE_SYNCHRONIZATION_STATE</a><br>
   +0x048 PerfFeedback     : <a href="./_PROC_FEEDBACK.html">_PROC_FEEDBACK</a><br>
   +0x0d8 Hypervisor       : <a href="./_PROC_HYPERVISOR_STATE.html">_PROC_HYPERVISOR_STATE</a><br>
   +0x0dc LastSysTime      : Uint4B<br>
   +0x0e0 WmiDispatchPtr   : Uint8B<br>
   +0x0e8 WmiInterfaceEnabled : Int4B<br>
   +0x0f0 FFHThrottleStateInfo : <a href="./_PPM_FFH_THROTTLE_STATE_INFO.html">_PPM_FFH_THROTTLE_STATE_INFO</a><br>
   +0x110 PerfActionDpc    : <a href="./_KDPC.html">_KDPC</a><br>
   +0x150 PerfActionMask   : Int4B<br>
   +0x158 HvIdleCheck      : <a href="./_PROC_IDLE_SNAP.html">_PROC_IDLE_SNAP</a><br>
   +0x168 PerfCheck        : Ptr64 <a href="./_PROC_PERF_CHECK.html">_PROC_PERF_CHECK</a><br>
   +0x170 Domain           : Ptr64 <a href="./_PROC_PERF_DOMAIN.html">_PROC_PERF_DOMAIN</a><br>
   +0x178 PerfConstraint   : Ptr64 <a href="./_PROC_PERF_CONSTRAINT.html">_PROC_PERF_CONSTRAINT</a><br>
   +0x180 Concurrency      : Ptr64 <a href="./_PPM_CONCURRENCY_ACCOUNTING.html">_PPM_CONCURRENCY_ACCOUNTING</a><br>
   +0x188 ClassConcurrency : Ptr64 <a href="./_PPM_CONCURRENCY_ACCOUNTING.html">_PPM_CONCURRENCY_ACCOUNTING</a><br>
   +0x190 Load             : Ptr64 <a href="./_PROC_PERF_LOAD.html">_PROC_PERF_LOAD</a><br>
   +0x198 PerfHistory      : Ptr64 <a href="./_PROC_PERF_HISTORY.html">_PROC_PERF_HISTORY</a><br>
   +0x1a0 ArchitecturalEfficiencyClass : UChar<br>
   +0x1a1 PerformanceSchedulingClass : UChar<br>
   +0x1a2 EfficiencySchedulingClass : UChar<br>
   +0x1a3 GuaranteedPerformancePercent : UChar<br>
   +0x1a4 Parked           : UChar<br>
   +0x1a5 LongPriorQosPeriod : UChar<br>
   +0x1a6 LatestAffinitizedPercent : Uint2B<br>
   +0x1a8 LatestPerformancePercent : Uint4B<br>
   +0x1ac AveragePerformancePercent : Uint4B<br>
   +0x1b0 RelativePerformance : Uint4B<br>
   +0x1b4 Utility          : Uint4B<br>
   +0x1b8 AffinitizedUtility : Uint4B<br>
   +0x1c0 SnapTimeLast     : Uint8B<br>
   +0x1c0 EnergyConsumed   : Uint8B<br>
   +0x1c8 ActiveTime       : Uint8B<br>
   +0x1d0 TotalTime        : Uint8B<br>
   +0x1d8 FxDevice         : Ptr64 <a href="./_POP_FX_DEVICE.html">_POP_FX_DEVICE</a><br>
   +0x1e0 LastQosTranstionTsc : Uint8B<br>
   +0x1e8 QosTransitionHysteresis : Uint8B<br>
   +0x1f0 RequestedQosClass : <a href="./_KHETERO_CPU_QOS.html">_KHETERO_CPU_QOS</a><br>
   +0x1f4 ResolvedQosClass : <a href="./_KHETERO_CPU_QOS.html">_KHETERO_CPU_QOS</a><br>
   +0x1f8 QosEquivalencyMask : Uint2B<br>
   +0x1fa HwFeedbackTableIndex : Uint2B<br>
   +0x1fc HwFeedbackParkHint : UChar<br>
   +0x1fd HwFeedbackPerformanceClass : UChar<br>
   +0x1fe HwFeedbackEfficiencyClass : UChar<br>
   +0x1ff HeteroCoreType   : UChar<br>
</font></body></html>