<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_VF_TARGET_VERIFIED_DRIVER_DATA</h2>
<font face="arial">   +0x000 SuspectDriverEntry : Ptr64 <a href="./_VF_SUSPECT_DRIVER_ENTRY.html">_VF_SUSPECT_DRIVER_ENTRY</a><br>
   +0x008 WMICallback      : Ptr64 Void<br>
   +0x010 EtwHandlesListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x028 Signature        : Uint8B<br>
   +0x030 SeSigningLevel   : UChar<br>
   +0x040 PoolPageHeaders  : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x050 PoolTrackers     : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x060 CurrentPagedPoolAllocations : Uint4B<br>
   +0x064 CurrentNonPagedPoolAllocations : Uint4B<br>
   +0x068 PeakPagedPoolAllocations : Uint4B<br>
   +0x06c PeakNonPagedPoolAllocations : Uint4B<br>
   +0x070 PagedBytes       : Uint8B<br>
   +0x078 NonPagedBytes    : Uint8B<br>
   +0x080 PeakPagedBytes   : Uint8B<br>
   +0x088 PeakNonPagedBytes : Uint8B<br>
   +0x090 RaiseIrqls       : Uint4B<br>
   +0x094 AcquireSpinLocks : Uint4B<br>
   +0x098 SynchronizeExecutions : Uint4B<br>
   +0x09c AllocationsWithNoTag : Uint4B<br>
   +0x0a0 AllocationsFailed : Uint4B<br>
   +0x0a4 AllocationsFailedDeliberately : Uint4B<br>
   +0x0a8 LockedBytes      : Uint8B<br>
   +0x0b0 PeakLockedBytes  : Uint8B<br>
   +0x0b8 MappedLockedBytes : Uint8B<br>
   +0x0c0 PeakMappedLockedBytes : Uint8B<br>
   +0x0c8 MappedIoSpaceBytes : Uint8B<br>
   +0x0d0 PeakMappedIoSpaceBytes : Uint8B<br>
   +0x0d8 PagesForMdlBytes : Uint8B<br>
   +0x0e0 PeakPagesForMdlBytes : Uint8B<br>
   +0x0e8 ContiguousMemoryBytes : Uint8B<br>
   +0x0f0 PeakContiguousMemoryBytes : Uint8B<br>
   +0x0f8 ContiguousMemoryListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x108 ExecutePoolTypes : Uint4B<br>
   +0x10c ExecutePageProtections : Uint4B<br>
   +0x110 ExecutePageMappings : Uint4B<br>
   +0x114 ExecuteWriteSections : Uint4B<br>
   +0x118 SectionAlignmentFailures : Uint4B<br>
   +0x11c IATInExecutableSection : Uint4B<br>
</font></body></html>