<html><body>
<h4>Windows 10 x64 (18363.628)</h4><br>
<h2>_WHEA_MEMORY_ERROR_SECTION</h2>
<font face="arial">   +0x000 ValidBits        : <a href="./_WHEA_MEMORY_ERROR_SECTION_VALIDBITS.html">_WHEA_MEMORY_ERROR_SECTION_VALIDBITS</a><br>
   +0x008 ErrorStatus      : <a href="./_WHEA_ERROR_STATUS.html">_WHEA_ERROR_STATUS</a><br>
   +0x010 PhysicalAddress  : Uint8B<br>
   +0x018 PhysicalAddressMask : Uint8B<br>
   +0x020 Node             : Uint2B<br>
   +0x022 Card             : Uint2B<br>
   +0x024 Module           : Uint2B<br>
   +0x026 Bank             : Uint2B<br>
   +0x028 Device           : Uint2B<br>
   +0x02a Row              : Uint2B<br>
   +0x02c Column           : Uint2B<br>
   +0x02e BitPosition      : Uint2B<br>
   +0x030 RequesterId      : Uint8B<br>
   +0x038 ResponderId      : Uint8B<br>
   +0x040 TargetId         : Uint8B<br>
   +0x048 ErrorType        : UChar<br>
   +0x049 Extended         : UChar<br>
   +0x04a RankNumber       : Uint2B<br>
   +0x04c CardHandle       : Uint2B<br>
   +0x04e ModuleHandle     : Uint2B<br>
</font></body></html>