<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>_DMA_OPERATIONS</h2>
<font face="arial">   +0x000 Size             : Uint4B<br>
   +0x008 PutDmaAdapter    : Ptr64     void <br>
   +0x010 AllocateCommonBuffer : Ptr64     void* <br>
   +0x018 FreeCommonBuffer : Ptr64     void <br>
   +0x020 AllocateAdapterChannel : Ptr64     long <br>
   +0x028 FlushAdapterBuffers : Ptr64     unsigned char <br>
   +0x030 FreeAdapterChannel : Ptr64     void <br>
   +0x038 FreeMapRegisters : Ptr64     void <br>
   +0x040 MapTransfer      : Ptr64     _<a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x048 GetDmaAlignment  : Ptr64     unsigned long <br>
   +0x050 ReadDmaCounter   : Ptr64     unsigned long <br>
   +0x058 GetScatterGatherList : Ptr64     long <br>
   +0x060 PutScatterGatherList : Ptr64     void <br>
   +0x068 CalculateScatterGatherList : Ptr64     long <br>
   +0x070 BuildScatterGatherList : Ptr64     long <br>
   +0x078 BuildMdlFromScatterGatherList : Ptr64     long <br>
   +0x080 GetDmaAdapterInfo : Ptr64     long <br>
   +0x088 GetDmaTransferInfo : Ptr64     long <br>
   +0x090 InitializeDmaTransferContext : Ptr64     long <br>
   +0x098 AllocateCommonBufferEx : Ptr64     void* <br>
   +0x0a0 AllocateAdapterChannelEx : Ptr64     long <br>
   +0x0a8 ConfigureAdapterChannel : Ptr64     long <br>
   +0x0b0 CancelAdapterChannel : Ptr64     unsigned char <br>
   +0x0b8 MapTransferEx    : Ptr64     long <br>
   +0x0c0 GetScatterGatherListEx : Ptr64     long <br>
   +0x0c8 BuildScatterGatherListEx : Ptr64     long <br>
   +0x0d0 FlushAdapterBuffersEx : Ptr64     long <br>
   +0x0d8 FreeAdapterObject : Ptr64     void <br>
   +0x0e0 CancelMappedTransfer : Ptr64     long <br>
   +0x0e8 AllocateDomainCommonBuffer : Ptr64     long <br>
   +0x0f0 FlushDmaBuffer   : Ptr64     long <br>
   +0x0f8 JoinDmaDomain    : Ptr64     long <br>
   +0x100 LeaveDmaDomain   : Ptr64     long <br>
   +0x108 GetDmaDomain     : Ptr64     void* <br>
   +0x110 AllocateCommonBufferWithBounds : Ptr64     void* <br>
   +0x118 AllocateCommonBufferVector : Ptr64     long <br>
   +0x120 GetCommonBufferFromVectorByIndex : Ptr64     void <br>
   +0x128 FreeCommonBufferFromVector : Ptr64     void <br>
   +0x130 FreeCommonBufferVector : Ptr64     void <br>
</font></body></html>