<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>_HEAP_SEG_CONTEXT</h2>
<font face="arial">   +0x000 SegmentMask      : Uint8B<br>
   +0x008 UnitShift        : UChar<br>
   +0x009 PagesPerUnitShift : UChar<br>
   +0x00a FirstDescriptorIndex : UChar<br>
   +0x00b CachedCommitSoftShift : UChar<br>
   +0x00c CachedCommitHighShift : UChar<br>
   +0x00d Flags            : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x010 MaxAllocationSize : Uint4B<br>
   +0x014 OlpStatsOffset   : Int2B<br>
   +0x016 MemStatsOffset   : Int2B<br>
   +0x018 LfhContext       : Ptr64 Void<br>
   +0x020 VsContext        : Ptr64 Void<br>
   +0x028 EnvHandle        : <a href="./RTL_HP_ENV_HANDLE.html">RTL_HP_ENV_HANDLE</a><br>
   +0x038 Heap             : Ptr64 Void<br>
   +0x040 SegmentLock      : Uint8B<br>
   +0x048 SegmentListHead  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x058 SegmentCount     : Uint8B<br>
   +0x060 FreePageRanges   : <a href="./_RTL_RB_TREE.html">_RTL_RB_TREE</a><br>
   +0x070 FreeSegmentListLock : Uint8B<br>
   +0x078 FreeSegmentList  : [2] <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
</font></body></html>