<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>_PROC_PERF_CHECK</h2>
<font face="arial">   +0x000 LastActive       : Uint8B<br>
   +0x008 LastTime         : Uint8B<br>
   +0x010 LastStall        : Uint8B<br>
   +0x018 LastResponsivenessEvents : Uint4B<br>
   +0x020 LastPerfCheckSnap : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x080 CurrentSnap      : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x0e0 LastDeliveredSnap : <a href="./_PROC_PERF_CHECK_SNAP.html">_PROC_PERF_CHECK_SNAP</a><br>
   +0x140 LastDeliveredPerformance : Uint4B<br>
   +0x144 LastDeliveredFrequency : Uint4B<br>
   +0x148 TaggedThreadPercent : [3] UChar<br>
   +0x14b Class0FloorPerfSelection : UChar<br>
   +0x14c Class1MinimumPerfSelection : UChar<br>
   +0x150 CurrentResponsivenessEvents : Uint4B<br>
</font></body></html>