<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>_SECONDARY_INTERRUPT_PROVIDER_INTERFACE</h2>
<font face="arial">   +0x000 Size             : Uint2B<br>
   +0x002 Version          : Uint2B<br>
   +0x008 Context          : Ptr64 Void<br>
   +0x010 GsivBase         : Uint4B<br>
   +0x014 GsivSize         : Uint2B<br>
   +0x018 DriverObject     : Ptr64 <a href="./_DRIVER_OBJECT.html">_DRIVER_OBJECT</a><br>
   +0x020 Reserved1        : Ptr64 Void<br>
   +0x028 Reserved2        : Ptr64 Void<br>
   +0x030 Reserved3        : Ptr64 Void<br>
   +0x038 Reserved4        : Ptr64 Void<br>
   +0x040 Reserved5        : Ptr64 Void<br>
   +0x048 Reserved6        : Ptr64 Void<br>
   +0x050 Reserved7        : Ptr64 Void<br>
</font></body></html>