<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>_VF_TARGET_VERIFIED_DRIVER_DATA</h2>
<font face="arial">   +0x000 SuspectDriverEntry : Ptr64 <a href="./_VF_SUSPECT_DRIVER_ENTRY.html">_VF_SUSPECT_DRIVER_ENTRY</a><br>
   +0x008 WMICallback      : Ptr64 Void<br>
   +0x010 EtwHandlesListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x028 Signature        : Uint8B<br>
   +0x030 SeSigningLevel   : UChar<br>
   +0x040 PoolPageHeaders  : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x050 PoolTrackers     : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x060 DifPluginData    : Ptr64 Ptr64 Void<br>
   +0x068 CurrentPagedPoolAllocations : Uint4B<br>
   +0x06c CurrentNonPagedPoolAllocations : Uint4B<br>
   +0x070 PeakPagedPoolAllocations : Uint4B<br>
   +0x074 PeakNonPagedPoolAllocations : Uint4B<br>
   +0x078 PagedBytes       : Uint8B<br>
   +0x080 NonPagedBytes    : Uint8B<br>
   +0x088 PeakPagedBytes   : Uint8B<br>
   +0x090 PeakNonPagedBytes : Uint8B<br>
   +0x098 RaiseIrqls       : Uint4B<br>
   +0x09c AcquireSpinLocks : Uint4B<br>
   +0x0a0 SynchronizeExecutions : Uint4B<br>
   +0x0a4 AllocationsWithNoTag : Uint4B<br>
   +0x0a8 AllocationsFailed : Uint4B<br>
   +0x0ac AllocationsFailedDeliberately : Uint4B<br>
   +0x0b0 LockedBytes      : Uint8B<br>
   +0x0b8 PeakLockedBytes  : Uint8B<br>
   +0x0c0 MappedLockedBytes : Uint8B<br>
   +0x0c8 PeakMappedLockedBytes : Uint8B<br>
   +0x0d0 MappedIoSpaceBytes : Uint8B<br>
   +0x0d8 PeakMappedIoSpaceBytes : Uint8B<br>
   +0x0e0 PagesForMdlBytes : Uint8B<br>
   +0x0e8 PeakPagesForMdlBytes : Uint8B<br>
   +0x0f0 ContiguousMemoryBytes : Uint8B<br>
   +0x0f8 PeakContiguousMemoryBytes : Uint8B<br>
   +0x100 ContiguousMemoryListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x110 ExecutePoolTypes : Uint4B<br>
   +0x114 ExecutePageProtections : Uint4B<br>
   +0x118 ExecutePageMappings : Uint4B<br>
   +0x11c ExecuteWriteSections : Uint4B<br>
   +0x120 SectionAlignmentFailures : Uint4B<br>
   +0x124 IATInExecutableSection : Uint4B<br>
</font></body></html>