<html><body>
<h4>Windows 10 x64 (19041.388)</h4><br>
<h2>wil_details_FeatureStateCache</h2>
<font face="arial">   +0x000 exchange         : Uint4B<br>
   +0x000 stateCached      : Pos 0, 1 Bit<br>
   +0x000 hasNotificationCached : Pos 1, 1 Bit<br>
   +0x000 variantCached    : Pos 2, 1 Bit<br>
   +0x000 effectiveState   : Pos 3, 1 Bit<br>
   +0x000 desiredState     : Pos 4, 1 Bit<br>
   +0x000 reservedForKernelModeSupport : Pos 5, 2 Bits<br>
   +0x000 hasNotification  : Pos 7, 1 Bit<br>
   +0x000 isVariant        : Pos 8, 1 Bit<br>
   +0x000 variant          : Pos 9, 6 Bits<br>
   +0x000 unused           : Pos 15, 17 Bits<br>
   +0x004 payloadId        : Uint4B<br>
   +0x000 exchange64       : Uint8B<br>
</font></body></html>