<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_MMMOD_WRITER_MDL_ENTRY</h2>
<font face="arial">   +0x000 Links            : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x020 Irp              : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x028 u1               : <a href="./_MODWRITER_FLAGS.html">_MODWRITER_FLAGS</a><br>
   +0x02c StoreWriteRefCount : Uint4B<br>
   +0x030 StoreWriteCompletionApc : <a href="./_KAPC.html">_KAPC</a><br>
   +0x088 ByteCount        : Uint4B<br>
   +0x08c ChargedPages     : Uint4B<br>
   +0x090 PagingFile       : Ptr64 <a href="./_MMPAGING_FILE.html">_MMPAGING_FILE</a><br>
   +0x098 File             : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x0a0 ControlArea      : Ptr64 <a href="./_CONTROL_AREA.html">_CONTROL_AREA</a><br>
   +0x0a8 FileResource     : Ptr64 <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
   +0x0b0 WriteOffset      : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x0b8 IssueTime        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x0c0 Partition        : Ptr64 <a href="./_MI_PARTITION.html">_MI_PARTITION</a><br>
   +0x0c8 PointerMdl       : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x0d0 Mdl              : <a href="./_MDL.html">_MDL</a><br>
   +0x100 Page             : [1] Uint8B<br>
</font></body></html>