<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_PI_BUS_EXTENSION</h2>
<font face="arial">   +0x000 Flags            : Uint4B<br>
   +0x004 NumberCSNs       : UChar<br>
   +0x008 ReadDataPort     : Ptr64 UChar<br>
   +0x010 DataPortMapped   : UChar<br>
   +0x018 AddressPort      : Ptr64 UChar<br>
   +0x020 AddrPortMapped   : UChar<br>
   +0x028 CommandPort      : Ptr64 UChar<br>
   +0x030 CmdPortMapped    : UChar<br>
   +0x034 NextSlotNumber   : Uint4B<br>
   +0x038 DeviceList       : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x040 CardList         : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x048 PhysicalBusDevice : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x050 FunctionalBusDevice : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x058 AttachedDevice   : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x060 BusNumber        : Uint4B<br>
   +0x064 SystemPowerState : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x068 DevicePowerState : <a href="./_DEVICE_POWER_STATE.html">_DEVICE_POWER_STATE</a><br>
</font></body></html>