<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_POP_IRP_DATA</h2>
<font face="arial">   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Irp              : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x018 Pdo              : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x020 TargetDevice     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x028 CurrentDevice    : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x030 WatchdogStart    : Uint8B<br>
   +0x038 WatchdogTimer    : <a href="./_KTIMER.html">_KTIMER</a><br>
   +0x078 WatchdogDpc      : <a href="./_KDPC.html">_KDPC</a><br>
   +0x0b8 MinorFunction    : UChar<br>
   +0x0bc PowerStateType   : <a href="./_POWER_STATE_TYPE.html">_POWER_STATE_TYPE</a><br>
   +0x0c0 PowerState       : <a href="./_POWER_STATE.html">_POWER_STATE</a><br>
   +0x0c4 WatchdogEnabled  : UChar<br>
   +0x0c8 FxDevice         : Ptr64 <a href="./_POP_FX_DEVICE.html">_POP_FX_DEVICE</a><br>
   +0x0d0 SystemTransition : UChar<br>
   +0x0d1 NotifyPEP        : UChar<br>
   +0x0d4 IrpSequenceID    : Int4B<br>
   +0x0d8 Device           : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0d8 System           : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0f8 DStateReason     : <a href="./_POP_PEP_NOTIFY_DEVICE_DSTATE_REASON.html">_POP_PEP_NOTIFY_DEVICE_DSTATE_REASON</a><br>
</font></body></html>