<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_PPM_ENGINE_SETTINGS</h2>
<font face="arial">   +0x000 ExplicitSetting  : [2] <a href="./_PPM_POLICY_SETTINGS_MASK.html">_PPM_POLICY_SETTINGS_MASK</a><br>
   +0x010 ThrottlingPolicy : UChar<br>
   +0x014 PerfTimeCheck    : Uint4B<br>
   +0x018 PerfHistoryCount : [2] UChar<br>
   +0x01a PerfMinPolicy    : [2] UChar<br>
   +0x01c PerfMaxPolicy    : [2] UChar<br>
   +0x01e PerfDecreaseTime : [2] UChar<br>
   +0x020 PerfIncreaseTime : [2] UChar<br>
   +0x022 PerfDecreasePolicy : [2] UChar<br>
   +0x024 PerfIncreasePolicy : [2] UChar<br>
   +0x026 PerfDecreaseThreshold : [2] UChar<br>
   +0x028 PerfIncreaseThreshold : [2] UChar<br>
   +0x02c PerfFrequencyCap : [2] Uint4B<br>
   +0x034 PerfBoostPolicy  : Uint4B<br>
   +0x038 PerfBoostMode    : Uint4B<br>
   +0x03c PerfReductionTolerance : Uint4B<br>
   +0x040 EnergyPerfPreference : [2] Uint4B<br>
   +0x048 AutonomousActivityWindow : Uint4B<br>
   +0x04c AutonomousPreference : UChar<br>
   +0x04d LatencyHintPerf  : [2] UChar<br>
   +0x04f LatencyHintUnpark : [2] UChar<br>
   +0x054 ResponsivenessDisableThreshold : [2] Uint4B<br>
   +0x05c ResponsivenessEnableThreshold : [2] Uint4B<br>
   +0x064 ResponsivenessDisableTime : [2] UChar<br>
   +0x066 ResponsivenessEnableTime : [2] UChar<br>
   +0x068 ResponsivenessEppCeiling : [2] Uint4B<br>
   +0x070 ResponsivenessPerfFloor : [2] Uint4B<br>
   +0x078 DutyCycling      : UChar<br>
   +0x079 ParkingPerfState : [2] UChar<br>
   +0x07b DistributeUtility : UChar<br>
   +0x07c CoreParkingOverUtilizationThreshold : UChar<br>
   +0x07d CoreParkingConcurrencyThreshold : UChar<br>
   +0x07e CoreParkingHeadroomThreshold : UChar<br>
   +0x07f CoreParkingDistributionThreshold : UChar<br>
   +0x080 CoreParkingDecreasePolicy : UChar<br>
   +0x081 CoreParkingIncreasePolicy : UChar<br>
   +0x084 CoreParkingDecreaseTime : Uint4B<br>
   +0x088 CoreParkingIncreaseTime : Uint4B<br>
   +0x08c CoreParkingMinCores : [2] UChar<br>
   +0x08e CoreParkingMaxCores : [2] UChar<br>
   +0x090 AllowScaling     : UChar<br>
   +0x091 IdleDisabled     : UChar<br>
   +0x094 IdleTimeCheck    : Uint4B<br>
   +0x098 IdleDemotePercent : UChar<br>
   +0x099 IdlePromotePercent : UChar<br>
   +0x09a IdleStateMax     : UChar<br>
   +0x09b HeteroDecreaseTime : UChar<br>
   +0x09c HeteroIncreaseTime : UChar<br>
   +0x09d HeteroDecreaseThreshold : [1280] UChar<br>
   +0x59d HeteroIncreaseThreshold : [1280] UChar<br>
   +0xa9d Class0FloorPerformance : UChar<br>
   +0xa9e Class1InitialPerformance : UChar<br>
   +0xaa0 ThreadPolicies   : [2] <a href="./_KHETERO_CPU_POLICY.html">_KHETERO_CPU_POLICY</a><br>
</font></body></html>