<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_PTE_TRACKER</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Mdl              : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x018 Count            : Uint8B<br>
   +0x020 SystemVa         : Ptr64 Void<br>
   +0x028 StartVa          : Ptr64 Void<br>
   +0x030 Offset           : Uint4B<br>
   +0x034 Length           : Uint4B<br>
   +0x038 Page             : Uint8B<br>
   +0x040 IoMapping        : Pos 0, 1 Bit<br>
   +0x040 Matched          : Pos 1, 1 Bit<br>
   +0x040 CacheAttribute   : Pos 2, 2 Bits<br>
   +0x040 GuardPte         : Pos 4, 1 Bit<br>
   +0x040 Spare            : Pos 5, 27 Bits<br>
   +0x048 StackTrace       : [7] Ptr64 Void<br>
</font></body></html>