<html><body>
<h4>Windows 10 1903 x64 (18362.86)</h4><br>
<h2>_WHEA_ERROR_PACKET_V2</h2>
<font face="arial">   +0x000 Signature        : Uint4B<br>
   +0x004 Version          : Uint4B<br>
   +0x008 Length           : Uint4B<br>
   +0x00c Flags            : <a href="./_WHEA_ERROR_PACKET_FLAGS.html">_WHEA_ERROR_PACKET_FLAGS</a><br>
   +0x010 ErrorType        : <a href="./_WHEA_ERROR_TYPE.html">_WHEA_ERROR_TYPE</a><br>
   +0x014 ErrorSeverity    : <a href="./_WHEA_ERROR_SEVERITY.html">_WHEA_ERROR_SEVERITY</a><br>
   +0x018 ErrorSourceId    : Uint4B<br>
   +0x01c ErrorSourceType  : <a href="./_WHEA_ERROR_SOURCE_TYPE.html">_WHEA_ERROR_SOURCE_TYPE</a><br>
   +0x020 NotifyType       : <a href="./_GUID.html">_GUID</a><br>
   +0x030 Context          : Uint8B<br>
   +0x038 DataFormat       : <a href="./_WHEA_ERROR_PACKET_DATA_FORMAT.html">_WHEA_ERROR_PACKET_DATA_FORMAT</a><br>
   +0x03c Reserved1        : Uint4B<br>
   +0x040 DataOffset       : Uint4B<br>
   +0x044 DataLength       : Uint4B<br>
   +0x048 PshedDataOffset  : Uint4B<br>
   +0x04c PshedDataLength  : Uint4B<br>
</font></body></html>