<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_DBGKD_GET_VERSION64</h2>
<font face="arial">   +0x000 MajorVersion     : Uint2B<br>
   +0x002 MinorVersion     : Uint2B<br>
   +0x004 ProtocolVersion  : UChar<br>
   +0x005 KdSecondaryVersion : UChar<br>
   +0x006 Flags            : Uint2B<br>
   +0x008 MachineType      : Uint2B<br>
   +0x00a MaxPacketType    : UChar<br>
   +0x00b MaxStateChange   : UChar<br>
   +0x00c MaxManipulate    : UChar<br>
   +0x00d Simulation       : UChar<br>
   +0x00e Unused           : [1] Uint2B<br>
   +0x010 KernBase         : Uint8B<br>
   +0x018 PsLoadedModuleList : Uint8B<br>
   +0x020 DebuggerDataList : Uint8B<br>
</font></body></html>