<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_HARDWARE_PTE</h2>
<font face="arial">   +0x000 Valid            : Pos 0, 1 Bit<br>
   +0x000 Write            : Pos 1, 1 Bit<br>
   +0x000 Owner            : Pos 2, 1 Bit<br>
   +0x000 WriteThrough     : Pos 3, 1 Bit<br>
   +0x000 CacheDisable     : Pos 4, 1 Bit<br>
   +0x000 Accessed         : Pos 5, 1 Bit<br>
   +0x000 Dirty            : Pos 6, 1 Bit<br>
   +0x000 LargePage        : Pos 7, 1 Bit<br>
   +0x000 Global           : Pos 8, 1 Bit<br>
   +0x000 CopyOnWrite      : Pos 9, 1 Bit<br>
   +0x000 Prototype        : Pos 10, 1 Bit<br>
   +0x000 reserved0        : Pos 11, 1 Bit<br>
   +0x000 PageFrameNumber  : Pos 12, 36 Bits<br>
   +0x000 reserved1        : Pos 48, 4 Bits<br>
   +0x000 SoftwareWsIndex  : Pos 52, 11 Bits<br>
   +0x000 NoExecute        : Pos 63, 1 Bit<br>
</font></body></html>