<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_KINTERRUPT</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Int2B<br>
   +0x008 InterruptListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x018 ServiceRoutine   : Ptr64     unsigned char <br>
   +0x020 MessageServiceRoutine : Ptr64     unsigned char <br>
   +0x028 MessageIndex     : Uint4B<br>
   +0x030 ServiceContext   : Ptr64 Void<br>
   +0x038 SpinLock         : Uint8B<br>
   +0x040 TickCount        : Uint4B<br>
   +0x048 ActualLock       : Ptr64 Uint8B<br>
   +0x050 DispatchAddress  : Ptr64     void <br>
   +0x058 Vector           : Uint4B<br>
   +0x05c Irql             : UChar<br>
   +0x05d SynchronizeIrql  : UChar<br>
   +0x05e FloatingSave     : UChar<br>
   +0x05f Connected        : UChar<br>
   +0x060 Number           : Uint4B<br>
   +0x064 ShareVector      : UChar<br>
   +0x065 EmulateActiveBoth : UChar<br>
   +0x066 ActiveCount      : Uint2B<br>
   +0x068 InternalState    : Int4B<br>
   +0x06c Mode             : <a href="./_KINTERRUPT_MODE.html">_KINTERRUPT_MODE</a><br>
   +0x070 Polarity         : <a href="./_KINTERRUPT_POLARITY.html">_KINTERRUPT_POLARITY</a><br>
   +0x074 ServiceCount     : Uint4B<br>
   +0x078 DispatchCount    : Uint4B<br>
   +0x080 PassiveEvent     : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x088 TrapFrame        : Ptr64 <a href="./_KTRAP_FRAME.html">_KTRAP_FRAME</a><br>
   +0x090 DisconnectData   : Ptr64 Void<br>
   +0x098 ServiceThread    : Ptr64 <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x0a0 ConnectionData   : Ptr64 <a href="./_INTERRUPT_CONNECTION_DATA.html">_INTERRUPT_CONNECTION_DATA</a><br>
   +0x0a8 IntTrackEntry    : Ptr64 Void<br>
   +0x0b0 IsrDpcStats      : <a href="./_ISRDPCSTATS.html">_ISRDPCSTATS</a><br>
   +0x0f0 RedirectObject   : Ptr64 Void<br>
   +0x0f8 Padding          : [8] UChar<br>
</font></body></html>