<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_MI_ERROR_STATE</h2>
<font face="arial">   +0x000 BadMemoryEventEntry : <a href="./_MI_BAD_MEMORY_EVENT_ENTRY.html">_MI_BAD_MEMORY_EVENT_ENTRY</a><br>
   +0x038 PageOfInterest   : Uint8B<br>
   +0x040 ProbeRaises      : <a href="./_MI_PROBE_RAISE_TRACKER.html">_MI_PROBE_RAISE_TRACKER</a><br>
   +0x084 ForcedCommits    : <a href="./_MI_FORCED_COMMITS.html">_MI_FORCED_COMMITS</a><br>
   +0x08c WsleFailures     : [1] Uint4B<br>
   +0x090 PageHashErrors   : Uint4B<br>
   +0x094 CheckZeroCount   : Uint4B<br>
   +0x098 ZeroedPageSingleBitErrorsDetected : Int4B<br>
   +0x09c BadPagesDetected : Int4B<br>
   +0x0a0 ScrubPasses      : Int4B<br>
   +0x0a4 ScrubBadPagesFound : Int4B<br>
   +0x0a8 UserViewFailures : Uint4B<br>
   +0x0ac UserViewCollisionFailures : Uint4B<br>
   +0x0b0 UserAllocateFailures : Uint4B<br>
   +0x0b4 UserAllocateCollisionFailures : Uint4B<br>
   +0x0b8 ResavailFailures : <a href="./_MI_RESAVAIL_FAILURES.html">_MI_RESAVAIL_FAILURES</a><br>
   +0x0c0 PendingBadPages  : UChar<br>
   +0x0c1 InitFailure      : UChar<br>
   +0x0c2 StopBadMaps      : UChar<br>
</font></body></html>