<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_MI_MODWRITE_DATA</h2>
<font face="arial">   +0x000 PagesLoad        : Int8B<br>
   +0x008 PagesAverage     : Uint8B<br>
   +0x010 AverageAvailablePages : Uint8B<br>
   +0x018 PagesWritten     : Uint8B<br>
   +0x020 WritesIssued     : Uint4B<br>
   +0x024 IgnoredReservationsCount : Uint4B<br>
   +0x028 FreedReservationsCount : Uint4B<br>
   +0x02c WriteBurstCount  : Uint4B<br>
   +0x030 IgnoreReservationsStartTime : Uint8B<br>
   +0x038 ReservationClusterInfo : <a href="./_MI_RESERVATION_CLUSTER_INFO.html">_MI_RESERVATION_CLUSTER_INFO</a><br>
   +0x03c IgnoreReservations : Pos 0, 1 Bit<br>
   +0x03c Spare            : Pos 1, 15 Bits<br>
   +0x03e Spare1           : Uint2B<br>
</font></body></html>