<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_OPEN_PACKET</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Int2B<br>
   +0x008 FileObject       : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x010 FinalStatus      : Int4B<br>
   +0x018 Information      : Uint8B<br>
   +0x020 ParseCheck       : Uint4B<br>
   +0x028 RelatedFileObject : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x028 ReferencedDeviceObject : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x030 OriginalAttributes : Ptr64 <a href="./_OBJECT_ATTRIBUTES.html">_OBJECT_ATTRIBUTES</a><br>
   +0x038 AllocationSize   : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x040 CreateOptions    : Uint4B<br>
   +0x044 FileAttributes   : Uint2B<br>
   +0x046 ShareAccess      : Uint2B<br>
   +0x048 EaBuffer         : Ptr64 Void<br>
   +0x050 EaLength         : Uint4B<br>
   +0x054 Options          : Uint4B<br>
   +0x058 Disposition      : Uint4B<br>
   +0x060 BasicInformation : Ptr64 <a href="./_FILE_BASIC_INFORMATION.html">_FILE_BASIC_INFORMATION</a><br>
   +0x068 NetworkInformation : Ptr64 <a href="./_FILE_NETWORK_OPEN_INFORMATION.html">_FILE_NETWORK_OPEN_INFORMATION</a><br>
   +0x070 FileInformation  : Ptr64 Void<br>
   +0x078 CreateFileType   : <a href="./_CREATE_FILE_TYPE.html">_CREATE_FILE_TYPE</a><br>
   +0x080 MailslotOrPipeParameters : Ptr64 Void<br>
   +0x088 Override         : UChar<br>
   +0x089 QueryOnly        : UChar<br>
   +0x08a DeleteOnly       : UChar<br>
   +0x08b FullAttributes   : UChar<br>
   +0x090 LocalFileObject  : Ptr64 <a href="./_DUMMY_FILE_OBJECT.html">_DUMMY_FILE_OBJECT</a><br>
   +0x098 InternalFlags    : Uint4B<br>
   +0x09c AccessMode       : Char<br>
   +0x0a0 DriverCreateContext : <a href="./_IO_DRIVER_CREATE_CONTEXT.html">_IO_DRIVER_CREATE_CONTEXT</a><br>
   +0x0c8 FileInformationClass : <a href="./_FILE_INFORMATION_CLASS.html">_FILE_INFORMATION_CLASS</a><br>
   +0x0cc FileInformationLength : Uint4B<br>
   +0x0d0 FilterQuery      : UChar<br>
</font></body></html>