<html><body>
<h4>Windows 10 x64 (18362.388)</h4><br>
<h2>_PENDING_RELATIONS_LIST_ENTRY</h2>
<font face="arial">   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 WorkItem         : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x030 DeviceEvent      : Ptr64 <a href="./_PNP_DEVICE_EVENT_ENTRY.html">_PNP_DEVICE_EVENT_ENTRY</a><br>
   +0x038 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x040 RelationsList    : Ptr64 <a href="./_RELATION_LIST.html">_RELATION_LIST</a><br>
   +0x048 EjectIrp         : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x050 Lock             : <a href="./IRPLOCK.html">IRPLOCK</a><br>
   +0x054 Problem          : Uint4B<br>
   +0x058 ProfileChangingEject : UChar<br>
   +0x059 DisplaySafeRemovalDialog : UChar<br>
   +0x05c LightestSleepState : <a href="./_SYSTEM_POWER_STATE.html">_SYSTEM_POWER_STATE</a><br>
   +0x060 DockInterface    : Ptr64 <a href="./DOCK_INTERFACE.html">DOCK_INTERFACE</a><br>
   +0x068 DequeuePending   : UChar<br>
   +0x06c DeleteType       : <a href="./_PNP_DEVICE_DELETE_TYPE.html">_PNP_DEVICE_DELETE_TYPE</a><br>
</font></body></html>