<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>_HIVE_LOAD_FAILURE</h2>
<font face="arial">   +0x000 Hive             : Ptr64 <a href="./_HHIVE.html">_HHIVE</a><br>
   +0x008 Index            : Uint2B<br>
   +0x00a RecoverableIndex : Uint2B<br>
   +0x00c Locations        : [8] <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x06c RecoverableLocations : [8] <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0d0 RegistryIO       : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0e8 CheckRegistry2   : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0f0 CheckKey         : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x110 CheckValueList   : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x128 CheckHive        : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x138 CheckHive1       : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x148 CheckBin         : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x158 RecoverData      : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>