<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>_IMAGE_DOS_HEADER</h2>
<font face="arial">   +0x000 e_magic          : Uint2B<br>
   +0x002 e_cblp           : Uint2B<br>
   +0x004 e_cp             : Uint2B<br>
   +0x006 e_crlc           : Uint2B<br>
   +0x008 e_cparhdr        : Uint2B<br>
   +0x00a e_minalloc       : Uint2B<br>
   +0x00c e_maxalloc       : Uint2B<br>
   +0x00e e_ss             : Uint2B<br>
   +0x010 e_sp             : Uint2B<br>
   +0x012 e_csum           : Uint2B<br>
   +0x014 e_ip             : Uint2B<br>
   +0x016 e_cs             : Uint2B<br>
   +0x018 e_lfarlc         : Uint2B<br>
   +0x01a e_ovno           : Uint2B<br>
   +0x01c e_res            : [4] Uint2B<br>
   +0x024 e_oemid          : Uint2B<br>
   +0x026 e_oeminfo        : Uint2B<br>
   +0x028 e_res2           : [10] Uint2B<br>
   +0x03c e_lfanew         : Int4B<br>
</font></body></html>