<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>_NONOPAQUE_OPLOCK</h2>
<font face="arial">   +0x000 IrpExclusiveOplock : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x008 FileObject       : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x010 ExclusiveOplockOwner : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x018 ExclusiveOplockOwnerThread : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x020 WaiterPriority   : UChar<br>
   +0x028 IrpOplocksR      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x038 IrpOplocksRH     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 RHBreakQueue     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x058 WaitingIrps      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x068 DelayAckFileObjectQueue : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x078 AtomicQueue      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x088 DeleterParentKey : Ptr64 <a href="./_GUID.html">_GUID</a><br>
   +0x090 OplockState      : Uint4B<br>
   +0x098 FastMutex        : Ptr64 <a href="./_FAST_MUTEX.html">_FAST_MUTEX</a><br>
</font></body></html>