<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>_VI_DEADLOCK_GLOBALS</h2>
<font face="arial">   +0x000 TimeAcquire      : Int8B<br>
   +0x008 TimeRelease      : Int8B<br>
   +0x010 ResourceDatabase : Ptr64 <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x018 ResourceDatabaseCount : Uint8B<br>
   +0x020 ResourceAddressRange : [1023] <a href="./_VF_ADDRESS_RANGE.html">_VF_ADDRESS_RANGE</a><br>
   +0x4010 ThreadDatabase   : Ptr64 <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x4018 ThreadDatabaseCount : Uint8B<br>
   +0x4020 ThreadAddressRange : [1023] <a href="./_VF_ADDRESS_RANGE.html">_VF_ADDRESS_RANGE</a><br>
   +0x8010 AllocationFailures : Uint4B<br>
   +0x8014 NodesTrimmedBasedOnAge : Uint4B<br>
   +0x8018 NodesTrimmedBasedOnCount : Uint4B<br>
   +0x801c NodesSearched    : Uint4B<br>
   +0x8020 MaxNodesSearched : Uint4B<br>
   +0x8024 SequenceNumber   : Uint4B<br>
   +0x8028 RecursionDepthLimit : Uint4B<br>
   +0x802c SearchedNodesLimit : Uint4B<br>
   +0x8030 DepthLimitHits   : Uint4B<br>
   +0x8034 SearchLimitHits  : Uint4B<br>
   +0x8038 StackLimitHits   : Uint4B<br>
   +0x803c ABC_ACB_Skipped  : Uint4B<br>
   +0x8040 OutOfOrderReleases : Uint4B<br>
   +0x8044 NodesReleasedOutOfOrder : Uint4B<br>
   +0x8048 TotalReleases    : Uint4B<br>
   +0x804c RootNodesDeleted : Uint4B<br>
   +0x8050 ForgetHistoryCounter : Uint4B<br>
   +0x8058 Instigator       : Ptr64 Void<br>
   +0x8060 NumberOfParticipants : Uint4B<br>
   +0x8068 Participant      : [32] Ptr64 <a href="./_VI_DEADLOCK_NODE.html">_VI_DEADLOCK_NODE</a><br>
   +0x8168 ChildrenCountWatermark : Int4B<br>
   +0x816c StackType        : <a href="./_KERNEL_STACK_LIMITS.html">_KERNEL_STACK_LIMITS</a><br>
   +0x8170 StackLowLimit    : Uint8B<br>
   +0x8178 StackHighLimit   : Uint8B<br>
</font></body></html>