<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>_WHEA_GENERIC_ERROR_DESCRIPTOR_V2</h2>
<font face="arial">   +0x000 Type             : Uint2B<br>
   +0x002 Reserved         : UChar<br>
   +0x003 Enabled          : UChar<br>
   +0x004 ErrStatusBlockLength : Uint4B<br>
   +0x008 RelatedErrorSourceId : Uint4B<br>
   +0x00c ErrStatusAddressSpaceID : UChar<br>
   +0x00d ErrStatusAddressBitWidth : UChar<br>
   +0x00e ErrStatusAddressBitOffset : UChar<br>
   +0x00f ErrStatusAddressAccessSize : UChar<br>
   +0x010 ErrStatusAddress : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 Notify           : <a href="./_WHEA_NOTIFICATION_DESCRIPTOR.html">_WHEA_NOTIFICATION_DESCRIPTOR</a><br>
   +0x034 ReadAckAddressSpaceID : UChar<br>
   +0x035 ReadAckAddressBitWidth : UChar<br>
   +0x036 ReadAckAddressBitOffset : UChar<br>
   +0x037 ReadAckAddressAccessSize : UChar<br>
   +0x038 ReadAckAddress   : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x040 ReadAckPreserveMask : Uint8B<br>
   +0x048 ReadAckWriteMask : Uint8B<br>
</font></body></html>