<html><body>
<h4>Windows 10 x64 (18363.900)</h4><br>
<h2>FEATURE_ERROR</h2>
<font face="arial">   +0x000 hr               : <a href="./HRESULT.html">HRESULT</a><br>
   +0x004 lineNumber       : Uint2B<br>
   +0x008 file             : Ptr64 Char<br>
   +0x010 process          : Ptr64 Char<br>
   +0x018 modulePath       : Ptr64 Char<br>
   +0x020 callerReturnAddressOffset : Uint4B<br>
   +0x028 callerModule     : Ptr64 Char<br>
   +0x030 message          : Ptr64 Char<br>
   +0x038 originLineNumber : Uint2B<br>
   +0x040 originFile       : Ptr64 Char<br>
   +0x048 originModule     : Ptr64 Char<br>
   +0x050 originCallerReturnAddressOffset : Uint4B<br>
   +0x058 originCallerModule : Ptr64 Char<br>
   +0x060 originName       : Ptr64 Char<br>
</font></body></html>