<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_BUS_HANDLER</h2>
<font face="arial">   +0x000 Version          : Uint4B<br>
   +0x004 InterfaceType    : <a href="./_INTERFACE_TYPE.html">_INTERFACE_TYPE</a><br>
   +0x008 ConfigurationType : <a href="./_BUS_DATA_TYPE.html">_BUS_DATA_TYPE</a><br>
   +0x00c BusNumber        : Uint4B<br>
   +0x010 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x018 ParentHandler    : Ptr64 <a href="./_BUS_HANDLER.html">_BUS_HANDLER</a><br>
   +0x020 BusData          : Ptr64 Void<br>
   +0x028 DeviceControlExtensionSize : Uint4B<br>
   +0x030 BusAddresses     : Ptr64 <a href="./_SUPPORTED_RANGES.html">_SUPPORTED_RANGES</a><br>
   +0x038 Reserved         : [4] Uint4B<br>
   +0x048 GetBusData       : Ptr64     unsigned long <br>
   +0x050 SetBusData       : Ptr64     unsigned long <br>
   +0x058 AdjustResourceList : Ptr64     long <br>
   +0x060 AssignSlotResources : Ptr64     long <br>
   +0x068 TranslateBusAddress : Ptr64     unsigned char <br>
   +0x070 Spare1           : Ptr64 Void<br>
   +0x078 Spare2           : Ptr64 Void<br>
   +0x080 Spare3           : Ptr64 Void<br>
   +0x088 Spare4           : Ptr64 Void<br>
   +0x090 Spare5           : Ptr64 Void<br>
   +0x098 Spare6           : Ptr64 Void<br>
   +0x0a0 Spare7           : Ptr64 Void<br>
   +0x0a8 Spare8           : Ptr64 Void<br>
</font></body></html>