<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_DBGKD_GET_VERSION32</h2>
<font face="arial">   +0x000 MajorVersion     : Uint2B<br>
   +0x002 MinorVersion     : Uint2B<br>
   +0x004 ProtocolVersion  : Uint2B<br>
   +0x006 Flags            : Uint2B<br>
   +0x008 KernBase         : Uint4B<br>
   +0x00c PsLoadedModuleList : Uint4B<br>
   +0x010 MachineType      : Uint2B<br>
   +0x012 ThCallbackStack  : Uint2B<br>
   +0x014 NextCallback     : Uint2B<br>
   +0x016 FramePointer     : Uint2B<br>
   +0x018 KiCallUserMode   : Uint4B<br>
   +0x01c KeUserCallbackDispatcher : Uint4B<br>
   +0x020 BreakpointWithStatus : Uint4B<br>
   +0x024 DebuggerDataList : Uint4B<br>
</font></body></html>