<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_HALP_DMA_ADAPTER_OBJECT</h2>
<font face="arial">   +0x000 DmaHeader        : <a href="./_DMA_ADAPTER.html">_DMA_ADAPTER</a><br>
   +0x010 ContiguousMapRegisters : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x018 ScatterBufferListHead : Ptr64 <a href="./_HALP_DMA_TRANSLATION_ENTRY.html">_HALP_DMA_TRANSLATION_ENTRY</a><br>
   +0x020 NumberOfFreeScatterBuffers : Uint4B<br>
   +0x028 ContiguousTranslations : Ptr64 <a href="./_HALP_DMA_TRANSLATION_BUFFER.html">_HALP_DMA_TRANSLATION_BUFFER</a><br>
   +0x030 ScatterTranslations : Ptr64 <a href="./_HALP_DMA_TRANSLATION_BUFFER.html">_HALP_DMA_TRANSLATION_BUFFER</a><br>
   +0x038 ContiguousTranslationEnd : <a href="./_HALP_DMA_TRANSLATION_BUFFER_POSITION.html">_HALP_DMA_TRANSLATION_BUFFER_POSITION</a><br>
   +0x048 ScatterTranslationEnd : <a href="./_HALP_DMA_TRANSLATION_BUFFER_POSITION.html">_HALP_DMA_TRANSLATION_BUFFER_POSITION</a><br>
   +0x058 CrashDump        : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x078 SpinLock         : Uint8B<br>
   +0x080 GrowLock         : Uint8B<br>
   +0x088 MaximumPhysicalAddress : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x090 IsMasterAdapter  : UChar<br>
   +0x091 DmaCanCross64K   : UChar<br>
   +0x094 LibraryVersion   : Uint4B<br>
</font></body></html>