<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_HEAP_COUNTERS</h2>
<font face="arial">   +0x000 TotalMemoryReserved : Uint8B<br>
   +0x008 TotalMemoryCommitted : Uint8B<br>
   +0x010 TotalMemoryLargeUCR : Uint8B<br>
   +0x018 TotalSizeInVirtualBlocks : Uint8B<br>
   +0x020 TotalSegments    : Uint4B<br>
   +0x024 TotalUCRs        : Uint4B<br>
   +0x028 CommittOps       : Uint4B<br>
   +0x02c DeCommitOps      : Uint4B<br>
   +0x030 LockAcquires     : Uint4B<br>
   +0x034 LockCollisions   : Uint4B<br>
   +0x038 CommitRate       : Uint4B<br>
   +0x03c DecommittRate    : Uint4B<br>
   +0x040 CommitFailures   : Uint4B<br>
   +0x044 InBlockCommitFailures : Uint4B<br>
   +0x048 PollIntervalCounter : Uint4B<br>
   +0x04c DecommitsSinceLastCheck : Uint4B<br>
   +0x050 HeapPollInterval : Uint4B<br>
   +0x054 AllocAndFreeOps  : Uint4B<br>
   +0x058 AllocationIndicesActive : Uint4B<br>
   +0x05c InBlockDeccommits : Uint4B<br>
   +0x060 InBlockDeccomitSize : Uint8B<br>
   +0x068 HighWatermarkSize : Uint8B<br>
   +0x070 LastPolledSize   : Uint8B<br>
</font></body></html>