<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_HIVE_LIST_ENTRY</h2>
<font face="arial">   +0x000 FileName         : Ptr64 Wchar<br>
   +0x008 BaseName         : Ptr64 Wchar<br>
   +0x010 RegRootName      : Ptr64 Wchar<br>
   +0x018 CmHive           : Ptr64 <a href="./_CMHIVE.html">_CMHIVE</a><br>
   +0x020 HHiveFlags       : Uint4B<br>
   +0x024 CmHiveFlags      : Uint4B<br>
   +0x028 CmKcbCacheSize   : Uint4B<br>
   +0x030 CmHive2          : Ptr64 <a href="./_CMHIVE.html">_CMHIVE</a><br>
   +0x038 HiveMounted      : UChar<br>
   +0x039 ThreadFinished   : UChar<br>
   +0x03a ThreadStarted    : UChar<br>
   +0x03b Allocate         : UChar<br>
   +0x03c WinPERequired    : UChar<br>
   +0x040 StartEvent       : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x058 FinishedEvent    : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x070 MountLock        : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x088 MountCallbackLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x090 CallbackListLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x098 CallbackListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0a8 CallbackWorkItem : Ptr64 <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x0b0 CallbackWorkItemBusy : Int4B<br>
   +0x0b8 FilePath         : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>