<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_KPCR</h2>
<font face="arial">   +0x000 NtTib            : <a href="./_NT_TIB.html">_NT_TIB</a><br>
   +0x000 GdtBase          : Ptr64 <a href="./_KGDTENTRY64.html">_KGDTENTRY64</a><br>
   +0x008 TssBase          : Ptr64 <a href="./_KTSS64.html">_KTSS64</a><br>
   +0x010 UserRsp          : Uint8B<br>
   +0x018 Self             : Ptr64 <a href="./_KPCR.html">_KPCR</a><br>
   +0x020 CurrentPrcb      : Ptr64 <a href="./_KPRCB.html">_KPRCB</a><br>
   +0x028 LockArray        : Ptr64 <a href="./_KSPIN_LOCK_QUEUE.html">_KSPIN_LOCK_QUEUE</a><br>
   +0x030 Used_Self        : Ptr64 Void<br>
   +0x038 IdtBase          : Ptr64 <a href="./_KIDTENTRY64.html">_KIDTENTRY64</a><br>
   +0x040 Unused           : [2] Uint8B<br>
   +0x050 Irql             : UChar<br>
   +0x051 SecondLevelCacheAssociativity : UChar<br>
   +0x052 ObsoleteNumber   : UChar<br>
   +0x053 Fill0            : UChar<br>
   +0x054 Unused0          : [3] Uint4B<br>
   +0x060 MajorVersion     : Uint2B<br>
   +0x062 MinorVersion     : Uint2B<br>
   +0x064 StallScaleFactor : Uint4B<br>
   +0x068 Unused1          : [3] Ptr64 Void<br>
   +0x080 KernelReserved   : [15] Uint4B<br>
   +0x0bc SecondLevelCacheSize : Uint4B<br>
   +0x0c0 HalReserved      : [16] Uint4B<br>
   +0x100 Unused2          : Uint4B<br>
   +0x108 KdVersionBlock   : Ptr64 Void<br>
   +0x110 Unused3          : Ptr64 Void<br>
   +0x118 PcrAlign1        : [24] Uint4B<br>
   +0x180 Prcb             : <a href="./_KPRCB.html">_KPRCB</a><br>
</font></body></html>