<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_KSHARED_READY_QUEUE</h2>
<font face="arial">   +0x000 Lock             : Uint8B<br>
   +0x008 ReadySummary     : Uint4B<br>
   +0x010 ReadyListHead    : [32] <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x210 RunningSummary   : [64] Char<br>
   +0x250 Span             : UChar<br>
   +0x251 LowProcIndex     : UChar<br>
   +0x252 QueueIndex       : UChar<br>
   +0x253 ProcCount        : UChar<br>
   +0x254 ScanOwner        : UChar<br>
   +0x255 Spare            : [3] UChar<br>
   +0x258 Affinity         : Uint8B<br>
   +0x260 ReadyThreadCount : Uint4B<br>
   +0x268 ReadyQueueExpectedRunTime : Uint8B<br>
</font></body></html>