<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_LOADER_PARAMETER_CI_EXTENSION</h2>
<font face="arial">   +0x000 CodeIntegrityOptions : Uint4B<br>
   +0x004 UpgradeInProgress : Pos 0, 1 Bit<br>
   +0x004 IsWinPE          : Pos 1, 1 Bit<br>
   +0x004 CustomKernelSignersAllowed : Pos 2, 1 Bit<br>
   +0x004 StateSeparationEnabled : Pos 3, 1 Bit<br>
   +0x004 Reserved         : Pos 4, 28 Bits<br>
   +0x008 WhqlEnforcementDate : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x010 RevocationListOffset : Uint4B<br>
   +0x014 RevocationListSize : Uint4B<br>
   +0x018 CodeIntegrityPolicyOffset : Uint4B<br>
   +0x01c CodeIntegrityPolicySize : Uint4B<br>
   +0x020 CodeIntegrityPolicyHashOffset : Uint4B<br>
   +0x024 CodeIntegrityPolicyHashSize : Uint4B<br>
   +0x028 CodeIntegrityPolicyOriginalHashOffset : Uint4B<br>
   +0x02c CodeIntegrityPolicyOriginalHashSize : Uint4B<br>
   +0x030 WeakCryptoPolicyLoadStatus : Int4B<br>
   +0x034 WeakCryptoPolicyOffset : Uint4B<br>
   +0x038 WeakCryptoPolicySize : Uint4B<br>
   +0x03c SecureBootPolicyOffset : Uint4B<br>
   +0x040 SecureBootPolicySize : Uint4B<br>
   +0x044 Reserved2        : Uint4B<br>
   +0x048 SerializedData   : [1] UChar<br>
</font></body></html>