<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_MCI_STATUS_INTEL_BITS</h2>
<font face="arial">   +0x000 McaErrorCode     : Pos 0, 16 Bits<br>
   +0x000 ModelErrorCode   : Pos 16, 16 Bits<br>
   +0x000 OtherInfo        : Pos 32, 5 Bits<br>
   +0x000 FirmwareUpdateError : Pos 37, 1 Bit<br>
   +0x000 CorrectedErrorCount : Pos 38, 15 Bits<br>
   +0x000 ThresholdErrorStatus : Pos 53, 2 Bits<br>
   +0x000 ActionRequired   : Pos 55, 1 Bit<br>
   +0x000 Signalling       : Pos 56, 1 Bit<br>
   +0x000 ContextCorrupt   : Pos 57, 1 Bit<br>
   +0x000 AddressValid     : Pos 58, 1 Bit<br>
   +0x000 MiscValid        : Pos 59, 1 Bit<br>
   +0x000 ErrorEnabled     : Pos 60, 1 Bit<br>
   +0x000 UncorrectedError : Pos 61, 1 Bit<br>
   +0x000 StatusOverFlow   : Pos 62, 1 Bit<br>
   +0x000 Valid            : Pos 63, 1 Bit<br>
</font></body></html>