<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_MI_PARTITION_MODWRITES</h2>
<font face="arial">   +0x000 AttemptForCantExtend : <a href="./_MMPAGE_FILE_EXPANSION.html">_MMPAGE_FILE_EXPANSION</a><br>
   +0x058 PageFileContract : <a href="./_MMPAGE_FILE_EXPANSION.html">_MMPAGE_FILE_EXPANSION</a><br>
   +0x0b0 NumberOfMappedMdls : Uint8B<br>
   +0x0b8 NumberOfMappedMdlsInUse : Int4B<br>
   +0x0bc NumberOfMappedMdlsInUsePeak : Uint4B<br>
   +0x0c0 MappedFileHeader : <a href="./_MMMOD_WRITER_LISTHEAD.html">_MMMOD_WRITER_LISTHEAD</a><br>
   +0x0e8 NeedMappedMdl    : UChar<br>
   +0x0e9 NeedPageFileMdl  : UChar<br>
   +0x0ea ModwriterActive  : UChar<br>
   +0x0eb TransitionInserted : UChar<br>
   +0x0ec LastModifiedWriteError : Int4B<br>
   +0x0f0 LastMappedWriteError : Int4B<br>
   +0x0f4 MappedFileWriteSucceeded : Uint4B<br>
   +0x0f8 MappedWriteBurstCount : Uint4B<br>
   +0x0fc LowPriorityModWritesOutstanding : Uint4B<br>
   +0x100 BoostModWriteIoPriorityEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x118 ModifiedWriterThreadPriority : Int4B<br>
   +0x120 ModifiedPagesLowPriorityGoal : Uint8B<br>
   +0x128 ModifiedPageWriterEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x140 ModifiedWriterExitedEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x158 WriteAllPagefilePages : Int4B<br>
   +0x15c WriteAllMappedPages : Int4B<br>
   +0x160 MappedPageWriterEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x178 ModWriteData     : <a href="./_MI_MODWRITE_DATA.html">_MI_MODWRITE_DATA</a><br>
   +0x1b8 RescanPageFilesEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x1d0 PagingFileHeader : <a href="./_MMMOD_WRITER_LISTHEAD.html">_MMMOD_WRITER_LISTHEAD</a><br>
   +0x1f8 ModifiedPageWriterThread : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x200 ModifiedPageWriterRundown : <a href="./_EX_RUNDOWN_REF.html">_EX_RUNDOWN_REF</a><br>
   +0x208 PagefileScanWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x228 PagefileScanCount : Uint4B<br>
   +0x22c ClusterRestrictionLock : Int4B<br>
   +0x230 ClusterRestrictions : [2] <a href="./_MI_RESTRICTED_MODWRITES.html">_MI_RESTRICTED_MODWRITES</a><br>
   +0x238 NotifyStoreMemoryConditions : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x250 DelayMappedWrite : UChar<br>
   +0x254 PagefileReservationsEnabled : Uint4B<br>
   +0x258 PageFileCreationLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x260 TrimPagefileWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x280 LastTrimPagefileTime : Uint8B<br>
   +0x288 WsSwapPagefileContractWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x2a8 WsSwapPageFileContractionInProgress : Int4B<br>
   +0x2b0 WorkingSetSwapLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x2b8 WorkingSetInswapLock : Int4B<br>
</font></body></html>