<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_UMS_CONTROL_BLOCK</h2>
<font face="arial">   +0x000 UmsContext       : Ptr64 <a href="./_RTL_UMS_CONTEXT.html">_RTL_UMS_CONTEXT</a><br>
   +0x008 CompletionListEntry : Ptr64 <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x010 CompletionListEvent : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x018 ServiceSequenceNumber : Uint4B<br>
   +0x020 UmsQueue         : <a href="./_KQUEUE.html">_KQUEUE</a><br>
   +0x060 QueueEntry       : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x070 YieldingUmsContext : Ptr64 <a href="./_RTL_UMS_CONTEXT.html">_RTL_UMS_CONTEXT</a><br>
   +0x078 YieldingParam    : Ptr64 Void<br>
   +0x080 UmsTeb           : Ptr64 Void<br>
   +0x020 UmsAssociatedQueue : Ptr64 <a href="./_KQUEUE.html">_KQUEUE</a><br>
   +0x028 UmsQueueListEntry : Ptr64 <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x030 UmsWaitEvent     : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x048 StagingArea      : Ptr64 Void<br>
   +0x050 UmsPrimaryDeliveredContext : Pos 0, 1 Bit<br>
   +0x050 UmsAssociatedQueueUsed : Pos 1, 1 Bit<br>
   +0x050 UmsThreadParked  : Pos 2, 1 Bit<br>
   +0x050 UmsFlags         : Uint4B<br>
</font></body></html>