<html><body>
<h4>Windows 10 x64 (19041.450)</h4><br>
<h2>_WHEA_DEVICE_DRIVER_DESCRIPTOR</h2>
<font face="arial">   +0x000 Type             : Uint2B<br>
   +0x002 Enabled          : UChar<br>
   +0x003 Reserved         : UChar<br>
   +0x004 SourceGuid       : <a href="./_GUID.html">_GUID</a><br>
   +0x014 LogTag           : Uint2B<br>
   +0x016 Reserved2        : Uint2B<br>
   +0x018 PacketLength     : Uint4B<br>
   +0x01c PacketCount      : Uint4B<br>
   +0x020 PacketBuffer     : Ptr64 UChar<br>
   +0x028 Config           : <a href="./_WHEA_ERROR_SOURCE_CONFIGURATION_DD.html">_WHEA_ERROR_SOURCE_CONFIGURATION_DD</a><br>
   +0x040 CreatorId        : <a href="./_GUID.html">_GUID</a><br>
   +0x050 PartitionId      : <a href="./_GUID.html">_GUID</a><br>
   +0x060 MaxSectionDataLength : Uint4B<br>
   +0x064 MaxSectionsPerRecord : Uint4B<br>
   +0x068 PacketStateBuffer : Ptr64 UChar<br>
   +0x070 OpenHandles      : Int4B<br>
</font></body></html>