<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_DEBUG_DEVICE_DESCRIPTOR</h2>
<font face="arial">   +0x000 Bus              : Uint4B<br>
   +0x004 Slot             : Uint4B<br>
   +0x008 Segment          : Uint2B<br>
   +0x00a VendorID         : Uint2B<br>
   +0x00c DeviceID         : Uint2B<br>
   +0x00e BaseClass        : UChar<br>
   +0x00f SubClass         : UChar<br>
   +0x010 ProgIf           : UChar<br>
   +0x011 Flags            : UChar<br>
   +0x011 DbgHalScratchAllocated : Pos 0, 1 Bit<br>
   +0x011 DbgBarsMapped    : Pos 1, 1 Bit<br>
   +0x011 DbgScratchAllocated : Pos 2, 1 Bit<br>
   +0x012 Initialized      : UChar<br>
   +0x013 Configured       : UChar<br>
   +0x018 BaseAddress      : [6] <a href="./DEBUG_DEVICE_ADDRESS.html">DEBUG_DEVICE_ADDRESS</a><br>
   +0x0a8 Memory           : <a href="./DEBUG_MEMORY_REQUIREMENTS.html">DEBUG_MEMORY_REQUIREMENTS</a><br>
   +0x0c8 Dbg2TableIndex   : Uint4B<br>
   +0x0cc PortType         : Uint2B<br>
   +0x0ce PortSubtype      : Uint2B<br>
   +0x0d0 OemData          : Ptr64 Void<br>
   +0x0d8 OemDataLength    : Uint4B<br>
   +0x0dc NameSpace        : <a href="./KD_NAMESPACE_ENUM.html">KD_NAMESPACE_ENUM</a><br>
   +0x0e0 NameSpacePath    : Ptr64 Wchar<br>
   +0x0e8 NameSpacePathLength : Uint4B<br>
   +0x0ec TransportType    : Uint4B<br>
   +0x0f0 TransportData    : <a href="./_DEBUG_TRANSPORT_DATA.html">_DEBUG_TRANSPORT_DATA</a><br>
</font></body></html>