<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_DUMP_INITIALIZATION_CONTEXT</h2>
<font face="arial">   +0x000 Length           : Uint4B<br>
   +0x004 Reserved         : Uint4B<br>
   +0x008 MemoryBlock      : Ptr64 Void<br>
   +0x010 CommonBuffer     : [2] Ptr64 Void<br>
   +0x020 PhysicalAddress  : [2] <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x030 StallRoutine     : Ptr64     void <br>
   +0x038 OpenRoutine      : Ptr64     unsigned char <br>
   +0x040 WriteRoutine     : Ptr64     long <br>
   +0x048 FinishRoutine    : Ptr64     void <br>
   +0x050 AdapterObject    : Ptr64 <a href="./_ADAPTER_OBJECT.html">_ADAPTER_OBJECT</a><br>
   +0x058 MappedRegisterBase : Ptr64 Void<br>
   +0x060 PortConfiguration : Ptr64 Void<br>
   +0x068 CrashDump        : UChar<br>
   +0x069 MarkMemoryOnly   : UChar<br>
   +0x06a HiberResume      : UChar<br>
   +0x06b Reserved1        : UChar<br>
   +0x06c MaximumTransferSize : Uint4B<br>
   +0x070 CommonBufferSize : Uint4B<br>
   +0x078 TargetAddress    : Ptr64 Void<br>
   +0x080 WritePendingRoutine : Ptr64     long <br>
   +0x088 PartitionStyle   : Uint4B<br>
   +0x08c DiskInfo         : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0a0 ReadRoutine      : Ptr64     long <br>
   +0x0a8 GetDriveTelemetryRoutine : Ptr64     long <br>
   +0x0b0 LogSectionTruncateSize : Uint4B<br>
   +0x0b4 Parameters       : [16] Uint4B<br>
   +0x0f8 GetTransferSizesRoutine : Ptr64     void <br>
   +0x100 DumpNotifyRoutine : Ptr64     void <br>
</font></body></html>