<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_HEAP_LFH_SUBSEGMENT</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 Owner            : Ptr64 <a href="./_HEAP_LFH_SUBSEGMENT_OWNER.html">_HEAP_LFH_SUBSEGMENT_OWNER</a><br>
   +0x010 DelayFree        : <a href="./_HEAP_LFH_SUBSEGMENT_DELAY_FREE.html">_HEAP_LFH_SUBSEGMENT_DELAY_FREE</a><br>
   +0x018 CommitLock       : Uint8B<br>
   +0x020 FreeCount        : Uint2B<br>
   +0x022 BlockCount       : Uint2B<br>
   +0x020 InterlockedShort : Int2B<br>
   +0x020 InterlockedLong  : Int4B<br>
   +0x024 FreeHint         : Uint2B<br>
   +0x026 Location         : UChar<br>
   +0x027 WitheldBlockCount : UChar<br>
   +0x028 BlockOffsets     : <a href="./_HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS.html">_HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS</a><br>
   +0x02c CommitUnitShift  : UChar<br>
   +0x02d CommitUnitCount  : UChar<br>
   +0x02e CommitStateOffset : Uint2B<br>
   +0x030 BlockBitmap      : [1] Uint8B<br>
</font></body></html>