<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_KLDR_DATA_TABLE_ENTRY</h2>
<font face="arial">   +0x000 InLoadOrderLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 ExceptionTable   : Ptr64 Void<br>
   +0x018 ExceptionTableSize : Uint4B<br>
   +0x020 GpValue          : Ptr64 Void<br>
   +0x028 NonPagedDebugInfo : Ptr64 <a href="./_NON_PAGED_DEBUG_INFO.html">_NON_PAGED_DEBUG_INFO</a><br>
   +0x030 DllBase          : Ptr64 Void<br>
   +0x038 EntryPoint       : Ptr64 Void<br>
   +0x040 SizeOfImage      : Uint4B<br>
   +0x048 FullDllName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x058 BaseDllName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x068 Flags            : Uint4B<br>
   +0x06c LoadCount        : Uint2B<br>
   +0x06e u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x070 SectionPointer   : Ptr64 Void<br>
   +0x078 CheckSum         : Uint4B<br>
   +0x07c CoverageSectionSize : Uint4B<br>
   +0x080 CoverageSection  : Ptr64 Void<br>
   +0x088 LoadedImports    : Ptr64 Void<br>
   +0x090 Spare            : Ptr64 Void<br>
   +0x098 SizeOfImageNotRounded : Uint4B<br>
   +0x09c TimeDateStamp    : Uint4B<br>
</font></body></html>