<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_PCW_PROCESSOR_INFO</h2>
<font face="arial">   +0x000 IdleTime         : Uint8B<br>
   +0x008 AvailableTime    : Uint8B<br>
   +0x010 UserTime         : Uint8B<br>
   +0x018 KernelTime       : Uint8B<br>
   +0x020 Interrupts       : Uint4B<br>
   +0x028 DpcTime          : Uint8B<br>
   +0x030 InterruptTime    : Uint8B<br>
   +0x038 ClockInterrupts  : Uint4B<br>
   +0x03c DpcCount         : Uint4B<br>
   +0x040 DpcRate          : Uint4B<br>
   +0x048 C1Time           : Uint8B<br>
   +0x050 C2Time           : Uint8B<br>
   +0x058 C3Time           : Uint8B<br>
   +0x060 C1Transitions    : Uint8B<br>
   +0x068 C2Transitions    : Uint8B<br>
   +0x070 C3Transitions    : Uint8B<br>
   +0x078 StallTime        : Uint8B<br>
   +0x080 ParkingStatus    : Uint4B<br>
   +0x084 CurrentFrequency : Uint4B<br>
   +0x088 PercentMaxFrequency : Uint4B<br>
   +0x08c StateFlags       : Uint4B<br>
   +0x090 NominalThroughput : Uint4B<br>
   +0x094 ActiveThroughput : Uint4B<br>
   +0x098 ScaledThroughput : Uint8B<br>
   +0x0a0 ScaledKernelThroughput : Uint8B<br>
   +0x0a8 AverageIdleTime  : Uint8B<br>
   +0x0b0 IdleBreakEvents  : Uint8B<br>
   +0x0b8 PerformanceLimit : Uint4B<br>
   +0x0bc PerformanceLimitFlags : Uint4B<br>
</font></body></html>