<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_POP_THERMAL_ZONE</h2>
<font face="arial">   +0x000 PolicyDevice     : <a href="./_POP_POLICY_DEVICE.html">_POP_POLICY_DEVICE</a><br>
   +0x000 Link             : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 DeviceType       : <a href="./POWER_POLICY_DEVICE_TYPE.html">POWER_POLICY_DEVICE_TYPE</a><br>
   +0x018 Notification     : Ptr64 Void<br>
   +0x020 Name             : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x030 Device           : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x038 Irp              : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x040 State            : UChar<br>
   +0x041 Flags            : UChar<br>
   +0x042 Removing         : UChar<br>
   +0x043 Mode             : UChar<br>
   +0x044 PendingMode      : UChar<br>
   +0x045 ActivePoint      : UChar<br>
   +0x046 PendingActivePoint : UChar<br>
   +0x047 Critical         : UChar<br>
   +0x048 ThermalStandby   : UChar<br>
   +0x049 OverThrottled    : UChar<br>
   +0x04c HighPrecisionThrottle : Int4B<br>
   +0x050 Throttle         : Int4B<br>
   +0x054 PendingThrottle  : Int4B<br>
   +0x058 ThrottleReasons  : Uint4B<br>
   +0x060 LastPassiveTime  : Uint8B<br>
   +0x068 SampleRate       : Uint4B<br>
   +0x06c LastTemp         : Uint4B<br>
   +0x070 Info             : <a href="./_THERMAL_INFORMATION_EX.html">_THERMAL_INFORMATION_EX</a><br>
   +0x0cc Policy           : <a href="./_THERMAL_POLICY.html">_THERMAL_POLICY</a><br>
   +0x0e4 PolicyDriver     : UChar<br>
   +0x0e8 PollingRate      : Uint4B<br>
   +0x0f0 LastTemperatureTime : Uint8B<br>
   +0x0f8 LastActiveStartTime : Uint8B<br>
   +0x100 LastPassiveStartTime : Uint8B<br>
   +0x108 WorkItem         : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x128 ZoneUpdateTimer  : <a href="./_KTIMER2.html">_KTIMER2</a><br>
   +0x1b0 Lock             : <a href="./_POP_RW_LOCK.html">_POP_RW_LOCK</a><br>
   +0x1c0 ZoneStopped      : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x1d8 TemperatureUpdated : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x1f0 InstanceId       : Uint4B<br>
   +0x1f8 TelemetryTracker : <a href="./_POP_THERMAL_TELEMETRY_TRACKER.html">_POP_THERMAL_TELEMETRY_TRACKER</a><br>
   +0x410 Description      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>