<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_PROC_FEEDBACK</h2>
<font face="arial">   +0x000 Lock             : Uint8B<br>
   +0x008 CyclesLast       : Uint8B<br>
   +0x010 CyclesActive     : Uint8B<br>
   +0x018 Counters         : [2] Ptr64 <a href="./_PROC_FEEDBACK_COUNTER.html">_PROC_FEEDBACK_COUNTER</a><br>
   +0x028 LastUpdateTime   : Uint8B<br>
   +0x030 UnscaledTime     : Uint8B<br>
   +0x038 UnaccountedTime  : Int8B<br>
   +0x040 ScaledTime       : [2] Uint8B<br>
   +0x050 UnaccountedKernelTime : Uint8B<br>
   +0x058 PerformanceScaledKernelTime : Uint8B<br>
   +0x060 UserTimeLast     : Uint4B<br>
   +0x064 KernelTimeLast   : Uint4B<br>
   +0x068 IdleGenerationNumberLast : Uint8B<br>
   +0x070 HvActiveTimeLast : Uint8B<br>
   +0x078 StallCyclesLast  : Uint8B<br>
   +0x080 StallTime        : Uint8B<br>
   +0x088 KernelTimesIndex : UChar<br>
   +0x089 CounterDiscardsIdleTime : UChar<br>
</font></body></html>