<html><body>
<h4>Windows 10 x64 (18363.657)</h4><br>
<h2>_PROC_PERF_CONSTRAINT</h2>
<font face="arial">   +0x000 Prcb             : Ptr64 <a href="./_KPRCB.html">_KPRCB</a><br>
   +0x008 PerfContext      : Uint8B<br>
   +0x010 HiddenProcessor  : UChar<br>
   +0x014 HiddenProcessorId : Uint4B<br>
   +0x018 PlatformCap      : Uint4B<br>
   +0x01c ThermalCap       : Uint4B<br>
   +0x020 LimitReasons     : Uint4B<br>
   +0x028 PlatformCapStartTime : Uint8B<br>
   +0x030 ProcCap          : Uint4B<br>
   +0x034 ProcFloor        : Uint4B<br>
   +0x038 TargetPercent    : Uint4B<br>
   +0x03c EngageResponsivenessOverrides : UChar<br>
   +0x03d ResponsivenessChangeCount : UChar<br>
   +0x040 Selection        : <a href="./_PERF_CONTROL_STATE_SELECTION.html">_PERF_CONTROL_STATE_SELECTION</a><br>
   +0x068 DomainSelectionGeneration : Uint4B<br>
   +0x06c PreviousFrequency : Uint4B<br>
   +0x070 PreviousPercent  : Uint4B<br>
   +0x074 LatestFrequencyPercent : Uint4B<br>
   +0x078 Force            : UChar<br>
   +0x079 UseQosUpdateLock : UChar<br>
   +0x080 QosUpdateLock    : Uint8B<br>
</font></body></html>