<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_DEVICE_OBJECT</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Uint2B<br>
   +0x004 ReferenceCount   : Int4B<br>
   +0x008 DriverObject     : Ptr64 <a href="./_DRIVER_OBJECT.html">_DRIVER_OBJECT</a><br>
   +0x010 NextDevice       : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x018 AttachedDevice   : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x020 CurrentIrp       : Ptr64 <a href="./_IRP.html">_IRP</a><br>
   +0x028 Timer            : Ptr64 <a href="./_IO_TIMER.html">_IO_TIMER</a><br>
   +0x030 Flags            : Uint4B<br>
   +0x034 Characteristics  : Uint4B<br>
   +0x038 Vpb              : Ptr64 <a href="./_VPB.html">_VPB</a><br>
   +0x040 DeviceExtension  : Ptr64 Void<br>
   +0x048 DeviceType       : Uint4B<br>
   +0x04c StackSize        : Char<br>
   +0x050 Queue            : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x098 AlignmentRequirement : Uint4B<br>
   +0x0a0 DeviceQueue      : <a href="./_KDEVICE_QUEUE.html">_KDEVICE_QUEUE</a><br>
   +0x0c8 Dpc              : <a href="./_KDPC.html">_KDPC</a><br>
   +0x108 ActiveThreadCount : Uint4B<br>
   +0x110 SecurityDescriptor : Ptr64 Void<br>
   +0x118 DeviceLock       : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x130 SectorSize       : Uint2B<br>
   +0x132 Spare1           : Uint2B<br>
   +0x138 DeviceObjectExtension : Ptr64 <a href="./_DEVOBJ_EXTENSION.html">_DEVOBJ_EXTENSION</a><br>
   +0x140 Reserved         : Ptr64 Void<br>
</font></body></html>