<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_IMAGE_OPTIONAL_HEADER64</h2>
<font face="arial">   +0x000 Magic            : Uint2B<br>
   +0x002 MajorLinkerVersion : UChar<br>
   +0x003 MinorLinkerVersion : UChar<br>
   +0x004 SizeOfCode       : Uint4B<br>
   +0x008 SizeOfInitializedData : Uint4B<br>
   +0x00c SizeOfUninitializedData : Uint4B<br>
   +0x010 AddressOfEntryPoint : Uint4B<br>
   +0x014 BaseOfCode       : Uint4B<br>
   +0x018 ImageBase        : Uint8B<br>
   +0x020 SectionAlignment : Uint4B<br>
   +0x024 FileAlignment    : Uint4B<br>
   +0x028 MajorOperatingSystemVersion : Uint2B<br>
   +0x02a MinorOperatingSystemVersion : Uint2B<br>
   +0x02c MajorImageVersion : Uint2B<br>
   +0x02e MinorImageVersion : Uint2B<br>
   +0x030 MajorSubsystemVersion : Uint2B<br>
   +0x032 MinorSubsystemVersion : Uint2B<br>
   +0x034 Win32VersionValue : Uint4B<br>
   +0x038 SizeOfImage      : Uint4B<br>
   +0x03c SizeOfHeaders    : Uint4B<br>
   +0x040 CheckSum         : Uint4B<br>
   +0x044 Subsystem        : Uint2B<br>
   +0x046 DllCharacteristics : Uint2B<br>
   +0x048 SizeOfStackReserve : Uint8B<br>
   +0x050 SizeOfStackCommit : Uint8B<br>
   +0x058 SizeOfHeapReserve : Uint8B<br>
   +0x060 SizeOfHeapCommit : Uint8B<br>
   +0x068 LoaderFlags      : Uint4B<br>
   +0x06c NumberOfRvaAndSizes : Uint4B<br>
   +0x070 DataDirectory    : [16] <a href="./_IMAGE_DATA_DIRECTORY.html">_IMAGE_DATA_DIRECTORY</a><br>
</font></body></html>