<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_MMPTE_SOFTWARE</h2>
<font face="arial">   +0x000 Valid            : Pos 0, 1 Bit<br>
   +0x000 PageFileReserved : Pos 1, 1 Bit<br>
   +0x000 PageFileAllocated : Pos 2, 1 Bit<br>
   +0x000 ColdPage         : Pos 3, 1 Bit<br>
   +0x000 SwizzleBit       : Pos 4, 1 Bit<br>
   +0x000 Protection       : Pos 5, 5 Bits<br>
   +0x000 Prototype        : Pos 10, 1 Bit<br>
   +0x000 Transition       : Pos 11, 1 Bit<br>
   +0x000 PageFileLow      : Pos 12, 4 Bits<br>
   +0x000 UsedPageTableEntries : Pos 16, 10 Bits<br>
   +0x000 ShadowStack      : Pos 26, 1 Bit<br>
   +0x000 Unused           : Pos 27, 5 Bits<br>
   +0x000 PageFileHigh     : Pos 32, 32 Bits<br>
</font></body></html>