<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_PRIVATE_CACHE_MAP</h2>
<font face="arial">   +0x000 NodeTypeCode     : Int2B<br>
   +0x000 Flags            : <a href="./_PRIVATE_CACHE_MAP_FLAGS.html">_PRIVATE_CACHE_MAP_FLAGS</a><br>
   +0x004 ReadAheadMask    : Uint4B<br>
   +0x008 FileObject       : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x010 FileOffset1      : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 BeyondLastByte1  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x020 FileOffset2      : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x028 BeyondLastByte2  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x030 SequentialReadCount : Uint4B<br>
   +0x034 ReadAheadLength  : Uint4B<br>
   +0x038 ReadAheadOffset  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x040 ReadAheadBeyondLastByte : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x048 PrevReadAheadBeyondLastByte : Uint8B<br>
   +0x050 ReadAheadSpinLock : Uint8B<br>
   +0x058 PipelinedReadAheadRequestSize : Uint4B<br>
   +0x05c ReadAheadGrowth  : Uint4B<br>
   +0x060 PrivateLinks     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x070 ReadAheadWorkItem : Ptr64 Void<br>
</font></body></html>