<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_SECTION_IMAGE_INFORMATION</h2>
<font face="arial">   +0x000 TransferAddress  : Ptr64 Void<br>
   +0x008 ZeroBits         : Uint4B<br>
   +0x010 MaximumStackSize : Uint8B<br>
   +0x018 CommittedStackSize : Uint8B<br>
   +0x020 SubSystemType    : Uint4B<br>
   +0x024 SubSystemMinorVersion : Uint2B<br>
   +0x026 SubSystemMajorVersion : Uint2B<br>
   +0x024 SubSystemVersion : Uint4B<br>
   +0x028 MajorOperatingSystemVersion : Uint2B<br>
   +0x02a MinorOperatingSystemVersion : Uint2B<br>
   +0x028 OperatingSystemVersion : Uint4B<br>
   +0x02c ImageCharacteristics : Uint2B<br>
   +0x02e DllCharacteristics : Uint2B<br>
   +0x030 Machine          : Uint2B<br>
   +0x032 ImageContainsCode : UChar<br>
   +0x033 ImageFlags       : UChar<br>
   +0x033 ComPlusNativeReady : Pos 0, 1 Bit<br>
   +0x033 ComPlusILOnly    : Pos 1, 1 Bit<br>
   +0x033 ImageDynamicallyRelocated : Pos 2, 1 Bit<br>
   +0x033 ImageMappedFlat  : Pos 3, 1 Bit<br>
   +0x033 BaseBelow4gb     : Pos 4, 1 Bit<br>
   +0x033 ComPlusPrefer32bit : Pos 5, 1 Bit<br>
   +0x033 Reserved         : Pos 6, 2 Bits<br>
   +0x034 LoaderFlags      : Uint4B<br>
   +0x038 ImageFileSize    : Uint4B<br>
   +0x03c CheckSum         : Uint4B<br>
</font></body></html>