<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>_X86_KTRAP_FRAME</h2>
<font face="arial">   +0x000 DbgEbp           : Uint4B<br>
   +0x004 DbgEip           : Uint4B<br>
   +0x008 DbgArgMark       : Uint4B<br>
   +0x00c DbgArgPointer    : Uint4B<br>
   +0x010 TempSegCs        : Uint4B<br>
   +0x014 TempEsp          : Uint4B<br>
   +0x018 Dr0              : Uint4B<br>
   +0x01c Dr1              : Uint4B<br>
   +0x020 Dr2              : Uint4B<br>
   +0x024 Dr3              : Uint4B<br>
   +0x028 Dr6              : Uint4B<br>
   +0x02c Dr7              : Uint4B<br>
   +0x030 SegGs            : Uint4B<br>
   +0x034 SegEs            : Uint4B<br>
   +0x038 SegDs            : Uint4B<br>
   +0x03c Edx              : Uint4B<br>
   +0x040 Ecx              : Uint4B<br>
   +0x044 Eax              : Uint4B<br>
   +0x048 PreviousPreviousMode : UChar<br>
   +0x049 EntropyQueueDpc  : UChar<br>
   +0x04a Reserved         : [2] UChar<br>
   +0x04c ExceptionList    : Uint4B<br>
   +0x050 SegFs            : Uint4B<br>
   +0x054 Edi              : Uint4B<br>
   +0x058 Esi              : Uint4B<br>
   +0x05c Ebx              : Uint4B<br>
   +0x060 Ebp              : Uint4B<br>
   +0x064 ErrCode          : Uint4B<br>
   +0x068 Eip              : Uint4B<br>
   +0x06c SegCs            : Uint4B<br>
   +0x070 EFlags           : Uint4B<br>
   +0x074 HardwareEsp      : Uint4B<br>
   +0x078 HardwareSegSs    : Uint4B<br>
   +0x07c V86Es            : Uint4B<br>
   +0x080 V86Ds            : Uint4B<br>
   +0x084 V86Fs            : Uint4B<br>
   +0x088 V86Gs            : Uint4B<br>
</font></body></html>