<html><body>
<h4>Windows 10 x64 (18362.116)</h4><br>
<h2>HAL_PRIVATE_DISPATCH</h2>
<font face="arial">   +0x000 Version          : Uint4B<br>
   +0x008 HalHandlerForBus : Ptr64     _<a href="./_BUS_HANDLER.html">_BUS_HANDLER</a><br>
   +0x010 HalHandlerForConfigSpace : Ptr64     _<a href="./_BUS_HANDLER.html">_BUS_HANDLER</a><br>
   +0x018 HalLocateHiberRanges : Ptr64     void <br>
   +0x020 HalRegisterBusHandler : Ptr64     long <br>
   +0x028 HalSetWakeEnable : Ptr64     void <br>
   +0x030 HalSetWakeAlarm  : Ptr64     long <br>
   +0x038 HalPciTranslateBusAddress : Ptr64     unsigned char <br>
   +0x040 HalPciAssignSlotResources : Ptr64     long <br>
   +0x048 HalHaltSystem    : Ptr64     void <br>
   +0x050 HalFindBusAddressTranslation : Ptr64     unsigned char <br>
   +0x058 HalResetDisplay  : Ptr64     unsigned char <br>
   +0x060 HalAllocateMapRegisters : Ptr64     long <br>
   +0x068 KdSetupPciDeviceForDebugging : Ptr64     long <br>
   +0x070 KdReleasePciDeviceForDebugging : Ptr64     long <br>
   +0x078 KdGetAcpiTablePhase0 : Ptr64     void* <br>
   +0x080 KdCheckPowerButton : Ptr64     void <br>
   +0x088 HalVectorToIDTEntry : Ptr64     unsigned char <br>
   +0x090 KdMapPhysicalMemory64 : Ptr64     void* <br>
   +0x098 KdUnmapVirtualAddress : Ptr64     void <br>
   +0x0a0 KdGetPciDataByOffset : Ptr64     unsigned long <br>
   +0x0a8 KdSetPciDataByOffset : Ptr64     unsigned long <br>
   +0x0b0 HalGetInterruptVectorOverride : Ptr64     unsigned long <br>
   +0x0b8 HalGetVectorInputOverride : Ptr64     long <br>
   +0x0c0 HalLoadMicrocode : Ptr64     long <br>
   +0x0c8 HalUnloadMicrocode : Ptr64     long <br>
   +0x0d0 HalPostMicrocodeUpdate : Ptr64     long <br>
   +0x0d8 HalAllocateMessageTargetOverride : Ptr64     long <br>
   +0x0e0 HalFreeMessageTargetOverride : Ptr64     void <br>
   +0x0e8 HalDpReplaceBegin : Ptr64     long <br>
   +0x0f0 HalDpReplaceTarget : Ptr64     void <br>
   +0x0f8 HalDpReplaceControl : Ptr64     long <br>
   +0x100 HalDpReplaceEnd  : Ptr64     void <br>
   +0x108 HalPrepareForBugcheck : Ptr64     void <br>
   +0x110 HalQueryWakeTime : Ptr64     unsigned char <br>
   +0x118 HalReportIdleStateUsage : Ptr64     void <br>
   +0x120 HalTscSynchronization : Ptr64     void <br>
   +0x128 HalWheaInitProcessorGenericSection : Ptr64     long <br>
   +0x130 HalStopLegacyUsbInterrupts : Ptr64     void <br>
   +0x138 HalReadWheaPhysicalMemory : Ptr64     long <br>
   +0x140 HalWriteWheaPhysicalMemory : Ptr64     long <br>
   +0x148 HalDpMaskLevelTriggeredInterrupts : Ptr64     long <br>
   +0x150 HalDpUnmaskLevelTriggeredInterrupts : Ptr64     long <br>
   +0x158 HalDpGetInterruptReplayState : Ptr64     long <br>
   +0x160 HalDpReplayInterrupts : Ptr64     long <br>
   +0x168 HalQueryIoPortAccessSupported : Ptr64     unsigned char <br>
   +0x170 KdSetupIntegratedDeviceForDebugging : Ptr64     long <br>
   +0x178 KdReleaseIntegratedDeviceForDebugging : Ptr64     long <br>
   +0x180 HalGetEnlightenmentInformation : Ptr64     void <br>
   +0x188 HalAllocateEarlyPages : Ptr64     void* <br>
   +0x190 HalMapEarlyPages : Ptr64     void* <br>
   +0x198 Dummy1           : Ptr64 Void<br>
   +0x1a0 Dummy2           : Ptr64 Void<br>
   +0x1a8 HalNotifyProcessorFreeze : Ptr64     void <br>
   +0x1b0 HalPrepareProcessorForIdle : Ptr64     long <br>
   +0x1b8 HalRegisterLogRoutine : Ptr64     void <br>
   +0x1c0 HalResumeProcessorFromIdle : Ptr64     void <br>
   +0x1c8 Dummy            : Ptr64 Void<br>
   +0x1d0 HalVectorToIDTEntryEx : Ptr64     unsigned long <br>
   +0x1d8 HalSecondaryInterruptQueryPrimaryInformation : Ptr64     long <br>
   +0x1e0 HalMaskInterrupt : Ptr64     long <br>
   +0x1e8 HalUnmaskInterrupt : Ptr64     long <br>
   +0x1f0 HalIsInterruptTypeSecondary : Ptr64     unsigned char <br>
   +0x1f8 HalAllocateGsivForSecondaryInterrupt : Ptr64     long <br>
   +0x200 HalAddInterruptRemapping : Ptr64     long <br>
   +0x208 HalRemoveInterruptRemapping : Ptr64     void <br>
   +0x210 HalSaveAndDisableHvEnlightenment : Ptr64     void <br>
   +0x218 HalRestoreHvEnlightenment : Ptr64     void <br>
   +0x220 HalFlushIoBuffersExternalCache : Ptr64     void <br>
   +0x228 HalFlushExternalCache : Ptr64     void <br>
   +0x230 HalPciEarlyRestore : Ptr64     long <br>
   +0x238 HalGetProcessorId : Ptr64     long <br>
   +0x240 HalAllocatePmcCounterSet : Ptr64     long <br>
   +0x248 HalCollectPmcCounters : Ptr64     void <br>
   +0x250 HalFreePmcCounterSet : Ptr64     void <br>
   +0x258 HalProcessorHalt : Ptr64     long <br>
   +0x260 HalTimerQueryCycleCounter : Ptr64     unsigned int64 <br>
   +0x268 Dummy3           : Ptr64 Void<br>
   +0x270 HalPciMarkHiberPhase : Ptr64     void <br>
   +0x278 HalQueryProcessorRestartEntryPoint : Ptr64     long <br>
   +0x280 HalRequestInterrupt : Ptr64     long <br>
   +0x288 HalEnumerateUnmaskedInterrupts : Ptr64     long <br>
   +0x290 HalFlushAndInvalidatePageExternalCache : Ptr64     void <br>
   +0x298 KdEnumerateDebuggingDevices : Ptr64     long <br>
   +0x2a0 HalFlushIoRectangleExternalCache : Ptr64     void <br>
   +0x2a8 HalPowerEarlyRestore : Ptr64     void <br>
   +0x2b0 HalQueryCapsuleCapabilities : Ptr64     long <br>
   +0x2b8 HalUpdateCapsule : Ptr64     long <br>
   +0x2c0 HalPciMultiStageResumeCapable : Ptr64     unsigned char <br>
   +0x2c8 HalDmaFreeCrashDumpRegisters : Ptr64     void <br>
   +0x2d0 HalAcpiAoacCapable : Ptr64     unsigned char <br>
   +0x2d8 HalInterruptSetDestination : Ptr64     long <br>
   +0x2e0 HalGetClockConfiguration : Ptr64     void <br>
   +0x2e8 HalClockTimerActivate : Ptr64     void <br>
   +0x2f0 HalClockTimerInitialize : Ptr64     void <br>
   +0x2f8 HalClockTimerStop : Ptr64     void <br>
   +0x300 HalClockTimerArm : Ptr64     long <br>
   +0x308 HalTimerOnlyClockInterruptPending : Ptr64     unsigned char <br>
   +0x310 HalAcpiGetMultiNode : Ptr64     void* <br>
   +0x318 HalPowerSetRebootHandler : Ptr64     <<a href="./<function>.html"><function></a><br>
   +0x320 HalIommuRegisterDispatchTable : Ptr64     void <br>
   +0x328 HalTimerWatchdogStart : Ptr64     void <br>
   +0x330 HalTimerWatchdogResetCountdown : Ptr64     void <br>
   +0x338 HalTimerWatchdogStop : Ptr64     void <br>
   +0x340 HalTimerWatchdogGeneratedLastReset : Ptr64     unsigned char <br>
   +0x348 HalTimerWatchdogTriggerSystemReset : Ptr64     long <br>
   +0x350 HalInterruptVectorDataToGsiv : Ptr64     long <br>
   +0x358 HalInterruptGetHighestPriorityInterrupt : Ptr64     long <br>
   +0x360 HalProcessorOn   : Ptr64     long <br>
   +0x368 HalProcessorOff  : Ptr64     long <br>
   +0x370 HalProcessorFreeze : Ptr64     long <br>
   +0x378 HalDmaLinkDeviceObjectByToken : Ptr64     long <br>
   +0x380 HalDmaCheckAdapterToken : Ptr64     long <br>
   +0x388 Dummy4           : Ptr64 Void<br>
   +0x390 HalTimerConvertPerformanceCounterToAuxiliaryCounter : Ptr64     long <br>
   +0x398 HalTimerConvertAuxiliaryCounterToPerformanceCounter : Ptr64     long <br>
   +0x3a0 HalTimerQueryAuxiliaryCounterFrequency : Ptr64     long <br>
   +0x3a8 HalConnectThermalInterrupt : Ptr64     long <br>
   +0x3b0 HalIsEFIRuntimeActive : Ptr64     unsigned char <br>
   +0x3b8 HalTimerQueryAndResetRtcErrors : Ptr64     unsigned char <br>
   +0x3c0 HalAcpiLateRestore : Ptr64     void <br>
   +0x3c8 KdWatchdogDelayExpiration : Ptr64     long <br>
   +0x3d0 HalGetProcessorStats : Ptr64     long <br>
   +0x3d8 HalTimerWatchdogQueryDueTime : Ptr64     unsigned int64 <br>
   +0x3e0 HalConnectSyntheticInterrupt : Ptr64     long <br>
   +0x3e8 HalPreprocessNmi : Ptr64     void <br>
   +0x3f0 HalEnumerateEnvironmentVariablesWithFilter : Ptr64     long <br>
   +0x3f8 HalCaptureLastBranchRecordStack : Ptr64     long <br>
   +0x400 HalClearLastBranchRecordStack : Ptr64     unsigned char <br>
   +0x408 HalConfigureLastBranchRecord : Ptr64     long <br>
   +0x410 HalGetLastBranchInformation : Ptr64     unsigned char <br>
   +0x418 HalResumeLastBranchRecord : Ptr64     void <br>
   +0x420 HalStartLastBranchRecord : Ptr64     long <br>
   +0x428 HalStopLastBranchRecord : Ptr64     long <br>
   +0x430 HalIommuBlockDevice : Ptr64     long <br>
   +0x438 HalIommuUnblockDevice : Ptr64     long <br>
   +0x440 HalGetIommuInterface : Ptr64     long <br>
   +0x448 HalRequestGenericErrorRecovery : Ptr64     long <br>
   +0x450 HalTimerQueryHostPerformanceCounter : Ptr64     long <br>
   +0x458 HalTopologyQueryProcessorRelationships : Ptr64     long <br>
   +0x460 HalInitPlatformDebugTriggers : Ptr64     void <br>
   +0x468 HalRunPlatformDebugTriggers : Ptr64     void <br>
   +0x470 HalTimerGetReferencePage : Ptr64     void* <br>
   +0x478 HalGetHiddenProcessorPowerInterface : Ptr64     long <br>
   +0x480 HalGetHiddenProcessorPackageId : Ptr64     unsigned long <br>
   +0x488 HalGetHiddenPackageProcessorCount : Ptr64     unsigned long <br>
   +0x490 HalGetHiddenProcessorApicIdByIndex : Ptr64     long <br>
   +0x498 HalRegisterHiddenProcessorIdleState : Ptr64     long <br>
</font></body></html>