<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_DISPATCHER_HEADER</h2>
<font face="arial">   +0x000 Lock             : Int4B<br>
   +0x000 LockNV           : Int4B<br>
   +0x000 Type             : UChar<br>
   +0x001 Signalling       : UChar<br>
   +0x002 Size             : UChar<br>
   +0x003 Reserved1        : UChar<br>
   +0x000 TimerType        : UChar<br>
   +0x001 TimerControlFlags : UChar<br>
   +0x001 Absolute         : Pos 0, 1 Bit<br>
   +0x001 Wake             : Pos 1, 1 Bit<br>
   +0x001 EncodedTolerableDelay : Pos 2, 6 Bits<br>
   +0x002 Hand             : UChar<br>
   +0x003 TimerMiscFlags   : UChar<br>
   +0x003 Index            : Pos 0, 6 Bits<br>
   +0x003 Inserted         : Pos 6, 1 Bit<br>
   +0x003 Expired          : Pos 7, 1 Bit<br>
   +0x000 Timer2Type       : UChar<br>
   +0x001 Timer2Flags      : UChar<br>
   +0x001 Timer2Inserted   : Pos 0, 1 Bit<br>
   +0x001 Timer2Expiring   : Pos 1, 1 Bit<br>
   +0x001 Timer2CancelPending : Pos 2, 1 Bit<br>
   +0x001 Timer2SetPending : Pos 3, 1 Bit<br>
   +0x001 Timer2Running    : Pos 4, 1 Bit<br>
   +0x001 Timer2Disabled   : Pos 5, 1 Bit<br>
   +0x001 Timer2ReservedFlags : Pos 6, 2 Bits<br>
   +0x002 Timer2ComponentId : UChar<br>
   +0x003 Timer2RelativeId : UChar<br>
   +0x000 QueueType        : UChar<br>
   +0x001 QueueControlFlags : UChar<br>
   +0x001 Abandoned        : Pos 0, 1 Bit<br>
   +0x001 DisableIncrement : Pos 1, 1 Bit<br>
   +0x001 QueueReservedControlFlags : Pos 2, 6 Bits<br>
   +0x002 QueueSize        : UChar<br>
   +0x003 QueueReserved    : UChar<br>
   +0x000 ThreadType       : UChar<br>
   +0x001 ThreadReserved   : UChar<br>
   +0x002 ThreadControlFlags : UChar<br>
   +0x002 CycleProfiling   : Pos 0, 1 Bit<br>
   +0x002 CounterProfiling : Pos 1, 1 Bit<br>
   +0x002 GroupScheduling  : Pos 2, 1 Bit<br>
   +0x002 AffinitySet      : Pos 3, 1 Bit<br>
   +0x002 Tagged           : Pos 4, 1 Bit<br>
   +0x002 EnergyProfiling  : Pos 5, 1 Bit<br>
   +0x002 SchedulerAssist  : Pos 6, 1 Bit<br>
   +0x002 ThreadReservedControlFlags : Pos 7, 1 Bit<br>
   +0x003 DebugActive      : UChar<br>
   +0x003 ActiveDR7        : Pos 0, 1 Bit<br>
   +0x003 Instrumented     : Pos 1, 1 Bit<br>
   +0x003 Minimal          : Pos 2, 1 Bit<br>
   +0x003 Reserved4        : Pos 3, 2 Bits<br>
   +0x003 AltSyscall       : Pos 5, 1 Bit<br>
   +0x003 UmsScheduled     : Pos 6, 1 Bit<br>
   +0x003 UmsPrimary       : Pos 7, 1 Bit<br>
   +0x000 MutantType       : UChar<br>
   +0x001 MutantSize       : UChar<br>
   +0x002 DpcActive        : UChar<br>
   +0x003 MutantReserved   : UChar<br>
   +0x004 SignalState      : Int4B<br>
   +0x008 WaitListHead     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
</font></body></html>