<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_ETHREAD</h2>
<font face="arial">   +0x000 Tcb              : <a href="./_KTHREAD.html">_KTHREAD</a><br>
   +0x430 CreateTime       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x438 ExitTime         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x438 KeyedWaitChain   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x448 PostBlockList    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x448 ForwardLinkShadow : Ptr64 Void<br>
   +0x450 StartAddress     : Ptr64 Void<br>
   +0x458 TerminationPort  : Ptr64 <a href="./_TERMINATION_PORT.html">_TERMINATION_PORT</a><br>
   +0x458 ReaperLink       : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x458 KeyedWaitValue   : Ptr64 Void<br>
   +0x460 ActiveTimerListLock : Uint8B<br>
   +0x468 ActiveTimerListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x478 Cid              : <a href="./_CLIENT_ID.html">_CLIENT_ID</a><br>
   +0x488 KeyedWaitSemaphore : <a href="./_KSEMAPHORE.html">_KSEMAPHORE</a><br>
   +0x488 AlpcWaitSemaphore : <a href="./_KSEMAPHORE.html">_KSEMAPHORE</a><br>
   +0x4a8 ClientSecurity   : <a href="./_PS_CLIENT_SECURITY_CONTEXT.html">_PS_CLIENT_SECURITY_CONTEXT</a><br>
   +0x4b0 IrpList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x4c0 TopLevelIrp      : Uint8B<br>
   +0x4c8 DeviceToVerify   : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x4d0 Win32StartAddress : Ptr64 Void<br>
   +0x4d8 ChargeOnlySession : Ptr64 Void<br>
   +0x4e0 LegacyPowerObject : Ptr64 Void<br>
   +0x4e8 ThreadListEntry  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x4f8 RundownProtect   : <a href="./_EX_RUNDOWN_REF.html">_EX_RUNDOWN_REF</a><br>
   +0x500 ThreadLock       : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x508 ReadClusterSize  : Uint4B<br>
   +0x50c MmLockOrdering   : Int4B<br>
   +0x510 CrossThreadFlags : Uint4B<br>
   +0x510 Terminated       : Pos 0, 1 Bit<br>
   +0x510 ThreadInserted   : Pos 1, 1 Bit<br>
   +0x510 HideFromDebugger : Pos 2, 1 Bit<br>
   +0x510 ActiveImpersonationInfo : Pos 3, 1 Bit<br>
   +0x510 HardErrorsAreDisabled : Pos 4, 1 Bit<br>
   +0x510 BreakOnTermination : Pos 5, 1 Bit<br>
   +0x510 SkipCreationMsg  : Pos 6, 1 Bit<br>
   +0x510 SkipTerminationMsg : Pos 7, 1 Bit<br>
   +0x510 CopyTokenOnOpen  : Pos 8, 1 Bit<br>
   +0x510 ThreadIoPriority : Pos 9, 3 Bits<br>
   +0x510 ThreadPagePriority : Pos 12, 3 Bits<br>
   +0x510 RundownFail      : Pos 15, 1 Bit<br>
   +0x510 UmsForceQueueTermination : Pos 16, 1 Bit<br>
   +0x510 IndirectCpuSets  : Pos 17, 1 Bit<br>
   +0x510 DisableDynamicCodeOptOut : Pos 18, 1 Bit<br>
   +0x510 ExplicitCaseSensitivity : Pos 19, 1 Bit<br>
   +0x510 PicoNotifyExit   : Pos 20, 1 Bit<br>
   +0x510 DbgWerUserReportActive : Pos 21, 1 Bit<br>
   +0x510 ForcedSelfTrimActive : Pos 22, 1 Bit<br>
   +0x510 SamplingCoverage : Pos 23, 1 Bit<br>
   +0x510 ReservedCrossThreadFlags : Pos 24, 8 Bits<br>
   +0x514 SameThreadPassiveFlags : Uint4B<br>
   +0x514 ActiveExWorker   : Pos 0, 1 Bit<br>
   +0x514 MemoryMaker      : Pos 1, 1 Bit<br>
   +0x514 StoreLockThread  : Pos 2, 2 Bits<br>
   +0x514 ClonedThread     : Pos 4, 1 Bit<br>
   +0x514 KeyedEventInUse  : Pos 5, 1 Bit<br>
   +0x514 SelfTerminate    : Pos 6, 1 Bit<br>
   +0x514 RespectIoPriority : Pos 7, 1 Bit<br>
   +0x514 ActivePageLists  : Pos 8, 1 Bit<br>
   +0x514 SecureContext    : Pos 9, 1 Bit<br>
   +0x514 ZeroPageThread   : Pos 10, 1 Bit<br>
   +0x514 WorkloadClass    : Pos 11, 1 Bit<br>
   +0x514 ReservedSameThreadPassiveFlags : Pos 12, 20 Bits<br>
   +0x518 SameThreadApcFlags : Uint4B<br>
   +0x518 OwnsProcessAddressSpaceExclusive : Pos 0, 1 Bit<br>
   +0x518 OwnsProcessAddressSpaceShared : Pos 1, 1 Bit<br>
   +0x518 HardFaultBehavior : Pos 2, 1 Bit<br>
   +0x518 StartAddressInvalid : Pos 3, 1 Bit<br>
   +0x518 EtwCalloutActive : Pos 4, 1 Bit<br>
   +0x518 SuppressSymbolLoad : Pos 5, 1 Bit<br>
   +0x518 Prefetching      : Pos 6, 1 Bit<br>
   +0x518 OwnsVadExclusive : Pos 7, 1 Bit<br>
   +0x519 SystemPagePriorityActive : Pos 0, 1 Bit<br>
   +0x519 SystemPagePriority : Pos 1, 3 Bits<br>
   +0x519 AllowUserWritesToExecutableMemory : Pos 4, 1 Bit<br>
   +0x519 AllowKernelWritesToExecutableMemory : Pos 5, 1 Bit<br>
   +0x519 OwnsVadShared    : Pos 6, 1 Bit<br>
   +0x51c CacheManagerActive : UChar<br>
   +0x51d DisablePageFaultClustering : UChar<br>
   +0x51e ActiveFaultCount : UChar<br>
   +0x51f LockOrderState   : UChar<br>
   +0x520 PerformanceCountLowReserved : Uint4B<br>
   +0x524 PerformanceCountHighReserved : Int4B<br>
   +0x528 AlpcMessageId    : Uint8B<br>
   +0x530 AlpcMessage      : Ptr64 Void<br>
   +0x530 AlpcReceiveAttributeSet : Uint4B<br>
   +0x538 AlpcWaitListEntry : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x548 ExitStatus       : Int4B<br>
   +0x54c CacheManagerCount : Uint4B<br>
   +0x550 IoBoostCount     : Uint4B<br>
   +0x554 IoQoSBoostCount  : Uint4B<br>
   +0x558 IoQoSThrottleCount : Uint4B<br>
   +0x55c KernelStackReference : Uint4B<br>
   +0x560 BoostList        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x570 DeboostList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x580 BoostListLock    : Uint8B<br>
   +0x588 IrpListLock      : Uint8B<br>
   +0x590 ReservedForSynchTracking : Ptr64 Void<br>
   +0x598 CmCallbackListHead : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x5a0 ActivityId       : Ptr64 <a href="./_GUID.html">_GUID</a><br>
   +0x5a8 SeLearningModeListHead : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x5b0 VerifierContext  : Ptr64 Void<br>
   +0x5b8 AdjustedClientToken : Ptr64 Void<br>
   +0x5c0 WorkOnBehalfThread : Ptr64 Void<br>
   +0x5c8 PropertySet      : <a href="./_PS_PROPERTY_SET.html">_PS_PROPERTY_SET</a><br>
   +0x5e0 PicoContext      : Ptr64 Void<br>
   +0x5e8 UserFsBase       : Uint8B<br>
   +0x5f0 UserGsBase       : Uint8B<br>
   +0x5f8 EnergyValues     : Ptr64 <a href="./_THREAD_ENERGY_VALUES.html">_THREAD_ENERGY_VALUES</a><br>
   +0x600 SelectedCpuSets  : Uint8B<br>
   +0x600 SelectedCpuSetsIndirect : Ptr64 Uint8B<br>
   +0x608 Silo             : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x610 ThreadName       : Ptr64 <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x618 SetContextState  : Ptr64 <a href="./_CONTEXT.html">_CONTEXT</a><br>
   +0x620 LastExpectedRunTime : Uint4B<br>
   +0x624 HeapData         : Uint4B<br>
   +0x628 OwnerEntryListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x638 DisownedOwnerEntryListLock : Uint8B<br>
   +0x640 DisownedOwnerEntryListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x650 LockEntries      : [6] <a href="./_KLOCK_ENTRY.html">_KLOCK_ENTRY</a><br>
   +0x890 CmDbgInfo        : Ptr64 Void<br>
</font></body></html>