<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_HAL_INTEL_ENLIGHTENMENT_INFORMATION</h2>
<font face="arial">   +0x000 Enlightenments   : Uint4B<br>
   +0x004 HypervisorConnected : Uint4B<br>
   +0x008 EndOfInterrupt   : Ptr64     void <br>
   +0x010 ApicWriteIcr     : Ptr64     void <br>
   +0x018 Reserved0        : Uint4B<br>
   +0x01c SpinCountMask    : Uint4B<br>
   +0x020 LongSpinWait     : Ptr64     void <br>
   +0x028 GetReferenceTime : Ptr64     unsigned int64 <br>
   +0x030 SetSystemSleepProperty : Ptr64     long <br>
   +0x038 EnterSleepState  : Ptr64     long <br>
   +0x040 NotifyDebugDeviceAvailable : Ptr64     long <br>
   +0x048 MapDeviceInterrupt : Ptr64     long <br>
   +0x050 UnmapDeviceInterrupt : Ptr64     long <br>
   +0x058 RetargetDeviceInterrupt : Ptr64     long <br>
   +0x060 SetHpetConfig    : Ptr64     long <br>
   +0x068 NotifyHpetEnabled : Ptr64     long <br>
   +0x070 QueryAssociatedProcessors : Ptr64     long <br>
   +0x078 ReadMultipleMsr  : Ptr64     long <br>
   +0x080 WriteMultipleMsr : Ptr64     long <br>
   +0x088 ReadCpuid        : Ptr64     long <br>
   +0x090 LpWritebackInvalidate : Ptr64     long <br>
   +0x098 GetMachineCheckContext : Ptr64     long <br>
   +0x0a0 SuspendPartition : Ptr64     long <br>
   +0x0a8 ResumePartition  : Ptr64     long <br>
   +0x0b0 SetSystemMachineCheckProperty : Ptr64     long <br>
   +0x0b8 WheaErrorNotification : Ptr64     long <br>
   +0x0c0 GetProcessorIndexFromVpIndex : Ptr64     unsigned long <br>
   +0x0c8 SyntheticClusterIpi : Ptr64     long <br>
   +0x0d0 VpStartEnabled   : Ptr64     unsigned char <br>
   +0x0d8 StartVirtualProcessor : Ptr64     long <br>
   +0x0e0 GetVpIndexFromApicId : Ptr64     long <br>
   +0x0e8 IumAccessPciDevice : Ptr64     long <br>
   +0x0f0 IumEfiRuntimeService : Ptr64     unsigned int64 <br>
   +0x0f8 SvmGetSystemCapabilities : Ptr64     void <br>
   +0x100 SvmGetDeviceCapabilities : Ptr64     long <br>
   +0x108 SvmCreatePasidSpace : Ptr64     long <br>
   +0x110 SvmSetPasidAddressSpace : Ptr64     long <br>
   +0x118 SvmFlushPasid    : Ptr64     void <br>
   +0x120 SvmAttachPasidSpace : Ptr64     long <br>
   +0x128 SvmDetachPasidSpace : Ptr64     long <br>
   +0x130 SvmEnablePasid   : Ptr64     long <br>
   +0x138 SvmDisablePasid  : Ptr64     long <br>
   +0x140 SvmAcknowledgePageRequest : Ptr64     long <br>
   +0x148 SvmCreatePrQueue : Ptr64     long <br>
   +0x150 SvmDeletePrQueue : Ptr64     long <br>
   +0x158 SvmClearPrqStalled : Ptr64     long <br>
   +0x160 SvmSetDeviceEnabled : Ptr64     long <br>
   +0x168 HvDebuggerPowerHandler : Ptr64     long <br>
   +0x170 SetQpcBias       : Ptr64     long <br>
   +0x178 GetQpcBias       : Ptr64     unsigned int64 <br>
   +0x180 RegisterDeviceId : Ptr64     long <br>
   +0x188 UnregisterDeviceId : Ptr64     long <br>
   +0x190 AllocateDeviceDomain : Ptr64     long <br>
   +0x198 AttachDeviceDomain : Ptr64     long <br>
   +0x1a0 DetachDeviceDomain : Ptr64     long <br>
   +0x1a8 DeleteDeviceDomain : Ptr64     long <br>
   +0x1b0 MapDeviceLogicalRange : Ptr64     long <br>
   +0x1b8 UnmapDeviceLogicalRange : Ptr64     long <br>
   +0x1c0 MapDeviceSparsePages : Ptr64     long <br>
   +0x1c8 UnmapDeviceSparsePages : Ptr64     long <br>
   +0x1d0 GetDmaGuardEnabled : Ptr64     long <br>
   +0x1d8 UpdateMicrocode  : Ptr64     long <br>
   +0x1e0 GetSintMessage   : Ptr64     long <br>
   +0x1e8 SetRootFaultReportingReady : Ptr64     long <br>
</font></body></html>