<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_KALPC_MESSAGE</h2>
<font face="arial">   +0x000 Entry            : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 PortQueue        : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x018 OwnerPort        : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x020 WaitingThread    : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x028 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x02c SequenceNo       : Int4B<br>
   +0x030 QuotaProcess     : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x030 QuotaBlock       : Ptr64 Void<br>
   +0x038 CancelSequencePort : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x040 CancelQueuePort  : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x048 CancelSequenceNo : Int4B<br>
   +0x050 CancelListEntry  : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x060 Reserve          : Ptr64 <a href="./_KALPC_RESERVE.html">_KALPC_RESERVE</a><br>
   +0x068 MessageAttributes : <a href="./_KALPC_MESSAGE_ATTRIBUTES.html">_KALPC_MESSAGE_ATTRIBUTES</a><br>
   +0x0b0 DataUserVa       : Ptr64 Void<br>
   +0x0b8 CommunicationInfo : Ptr64 <a href="./_ALPC_COMMUNICATION_INFO.html">_ALPC_COMMUNICATION_INFO</a><br>
   +0x0c0 ConnectionPort   : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x0c8 ServerThread     : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x0d0 WakeReference    : Ptr64 Void<br>
   +0x0d8 WakeReference2   : Ptr64 Void<br>
   +0x0e0 ExtensionBuffer  : Ptr64 Void<br>
   +0x0e8 ExtensionBufferSize : Uint8B<br>
   +0x0f0 PortMessage      : <a href="./_PORT_MESSAGE.html">_PORT_MESSAGE</a><br>
</font></body></html>