<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_KTM</h2>
<font face="arial">   +0x000 cookie           : Uint4B<br>
   +0x008 Mutex            : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x040 State            : <a href="./KTM_STATE.html">KTM_STATE</a><br>
   +0x048 NamespaceLink    : <a href="./_KTMOBJECT_NAMESPACE_LINK.html">_KTMOBJECT_NAMESPACE_LINK</a><br>
   +0x070 TmIdentity       : <a href="./_GUID.html">_GUID</a><br>
   +0x080 Flags            : Uint4B<br>
   +0x084 VolatileFlags    : Uint4B<br>
   +0x088 LogFileName      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x098 LogFileObject    : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x0a0 MarshallingContext : Ptr64 Void<br>
   +0x0a8 LogManagementContext : Ptr64 Void<br>
   +0x0b0 Transactions     : <a href="./_KTMOBJECT_NAMESPACE.html">_KTMOBJECT_NAMESPACE</a><br>
   +0x158 ResourceManagers : <a href="./_KTMOBJECT_NAMESPACE.html">_KTMOBJECT_NAMESPACE</a><br>
   +0x200 LsnOrderedMutex  : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x238 LsnOrderedList   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x248 CommitVirtualClock : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x250 CommitVirtualClockMutex : <a href="./_FAST_MUTEX.html">_FAST_MUTEX</a><br>
   +0x288 BaseLsn          : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x290 CurrentReadLsn   : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x298 LastRecoveredLsn : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x2a0 TmRmHandle       : Ptr64 Void<br>
   +0x2a8 TmRm             : Ptr64 <a href="./_KRESOURCEMANAGER.html">_KRESOURCEMANAGER</a><br>
   +0x2b0 LogFullNotifyEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x2c8 CheckpointWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x2e8 CheckpointTargetLsn : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x2f0 LogFullCompletedWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x310 LogWriteResource : <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
   +0x378 LogFlags         : Uint4B<br>
   +0x37c LogFullStatus    : Int4B<br>
   +0x380 RecoveryStatus   : Int4B<br>
   +0x388 LastCheckBaseLsn : <a href="./_CLS_LSN.html">_CLS_LSN</a><br>
   +0x390 RestartOrderedList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x3a0 OfflineWorkItem  : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
</font></body></html>