<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_LOADER_PARAMETER_EXTENSION</h2>
<font face="arial">   +0x000 Size             : Uint4B<br>
   +0x004 Profile          : <a href="./_PROFILE_PARAMETER_BLOCK.html">_PROFILE_PARAMETER_BLOCK</a><br>
   +0x018 EmInfFileImage   : Ptr64 Void<br>
   +0x020 EmInfFileSize    : Uint4B<br>
   +0x028 TriageDumpBlock  : Ptr64 Void<br>
   +0x030 HeadlessLoaderBlock : Ptr64 <a href="./_HEADLESS_LOADER_BLOCK.html">_HEADLESS_LOADER_BLOCK</a><br>
   +0x038 SMBiosEPSHeader  : Ptr64 <a href="./_SMBIOS3_TABLE_HEADER.html">_SMBIOS3_TABLE_HEADER</a><br>
   +0x040 DrvDBImage       : Ptr64 Void<br>
   +0x048 DrvDBSize        : Uint4B<br>
   +0x050 DrvDBPatchImage  : Ptr64 Void<br>
   +0x058 DrvDBPatchSize   : Uint4B<br>
   +0x060 NetworkLoaderBlock : Ptr64 <a href="./_NETWORK_LOADER_BLOCK.html">_NETWORK_LOADER_BLOCK</a><br>
   +0x068 FirmwareDescriptorListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x078 AcpiTable        : Ptr64 Void<br>
   +0x080 AcpiTableSize    : Uint4B<br>
   +0x084 LastBootSucceeded : Pos 0, 1 Bit<br>
   +0x084 LastBootShutdown : Pos 1, 1 Bit<br>
   +0x084 IoPortAccessSupported : Pos 2, 1 Bit<br>
   +0x084 BootDebuggerActive : Pos 3, 1 Bit<br>
   +0x084 StrongCodeGuarantees : Pos 4, 1 Bit<br>
   +0x084 HardStrongCodeGuarantees : Pos 5, 1 Bit<br>
   +0x084 SidSharingDisabled : Pos 6, 1 Bit<br>
   +0x084 TpmInitialized   : Pos 7, 1 Bit<br>
   +0x084 VsmConfigured    : Pos 8, 1 Bit<br>
   +0x084 IumEnabled       : Pos 9, 1 Bit<br>
   +0x084 IsSmbboot        : Pos 10, 1 Bit<br>
   +0x084 BootLogEnabled   : Pos 11, 1 Bit<br>
   +0x084 DriverVerifierEnabled : Pos 12, 1 Bit<br>
   +0x084 SuppressMonitorX : Pos 13, 1 Bit<br>
   +0x084 KernelCetEnabled : Pos 14, 1 Bit<br>
   +0x084 SuppressSmap     : Pos 15, 1 Bit<br>
   +0x084 Unused           : Pos 16, 5 Bits<br>
   +0x084 FeatureSimulations : Pos 21, 6 Bits<br>
   +0x084 MicrocodeSelfHosting : Pos 27, 1 Bit<br>
   +0x084 XhciLegacyHandoffSkip : Pos 28, 1 Bit<br>
   +0x084 DisableInsiderOptInHVCI : Pos 29, 1 Bit<br>
   +0x084 MicrocodeMinVerSupported : Pos 30, 1 Bit<br>
   +0x084 GpuIommuEnabled  : Pos 31, 1 Bit<br>
   +0x088 LoaderPerformanceData : <a href="./_LOADER_PERFORMANCE_DATA.html">_LOADER_PERFORMANCE_DATA</a><br>
   +0x0e8 BootApplicationPersistentData : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0f8 WmdTestResult    : Ptr64 Void<br>
   +0x100 BootIdentifier   : <a href="./_GUID.html">_GUID</a><br>
   +0x110 ResumePages      : Uint4B<br>
   +0x118 DumpHeader       : Ptr64 Void<br>
   +0x120 BgContext        : Ptr64 Void<br>
   +0x128 NumaLocalityInfo : Ptr64 Void<br>
   +0x130 NumaGroupAssignment : Ptr64 Void<br>
   +0x138 AttachedHives    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x148 MemoryCachingRequirementsCount : Uint4B<br>
   +0x150 MemoryCachingRequirements : Ptr64 Void<br>
   +0x158 BootEntropyResult : <a href="./_BOOT_ENTROPY_LDR_RESULT.html">_BOOT_ENTROPY_LDR_RESULT</a><br>
   +0x9c0 ProcessorCounterFrequency : Uint8B<br>
   +0x9c8 HypervisorExtension : <a href="./_LOADER_PARAMETER_HYPERVISOR_EXTENSION.html">_LOADER_PARAMETER_HYPERVISOR_EXTENSION</a><br>
   +0xa08 HardwareConfigurationId : <a href="./_GUID.html">_GUID</a><br>
   +0xa18 HalExtensionModuleList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0xa28 SystemTime       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0xa30 TimeStampAtSystemTimeRead : Uint8B<br>
   +0xa38 BootFlags        : Uint8B<br>
   +0xa38 DbgMenuOsSelection : Pos 0, 1 Bit<br>
   +0xa38 DbgHiberBoot     : Pos 1, 1 Bit<br>
   +0xa38 DbgSoftRestart   : Pos 2, 1 Bit<br>
   +0xa38 DbgMeasuredLaunch : Pos 3, 1 Bit<br>
   +0xa40 InternalBootFlags : Uint8B<br>
   +0xa40 DbgUtcBootTime   : Pos 0, 1 Bit<br>
   +0xa40 DbgRtcBootTime   : Pos 1, 1 Bit<br>
   +0xa40 DbgNoLegacyServices : Pos 2, 1 Bit<br>
   +0xa48 WfsFPData        : Ptr64 Void<br>
   +0xa50 WfsFPDataSize    : Uint4B<br>
   +0xa58 BugcheckParameters : <a href="./_LOADER_BUGCHECK_PARAMETERS.html">_LOADER_BUGCHECK_PARAMETERS</a><br>
   +0xa80 ApiSetSchema     : Ptr64 Void<br>
   +0xa88 ApiSetSchemaSize : Uint4B<br>
   +0xa90 ApiSetSchemaExtensions : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0xaa0 AcpiBiosVersion  : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0xab0 SmbiosVersion    : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0xac0 EfiVersion       : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0xad0 KdDebugDevice    : Ptr64 <a href="./_DEBUG_DEVICE_DESCRIPTOR.html">_DEBUG_DEVICE_DESCRIPTOR</a><br>
   +0xad8 OfflineCrashdumpConfigurationTable : <a href="./_OFFLINE_CRASHDUMP_CONFIGURATION_TABLE_V2.html">_OFFLINE_CRASHDUMP_CONFIGURATION_TABLE_V2</a><br>
   +0xaf8 ManufacturingProfile : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0xb08 BbtBuffer        : Ptr64 Void<br>
   +0xb10 XsaveAllowedFeatures : Uint8B<br>
   +0xb18 XsaveFlags       : Uint4B<br>
   +0xb20 BootOptions      : Ptr64 Void<br>
   +0xb28 IumEnablement    : Uint4B<br>
   +0xb2c IumPolicy        : Uint4B<br>
   +0xb30 IumStatus        : Int4B<br>
   +0xb34 BootId           : Uint4B<br>
   +0xb38 CodeIntegrityData : Ptr64 <a href="./_LOADER_PARAMETER_CI_EXTENSION.html">_LOADER_PARAMETER_CI_EXTENSION</a><br>
   +0xb40 CodeIntegrityDataSize : Uint4B<br>
   +0xb44 SystemHiveRecoveryInfo : <a href="./_LOADER_HIVE_RECOVERY_INFO.html">_LOADER_HIVE_RECOVERY_INFO</a><br>
   +0xb58 SoftRestartCount : Uint4B<br>
   +0xb60 SoftRestartTime  : Int8B<br>
   +0xb68 HypercallCodeVa  : Ptr64 Void<br>
   +0xb70 HalVirtualAddress : Ptr64 Void<br>
   +0xb78 HalNumberOfBytes : Uint8B<br>
   +0xb80 LeapSecondData   : Ptr64 <a href="./_LEAP_SECOND_DATA.html">_LEAP_SECOND_DATA</a><br>
   +0xb88 MajorRelease     : Uint4B<br>
   +0xb8c Reserved1        : Uint4B<br>
   +0xb90 NtBuildLab       : [224] Char<br>
   +0xc70 NtBuildLabEx     : [224] Char<br>
   +0xd50 ResetReason      : <a href="./_LOADER_RESET_REASON.html">_LOADER_RESET_REASON</a><br>
   +0xd80 MaxPciBusNumber  : Uint4B<br>
   +0xd84 FeatureSettings  : Uint4B<br>
   +0xd88 HotPatchReserveSize : Uint4B<br>
   +0xd8c RetpolineReserveSize : Uint4B<br>
   +0xd90 MiniExecutive    : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0xda0 VsmPerformanceData : <a href="./_VSM_PERFORMANCE_DATA.html">_VSM_PERFORMANCE_DATA</a><br>
   +0xde0 NumaMemoryRanges : Ptr64 <a href="./_NUMA_MEMORY_RANGE.html">_NUMA_MEMORY_RANGE</a><br>
   +0xde8 NumaMemoryRangeCount : Uint4B<br>
   +0xdec IommuFaultPolicy : Uint4B<br>
</font></body></html>