<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_MI_SYSTEM_VA_STATE</h2>
<font face="arial">   +0x000 SystemTablesLock : Uint8B<br>
   +0x008 AvailableSystemCacheVa : Uint8B<br>
   +0x010 DynamicBitMapKernelStacks : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x058 DynamicBitMapSystemPtes : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x0a0 DynamicBitMapDriverImages : [2] <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x130 DynamicBitMapPagedPool : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x178 DynamicBitMapSystemCache : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x1c0 DynamicBitMapSecureNonPagedPool : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x208 HalPrivateVaStart : Ptr64 Void<br>
   +0x210 HalPrivateVaSize : Uint8B<br>
   +0x218 SystemVaAssignment : [8] Uint4B<br>
   +0x238 SystemVaAssignmentHint : Uint4B<br>
   +0x23c TopLevelPteLockBits : [32] Uint4B<br>
   +0x2bc DeleteKvaLock    : Int4B<br>
   +0x2c0 WsleArrays       : [8] Ptr64 <a href="./_MI_WSLE.html">_MI_WSLE</a><br>
   +0x300 PagableHyperSpace : Ptr64 Void<br>
   +0x308 HyperSpaceEnd    : Ptr64 Void<br>
   +0x310 PagableHyperSpaceBytes : Uint8B<br>
   +0x318 PageTableCommitmentOffset : [2] Uint8B<br>
   +0x328 FreeSystemCacheVa : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x340 SystemVaLock     : Uint8B<br>
   +0x348 SystemCacheViewLock : Uint8B<br>
   +0x350 SystemWorkingSetList : [8] <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x490 SelfmapLock      : [4] Uint8B<br>
</font></body></html>