<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_MI_HARDWARE_STATE</h2>
<font face="arial">   +0x000 NodeMask         : Uint4B<br>
   +0x004 NumaHintIndex    : Uint4B<br>
   +0x008 NumaLastRangeIndexInclusive : Uint4B<br>
   +0x00c NodeShift        : UChar<br>
   +0x00d ChannelShift     : UChar<br>
   +0x010 ChannelHintIndex : Uint4B<br>
   +0x014 ChannelLastRangeIndexInclusive : Uint4B<br>
   +0x018 NodeGraph        : Ptr64 <a href="./_MI_NODE_NUMBER_ZERO_BASED.html">_MI_NODE_NUMBER_ZERO_BASED</a><br>
   +0x020 SystemNodeInformation : Ptr64 <a href="./_MI_SYSTEM_NODE_INFORMATION.html">_MI_SYSTEM_NODE_INFORMATION</a><br>
   +0x028 TemporaryNumaRanges : [2] <a href="./_HAL_NODE_RANGE.html">_HAL_NODE_RANGE</a><br>
   +0x048 NumaMemoryRanges : Ptr64 <a href="./_HAL_NODE_RANGE.html">_HAL_NODE_RANGE</a><br>
   +0x050 ChannelMemoryRanges : Ptr64 <a href="./_HAL_CHANNEL_MEMORY_RANGES.html">_HAL_CHANNEL_MEMORY_RANGES</a><br>
   +0x058 SecondLevelCacheSize : Uint4B<br>
   +0x05c FirstLevelCacheSize : Uint4B<br>
   +0x060 PhysicalAddressBits : Uint4B<br>
   +0x064 LogicalProcessorsPerCore : Uint4B<br>
   +0x068 ProcessorCachesFlushedOnPowerLoss : UChar<br>
   +0x070 TotalPagesAllowed : Uint8B<br>
   +0x078 SecondaryColorMask : Uint4B<br>
   +0x07c SecondaryColors  : Uint4B<br>
   +0x080 FlushTbForAttributeChange : Uint4B<br>
   +0x084 FlushCacheForAttributeChange : Uint4B<br>
   +0x088 FlushCacheForPageAttributeChange : Uint4B<br>
   +0x08c CacheFlushPromoteThreshold : Uint4B<br>
   +0x090 PerformanceCounterFrequency : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x0c0 InvalidPteMask   : Uint8B<br>
   +0x100 LargePageColors  : [3] Uint4B<br>
   +0x110 FlushTbThreshold : Uint8B<br>
   +0x118 OptimalZeroingAttribute : [4] [4] <a href="./_MI_PFN_CACHE_ATTRIBUTE.html">_MI_PFN_CACHE_ATTRIBUTE</a><br>
   +0x158 AttributeChangeRequiresReZero : UChar<br>
   +0x160 ZeroCostCounts   : [2] <a href="./_MI_ZERO_COST_COUNTS.html">_MI_ZERO_COST_COUNTS</a><br>
   +0x180 VsmKernelPageCount : Uint8B<br>
</font></body></html>