<html><body>
<h4>Windows 10 x64 (19041.329)</h4><br>
<h2>_POP_FX_PERF_INFO</h2>
<font face="arial">   +0x000 Component        : Ptr64 <a href="./_POP_FX_COMPONENT.html">_POP_FX_COMPONENT</a><br>
   +0x008 CompletedEvent   : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x020 ComponentPerfState : Ptr64     void <br>
   +0x028 Flags            : <a href="./_POP_FX_PERF_FLAGS.html">_POP_FX_PERF_FLAGS</a><br>
   +0x030 LastChange       : Ptr64 <a href="./_PO_FX_PERF_STATE_CHANGE.html">_PO_FX_PERF_STATE_CHANGE</a><br>
   +0x038 LastChangeCount  : Uint4B<br>
   +0x040 LastChangeStamp  : Uint8B<br>
   +0x048 LastChangeNominal : UChar<br>
   +0x049 PepRegistered    : UChar<br>
   +0x04a QueryOnIdleStates : UChar<br>
   +0x050 RequestDriverContext : Ptr64 Void<br>
   +0x058 WorkOrder        : <a href="./_POP_FX_WORK_ORDER.html">_POP_FX_WORK_ORDER</a><br>
   +0x090 SetsCount        : Uint4B<br>
   +0x098 Sets             : Ptr64 <a href="./_POP_FX_PERF_SET.html">_POP_FX_PERF_SET</a><br>
</font></body></html>