<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_ETWP_NOTIFICATION_HEADER</h2>
<font face="arial">   +0x000 NotificationType : <a href="./_ETW_NOTIFICATION_TYPE.html">_ETW_NOTIFICATION_TYPE</a><br>
   +0x004 NotificationSize : Uint4B<br>
   +0x008 RefCount         : Int4B<br>
   +0x00c ReplyRequested   : UChar<br>
   +0x010 ReplyIndex       : Uint4B<br>
   +0x010 Timeout          : Uint4B<br>
   +0x014 ReplyCount       : Uint4B<br>
   +0x014 NotifyeeCount    : Uint4B<br>
   +0x018 ReplyHandle      : Uint8B<br>
   +0x018 ReplyObject      : Ptr64 Void<br>
   +0x018 RegIndex         : Uint4B<br>
   +0x020 TargetPID        : Uint4B<br>
   +0x024 SourcePID        : Uint4B<br>
   +0x028 DestinationGuid  : <a href="./_GUID.html">_GUID</a><br>
   +0x038 SourceGuid       : <a href="./_GUID.html">_GUID</a><br>
</font></body></html>