<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_FILE_OBJECT</h2>
<font face="arial">   +0x000 Type             : Int2B<br>
   +0x002 Size             : Int2B<br>
   +0x008 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x010 Vpb              : Ptr64 <a href="./_VPB.html">_VPB</a><br>
   +0x018 FsContext        : Ptr64 Void<br>
   +0x020 FsContext2       : Ptr64 Void<br>
   +0x028 SectionObjectPointer : Ptr64 <a href="./_SECTION_OBJECT_POINTERS.html">_SECTION_OBJECT_POINTERS</a><br>
   +0x030 PrivateCacheMap  : Ptr64 Void<br>
   +0x038 FinalStatus      : Int4B<br>
   +0x040 RelatedFileObject : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x048 LockOperation    : UChar<br>
   +0x049 DeletePending    : UChar<br>
   +0x04a ReadAccess       : UChar<br>
   +0x04b WriteAccess      : UChar<br>
   +0x04c DeleteAccess     : UChar<br>
   +0x04d SharedRead       : UChar<br>
   +0x04e SharedWrite      : UChar<br>
   +0x04f SharedDelete     : UChar<br>
   +0x050 Flags            : Uint4B<br>
   +0x058 FileName         : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x068 CurrentByteOffset : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x070 Waiters          : Uint4B<br>
   +0x074 Busy             : Uint4B<br>
   +0x078 LastLock         : Ptr64 Void<br>
   +0x080 Lock             : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x098 Event            : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x0b0 CompletionContext : Ptr64 <a href="./_IO_COMPLETION_CONTEXT.html">_IO_COMPLETION_CONTEXT</a><br>
   +0x0b8 IrpListLock      : Uint8B<br>
   +0x0c0 IrpList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d0 FileObjectExtension : Ptr64 Void<br>
</font></body></html>