<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_FS_FILTER_CALLBACKS</h2>
<font face="arial">   +0x000 SizeOfFsFilterCallbacks : Uint4B<br>
   +0x004 Reserved         : Uint4B<br>
   +0x008 PreAcquireForSectionSynchronization : Ptr64     long <br>
   +0x010 PostAcquireForSectionSynchronization : Ptr64     void <br>
   +0x018 PreReleaseForSectionSynchronization : Ptr64     long <br>
   +0x020 PostReleaseForSectionSynchronization : Ptr64     void <br>
   +0x028 PreAcquireForCcFlush : Ptr64     long <br>
   +0x030 PostAcquireForCcFlush : Ptr64     void <br>
   +0x038 PreReleaseForCcFlush : Ptr64     long <br>
   +0x040 PostReleaseForCcFlush : Ptr64     void <br>
   +0x048 PreAcquireForModifiedPageWriter : Ptr64     long <br>
   +0x050 PostAcquireForModifiedPageWriter : Ptr64     void <br>
   +0x058 PreReleaseForModifiedPageWriter : Ptr64     long <br>
   +0x060 PostReleaseForModifiedPageWriter : Ptr64     void <br>
   +0x068 PreQueryOpen     : Ptr64     long <br>
   +0x070 PostQueryOpen    : Ptr64     void <br>
</font></body></html>