<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_FSRTL_ADVANCED_FCB_HEADER</h2>
<font face="arial">   +0x000 NodeTypeCode     : Int2B<br>
   +0x002 NodeByteSize     : Int2B<br>
   +0x004 Flags            : UChar<br>
   +0x005 IsFastIoPossible : UChar<br>
   +0x006 Flags2           : UChar<br>
   +0x007 Reserved         : Pos 0, 4 Bits<br>
   +0x007 Version          : Pos 4, 4 Bits<br>
   +0x008 Resource         : Ptr64 <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
   +0x010 PagingIoResource : Ptr64 <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
   +0x018 AllocationSize   : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x020 FileSize         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x028 ValidDataLength  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x030 FastMutex        : Ptr64 <a href="./_FAST_MUTEX.html">_FAST_MUTEX</a><br>
   +0x038 FilterContexts   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 PushLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x050 FileContextSupportPointer : Ptr64 Ptr64 Void<br>
   +0x058 Oplock           : Ptr64 Void<br>
   +0x058 ReservedForRemote : Ptr64 Void<br>
   +0x060 ReservedContext  : Ptr64 Void<br>
</font></body></html>