<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_MMINPAGE_SUPPORT</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 ListHead         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 Event            : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x038 CollidedEvent    : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x050 IoStatus         : <a href="./_IO_STATUS_BLOCK.html">_IO_STATUS_BLOCK</a><br>
   +0x060 ReadOffset       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x068 u2               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x098 Thread           : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x0a0 LockedProtoPfn   : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x0a8 PteContents      : <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x0b0 WaitCount        : Int4B<br>
   +0x0b4 InjectRetry      : Int4B<br>
   +0x0b8 ByteCount        : Uint4B<br>
   +0x0bc u3               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0c0 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x0c8 FilePointer      : Ptr64 <a href="./_FILE_OBJECT.html">_FILE_OBJECT</a><br>
   +0x0d0 ControlArea      : Ptr64 <a href="./_CONTROL_AREA.html">_CONTROL_AREA</a><br>
   +0x0d0 Subsection       : Ptr64 <a href="./_SUBSECTION.html">_SUBSECTION</a><br>
   +0x0d8 Autoboost        : Ptr64 Void<br>
   +0x0e0 FaultingAddress  : Ptr64 Void<br>
   +0x0e8 PointerPte       : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x0f0 BasePte          : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x0f8 Pfn              : Ptr64 <a href="./_MMPFN.html">_MMPFN</a><br>
   +0x100 PrefetchMdl      : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x108 ProbeCount       : Int8B<br>
   +0x110 Mdl              : <a href="./_MDL.html">_MDL</a><br>
   +0x140 Page             : [16] Uint8B<br>
   +0x140 FlowThrough      : <a href="./_MMINPAGE_SUPPORT_FLOW_THROUGH.html">_MMINPAGE_SUPPORT_FLOW_THROUGH</a><br>
</font></body></html>