<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_MMSECTION_FLAGS</h2>
<font face="arial">   +0x000 BeingDeleted     : Pos 0, 1 Bit<br>
   +0x000 BeingCreated     : Pos 1, 1 Bit<br>
   +0x000 BeingPurged      : Pos 2, 1 Bit<br>
   +0x000 NoModifiedWriting : Pos 3, 1 Bit<br>
   +0x000 FailAllIo        : Pos 4, 1 Bit<br>
   +0x000 Image            : Pos 5, 1 Bit<br>
   +0x000 Based            : Pos 6, 1 Bit<br>
   +0x000 File             : Pos 7, 1 Bit<br>
   +0x000 AttemptingDelete : Pos 8, 1 Bit<br>
   +0x000 PrefetchCreated  : Pos 9, 1 Bit<br>
   +0x000 PhysicalMemory   : Pos 10, 1 Bit<br>
   +0x000 ImageControlAreaOnRemovableMedia : Pos 11, 1 Bit<br>
   +0x000 Reserve          : Pos 12, 1 Bit<br>
   +0x000 Commit           : Pos 13, 1 Bit<br>
   +0x000 NoChange         : Pos 14, 1 Bit<br>
   +0x000 WasPurged        : Pos 15, 1 Bit<br>
   +0x000 UserReference    : Pos 16, 1 Bit<br>
   +0x000 GlobalMemory     : Pos 17, 1 Bit<br>
   +0x000 DeleteOnClose    : Pos 18, 1 Bit<br>
   +0x000 FilePointerNull  : Pos 19, 1 Bit<br>
   +0x000 PreferredNode    : Pos 20, 6 Bits<br>
   +0x000 GlobalOnlyPerSession : Pos 26, 1 Bit<br>
   +0x000 UserWritable     : Pos 27, 1 Bit<br>
   +0x000 SystemVaAllocated : Pos 28, 1 Bit<br>
   +0x000 PreferredFsCompressionBoundary : Pos 29, 1 Bit<br>
   +0x000 UsingFileExtents : Pos 30, 1 Bit<br>
   +0x000 PageSize64K      : Pos 31, 1 Bit<br>
</font></body></html>