<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_POP_POWER_SETTING_VALUES</h2>
<font face="arial">   +0x000 StructureSize    : Uint4B<br>
   +0x004 PopPolicy        : <a href="./_SYSTEM_POWER_POLICY.html">_SYSTEM_POWER_POLICY</a><br>
   +0x0ec CurrentAcDcPowerState : <a href="./SYSTEM_POWER_CONDITION.html">SYSTEM_POWER_CONDITION</a><br>
   +0x0f0 AwayModeEnabled  : UChar<br>
   +0x0f1 AwayModeEngaged  : UChar<br>
   +0x0f2 AwayModePolicyAllowed : UChar<br>
   +0x0f4 AwayModeIgnoreUserPresent : Int4B<br>
   +0x0f8 AwayModeIgnoreAction : Int4B<br>
   +0x0fc DisableFastS4    : UChar<br>
   +0x0fd DisableStandbyStates : UChar<br>
   +0x100 UnattendSleepTimeout : Uint4B<br>
   +0x104 DiskIgnoreTime   : Uint4B<br>
   +0x108 DeviceIdlePolicy : Uint4B<br>
   +0x10c VideoDimTimeout  : Uint4B<br>
   +0x110 VideoNormalBrightness : Uint4B<br>
   +0x114 VideoDimBrightness : Uint4B<br>
   +0x118 AlsOffset        : Uint4B<br>
   +0x11c AlsEnabled       : Uint4B<br>
   +0x120 EsBrightness     : Uint4B<br>
   +0x124 SwitchShutdownForced : UChar<br>
   +0x128 SystemCoolingPolicy : Uint4B<br>
   +0x12c MediaBufferingEngaged : UChar<br>
   +0x12d AudioActivity    : UChar<br>
   +0x12e FullscreenVideoPlayback : UChar<br>
   +0x130 EsBatteryThreshold : Uint4B<br>
   +0x134 EsAggressive     : UChar<br>
   +0x135 EsUserAwaySetting : UChar<br>
   +0x138 ConnectivityInStandby : Uint4B<br>
   +0x13c DisconnectedStandbyMode : Uint4B<br>
   +0x140 UserPresencePredictionEnabled : Uint4B<br>
   +0x144 AirplaneModeEnabled : UChar<br>
   +0x145 BluetoothDeviceCharging : UChar<br>
</font></body></html>