<html><body>
<h4>Windows 10 x64 (18362.113)</h4><br>
<h2>_TOKEN</h2>
<font face="arial">   +0x000 TokenSource      : <a href="./_TOKEN_SOURCE.html">_TOKEN_SOURCE</a><br>
   +0x010 TokenId          : <a href="./_LUID.html">_LUID</a><br>
   +0x018 AuthenticationId : <a href="./_LUID.html">_LUID</a><br>
   +0x020 ParentTokenId    : <a href="./_LUID.html">_LUID</a><br>
   +0x028 ExpirationTime   : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x030 TokenLock        : Ptr64 <a href="./_ERESOURCE.html">_ERESOURCE</a><br>
   +0x038 ModifiedId       : <a href="./_LUID.html">_LUID</a><br>
   +0x040 Privileges       : <a href="./_SEP_TOKEN_PRIVILEGES.html">_SEP_TOKEN_PRIVILEGES</a><br>
   +0x058 AuditPolicy      : <a href="./_SEP_AUDIT_POLICY.html">_SEP_AUDIT_POLICY</a><br>
   +0x078 SessionId        : Uint4B<br>
   +0x07c UserAndGroupCount : Uint4B<br>
   +0x080 RestrictedSidCount : Uint4B<br>
   +0x084 VariableLength   : Uint4B<br>
   +0x088 DynamicCharged   : Uint4B<br>
   +0x08c DynamicAvailable : Uint4B<br>
   +0x090 DefaultOwnerIndex : Uint4B<br>
   +0x098 UserAndGroups    : Ptr64 <a href="./_SID_AND_ATTRIBUTES.html">_SID_AND_ATTRIBUTES</a><br>
   +0x0a0 RestrictedSids   : Ptr64 <a href="./_SID_AND_ATTRIBUTES.html">_SID_AND_ATTRIBUTES</a><br>
   +0x0a8 PrimaryGroup     : Ptr64 Void<br>
   +0x0b0 DynamicPart      : Ptr64 Uint4B<br>
   +0x0b8 DefaultDacl      : Ptr64 <a href="./_ACL.html">_ACL</a><br>
   +0x0c0 TokenType        : <a href="./_TOKEN_TYPE.html">_TOKEN_TYPE</a><br>
   +0x0c4 ImpersonationLevel : <a href="./_SECURITY_IMPERSONATION_LEVEL.html">_SECURITY_IMPERSONATION_LEVEL</a><br>
   +0x0c8 TokenFlags       : Uint4B<br>
   +0x0cc TokenInUse       : UChar<br>
   +0x0d0 IntegrityLevelIndex : Uint4B<br>
   +0x0d4 MandatoryPolicy  : Uint4B<br>
   +0x0d8 LogonSession     : Ptr64 <a href="./_SEP_LOGON_SESSION_REFERENCES.html">_SEP_LOGON_SESSION_REFERENCES</a><br>
   +0x0e0 OriginatingLogonSession : <a href="./_LUID.html">_LUID</a><br>
   +0x0e8 SidHash          : <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x1f8 RestrictedSidHash : <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x308 pSecurityAttributes : Ptr64 <a href="./_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION.html">_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION</a><br>
   +0x310 Package          : Ptr64 Void<br>
   +0x318 Capabilities     : Ptr64 <a href="./_SID_AND_ATTRIBUTES.html">_SID_AND_ATTRIBUTES</a><br>
   +0x320 CapabilityCount  : Uint4B<br>
   +0x328 CapabilitiesHash : <a href="./_SID_AND_ATTRIBUTES_HASH.html">_SID_AND_ATTRIBUTES_HASH</a><br>
   +0x438 LowboxNumberEntry : Ptr64 <a href="./_SEP_LOWBOX_NUMBER_ENTRY.html">_SEP_LOWBOX_NUMBER_ENTRY</a><br>
   +0x440 LowboxHandlesEntry : Ptr64 <a href="./_SEP_CACHED_HANDLES_ENTRY.html">_SEP_CACHED_HANDLES_ENTRY</a><br>
   +0x448 pClaimAttributes : Ptr64 <a href="./_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION.html">_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION</a><br>
   +0x450 TrustLevelSid    : Ptr64 Void<br>
   +0x458 TrustLinkedToken : Ptr64 <a href="./_TOKEN.html">_TOKEN</a><br>
   +0x460 IntegrityLevelSidValue : Ptr64 Void<br>
   +0x468 TokenSidValues   : Ptr64 <a href="./_SEP_SID_VALUES_BLOCK.html">_SEP_SID_VALUES_BLOCK</a><br>
   +0x470 IndexEntry       : Ptr64 <a href="./_SEP_LUID_TO_INDEX_MAP_ENTRY.html">_SEP_LUID_TO_INDEX_MAP_ENTRY</a><br>
   +0x478 DiagnosticInfo   : Ptr64 <a href="./_SEP_TOKEN_DIAG_TRACK_ENTRY.html">_SEP_TOKEN_DIAG_TRACK_ENTRY</a><br>
   +0x480 BnoIsolationHandlesEntry : Ptr64 <a href="./_SEP_CACHED_HANDLES_ENTRY.html">_SEP_CACHED_HANDLES_ENTRY</a><br>
   +0x488 SessionObject    : Ptr64 Void<br>
   +0x490 VariablePart     : Uint8B<br>
</font></body></html>