<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_ARBITER_LIST_ENTRY</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 AlternativeCount : Uint4B<br>
   +0x018 Alternatives     : Ptr64 <a href="./_IO_RESOURCE_DESCRIPTOR.html">_IO_RESOURCE_DESCRIPTOR</a><br>
   +0x020 PhysicalDeviceObject : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x028 RequestSource    : <a href="./_ARBITER_REQUEST_SOURCE.html">_ARBITER_REQUEST_SOURCE</a><br>
   +0x02c Flags            : Uint4B<br>
   +0x030 WorkSpace        : Int8B<br>
   +0x038 InterfaceType    : <a href="./_INTERFACE_TYPE.html">_INTERFACE_TYPE</a><br>
   +0x03c SlotNumber       : Uint4B<br>
   +0x040 BusNumber        : Uint4B<br>
   +0x048 Assignment       : Ptr64 <a href="./_CM_PARTIAL_RESOURCE_DESCRIPTOR.html">_CM_PARTIAL_RESOURCE_DESCRIPTOR</a><br>
   +0x050 SelectedAlternative : Ptr64 <a href="./_IO_RESOURCE_DESCRIPTOR.html">_IO_RESOURCE_DESCRIPTOR</a><br>
   +0x058 Result           : <a href="./_ARBITER_RESULT.html">_ARBITER_RESULT</a><br>
</font></body></html>