<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_FADT</h2>
<font face="arial">   +0x000 Header           : <a href="./_DESCRIPTION_HEADER.html">_DESCRIPTION_HEADER</a><br>
   +0x024 facs             : Uint4B<br>
   +0x028 dsdt             : Uint4B<br>
   +0x02c int_model        : UChar<br>
   +0x02d pm_profile       : UChar<br>
   +0x02e sci_int_vector   : Uint2B<br>
   +0x030 smi_cmd_io_port  : Uint4B<br>
   +0x034 acpi_on_value    : UChar<br>
   +0x035 acpi_off_value   : UChar<br>
   +0x036 s4bios_req       : UChar<br>
   +0x037 pstate_control   : UChar<br>
   +0x038 pm1a_evt_blk_io_port : Uint4B<br>
   +0x03c pm1b_evt_blk_io_port : Uint4B<br>
   +0x040 pm1a_ctrl_blk_io_port : Uint4B<br>
   +0x044 pm1b_ctrl_blk_io_port : Uint4B<br>
   +0x048 pm2_ctrl_blk_io_port : Uint4B<br>
   +0x04c pm_tmr_blk_io_port : Uint4B<br>
   +0x050 gp0_blk_io_port  : Uint4B<br>
   +0x054 gp1_blk_io_port  : Uint4B<br>
   +0x058 pm1_evt_len      : UChar<br>
   +0x059 pm1_ctrl_len     : UChar<br>
   +0x05a pm2_ctrl_len     : UChar<br>
   +0x05b pm_tmr_len       : UChar<br>
   +0x05c gp0_blk_len      : UChar<br>
   +0x05d gp1_blk_len      : UChar<br>
   +0x05e gp1_base         : UChar<br>
   +0x05f cstate_control   : UChar<br>
   +0x060 lvl2_latency     : Uint2B<br>
   +0x062 lvl3_latency     : Uint2B<br>
   +0x064 flush_size       : Uint2B<br>
   +0x066 flush_stride     : Uint2B<br>
   +0x068 duty_offset      : UChar<br>
   +0x069 duty_width       : UChar<br>
   +0x06a day_alarm_index  : UChar<br>
   +0x06b month_alarm_index : UChar<br>
   +0x06c century_alarm_index : UChar<br>
   +0x06d boot_arch        : Uint2B<br>
   +0x06f reserved3        : [1] UChar<br>
   +0x070 flags            : Uint4B<br>
   +0x074 reset_reg        : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x080 reset_val        : UChar<br>
   +0x081 arm_boot_arch    : Uint2B<br>
   +0x083 minor_version_number : UChar<br>
   +0x084 x_firmware_ctrl  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x08c x_dsdt           : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x094 x_pm1a_evt_blk   : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0a0 x_pm1b_evt_blk   : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0ac x_pm1a_ctrl_blk  : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0b8 x_pm1b_ctrl_blk  : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0c4 x_pm2_ctrl_blk   : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0d0 x_pm_tmr_blk     : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0dc x_gp0_blk        : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0e8 x_gp1_blk        : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x0f4 sleep_control_reg : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
   +0x100 sleep_status_reg : <a href="./_GEN_ADDR.html">_GEN_ADDR</a><br>
</font></body></html>