<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_GENERAL_LOOKASIDE_POOL</h2>
<font face="arial">   +0x000 ListHead         : <a href="./_SLIST_HEADER.html">_SLIST_HEADER</a><br>
   +0x000 SingleListHead   : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x010 Depth            : Uint2B<br>
   +0x012 MaximumDepth     : Uint2B<br>
   +0x014 TotalAllocates   : Uint4B<br>
   +0x018 AllocateMisses   : Uint4B<br>
   +0x018 AllocateHits     : Uint4B<br>
   +0x01c TotalFrees       : Uint4B<br>
   +0x020 FreeMisses       : Uint4B<br>
   +0x020 FreeHits         : Uint4B<br>
   +0x024 Type             : <a href="./_POOL_TYPE.html">_POOL_TYPE</a><br>
   +0x028 Tag              : Uint4B<br>
   +0x02c Size             : Uint4B<br>
   +0x030 AllocateEx       : Ptr64     void* <br>
   +0x030 Allocate         : Ptr64     void* <br>
   +0x038 FreeEx           : Ptr64     void <br>
   +0x038 Free             : Ptr64     void <br>
   +0x040 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x050 LastTotalAllocates : Uint4B<br>
   +0x054 LastAllocateMisses : Uint4B<br>
   +0x054 LastAllocateHits : Uint4B<br>
   +0x058 Future           : [2] Uint4B<br>
</font></body></html>