<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_MI_NODE_INFORMATION</h2>
<font face="arial">   +0x000 FreeLargePages   : [3] <a href="./_MI_FREE_LARGE_PAGES.html">_MI_FREE_LARGE_PAGES</a><br>
   +0x390 LargePageRebuildTimer : <a href="./_MI_REBUILD_LARGE_PAGE_TIMER.html">_MI_REBUILD_LARGE_PAGE_TIMER</a><br>
   +0x3b8 StandbyPageList  : [4] [8] <a href="./_MMPFNLIST_SHORT.html">_MMPFNLIST_SHORT</a><br>
   +0x6c0 FreePageListHeadsBitmap : [2] <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x6e0 FreePageListHeadsBitmapBuffer : [16] Uint4B<br>
   +0x720 FreeCount        : [2] Uint8B<br>
   +0x730 TotalPages       : [4] Uint8B<br>
   +0x750 TotalPagesEntireNode : Uint8B<br>
   +0x758 CurrentHugeRangeColor : Uint4B<br>
   +0x760 HugeIoRangeFreeCount : [2] Uint8B<br>
   +0x770 MmShiftedColor   : Uint4B<br>
   +0x774 Color            : Uint4B<br>
   +0x778 ChannelFreeCount : [4] [2] Uint8B<br>
   +0x7b8 Flags            : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x7bc LargeListMoveInProgress : Uint4B<br>
   +0x7c0 LargeListWaiters : Ptr64 <a href="./_MI_LARGE_PAGE_LISTS_CHANGING.html">_MI_LARGE_PAGE_LISTS_CHANGING</a><br>
   +0x7c8 NodeLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x7d0 ZeroThreadHugeMapLock : Uint8B<br>
   +0x7d8 ChannelStatus    : UChar<br>
   +0x7d9 ChannelOrdering  : [4] UChar<br>
   +0x7dd LockedChannelOrdering : [4] UChar<br>
   +0x7e1 PowerAttribute   : [4] UChar<br>
   +0x7e8 LargePageLock    : Uint8B<br>
   +0x7f0 PageColorTable   : <a href="./_MI_PAGE_COLORS.html">_MI_PAGE_COLORS</a><br>
   +0x800 NumberOfPagesGoingBad : Uint8B<br>
   +0x808 WriteCalibration : <a href="./_MI_WRITE_CALIBRATION.html">_MI_WRITE_CALIBRATION</a><br>
   +0x828 BootZeroContext  : Ptr64 Void<br>
   +0x830 BootZeroPageTimesPerProcessor : Ptr64 Void<br>
   +0x838 ZeroingVaBase    : Ptr64 Void<br>
   +0x840 TotalBytesToZero : Uint8B<br>
   +0x848 PerProcessorNumberOfBytesToZero : Uint8B<br>
   +0x850 ZeroingContext   : Ptr64 Void<br>
   +0x858 ZeroingProcessorCount : Uint4B<br>
   +0x85c ZeroHand         : Int4B<br>
   +0x860 FinishedProcessors : Int4B<br>
   +0x868 CyclesToZeroOneLargePage : Uint8B<br>
   +0x870 ScaledCyclesToZeroOneLargePage : Ptr64 Uint8B<br>
   +0x878 GroupAffinity    : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x888 ProcessorCount   : Uint2B<br>
   +0x88a BackgroundZeroingActive : UChar<br>
   +0x890 ZeroingPhysicalMemoryBlock : Ptr64 <a href="./_PHYSICAL_MEMORY_DESCRIPTOR.html">_PHYSICAL_MEMORY_DESCRIPTOR</a><br>
</font></body></html>