<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_MIPFNBLINK</h2>
<font face="arial">   +0x000 Blink            : Pos 0, 36 Bits<br>
   +0x000 NodeBlinkHigh    : Pos 36, 20 Bits<br>
   +0x000 TbFlushStamp     : Pos 56, 4 Bits<br>
   +0x000 Unused           : Pos 60, 2 Bits<br>
   +0x000 PageBlinkDeleteBit : Pos 62, 1 Bit<br>
   +0x000 PageBlinkLockBit : Pos 63, 1 Bit<br>
   +0x000 ShareCount       : Pos 0, 62 Bits<br>
   +0x000 PageShareCountDeleteBit : Pos 62, 1 Bit<br>
   +0x000 PageShareCountLockBit : Pos 63, 1 Bit<br>
   +0x000 EntireField      : Uint8B<br>
   +0x000 Lock             : Int8B<br>
   +0x000 LockNotUsed      : Pos 0, 62 Bits<br>
   +0x000 DeleteBit        : Pos 62, 1 Bit<br>
   +0x000 LockBit          : Pos 63, 1 Bit<br>
</font></body></html>