<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_MM_SESSION_SPACE</h2>
<font face="arial">   +0x000 ReferenceCount   : Int4B<br>
   +0x004 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x008 SessionId        : Uint4B<br>
   +0x00c ProcessReferenceToSession : Int4B<br>
   +0x010 ProcessList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 SessionPageDirectoryIndex : Uint8B<br>
   +0x028 NonPagablePages  : Uint8B<br>
   +0x030 CommittedPages   : Uint8B<br>
   +0x038 PagedPoolStart   : Ptr64 Void<br>
   +0x040 PagedPoolEnd     : Ptr64 Void<br>
   +0x048 SessionObject    : Ptr64 Void<br>
   +0x050 SessionObjectHandle : Ptr64 Void<br>
   +0x058 ImageTree        : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x060 LocaleId         : Uint4B<br>
   +0x064 AttachCount      : Uint4B<br>
   +0x068 AttachGate       : <a href="./_KGATE.html">_KGATE</a><br>
   +0x080 WsListEntry      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x090 WsTreeEntry      : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x0a8 PagedPoolInfo    : <a href="./_MM_PAGED_POOL_INFO.html">_MM_PAGED_POOL_INFO</a><br>
   +0x0c0 Session          : <a href="./_MMSESSION.html">_MMSESSION</a><br>
   +0x0e0 CombineDomain    : Uint8B<br>
   +0x100 Vm               : <a href="./_MMSUPPORT_FULL.html">_MMSUPPORT_FULL</a><br>
   +0x240 WorkingSetList   : <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x280 AggregateSessionWs : <a href="./_MMSUPPORT_AGGREGATION.html">_MMSUPPORT_AGGREGATION</a><br>
   +0x2a0 HeapState        : Ptr64 Void<br>
   +0x2a8 DriverUnload     : <a href="./_MI_SESSION_DRIVER_UNLOAD.html">_MI_SESSION_DRIVER_UNLOAD</a><br>
   +0x2b0 TopLevelPteLockBits : [32] Uint4B<br>
   +0x330 PageDirectory    : <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x338 SessionVaLock    : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x340 DynamicVaBitMap  : <a href="./_RTL_BITMAP_EX.html">_RTL_BITMAP_EX</a><br>
   +0x350 DynamicVaHint    : Uint8B<br>
   +0x358 SessionPteLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x360 PoolBigEntriesInUse : Int4B<br>
   +0x364 PagedPoolPdeCount : Int4B<br>
   +0x368 DynamicSessionPdeCount : Uint4B<br>
   +0x370 SystemPteInfo    : <a href="./_MI_SYSTEM_PTE_TYPE.html">_MI_SYSTEM_PTE_TYPE</a><br>
   +0x3d0 PoolTrackTableExpansion : Ptr64 Void<br>
   +0x3d8 PoolTrackTableExpansionSize : Uint8B<br>
   +0x3e0 PoolTrackBigPages : Ptr64 Void<br>
   +0x3e8 PoolTrackBigPagesSize : Uint8B<br>
   +0x3f0 PermittedFaultsTree : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x3f8 IoState          : <a href="./_IO_SESSION_STATE.html">_IO_SESSION_STATE</a><br>
   +0x3fc IoStateSequence  : Uint4B<br>
   +0x400 IoNotificationEvent : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x418 ServerSilo       : Ptr64 <a href="./_EJOB.html">_EJOB</a><br>
   +0x420 CreateTime       : Uint8B<br>
   +0x1000 PoolTags         : [16384] UChar<br>
</font></body></html>