<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_MMPFN</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x000 TreeNode         : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x000 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x008 PteAddress       : Ptr64 <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x008 PteLong          : Uint8B<br>
   +0x010 OriginalPte      : <a href="./_MMPTE.html">_MMPTE</a><br>
   +0x018 u2               : <a href="./_MIPFNBLINK.html">_MIPFNBLINK</a><br>
   +0x020 u3               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x024 NodeBlinkLow     : Uint2B<br>
   +0x026 Unused           : Pos 0, 4 Bits<br>
   +0x026 Unused2          : Pos 4, 4 Bits<br>
   +0x027 ViewCount        : UChar<br>
   +0x027 NodeFlinkLow     : UChar<br>
   +0x027 ModifiedListBucketIndex : Pos 0, 4 Bits<br>
   +0x028 u4               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>