<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_PPM_IDLE_STATES</h2>
<font face="arial">   +0x000 InterfaceVersion : UChar<br>
   +0x001 IdleOverride     : UChar<br>
   +0x002 EstimateIdleDuration : UChar<br>
   +0x003 ExitLatencyTraceEnabled : UChar<br>
   +0x004 NonInterruptibleTransition : UChar<br>
   +0x005 UnaccountedTransition : UChar<br>
   +0x006 IdleDurationLimited : UChar<br>
   +0x007 IdleCheckLimited : UChar<br>
   +0x008 StrictVetoBias   : UChar<br>
   +0x00c ExitLatencyCountdown : Uint4B<br>
   +0x010 TargetState      : Uint4B<br>
   +0x014 ActualState      : Uint4B<br>
   +0x018 OldState         : Uint4B<br>
   +0x01c OverrideIndex    : Uint4B<br>
   +0x020 ProcessorIdleCount : Uint4B<br>
   +0x024 Type             : Uint4B<br>
   +0x028 LevelId          : Uint8B<br>
   +0x030 ReasonFlags      : Uint2B<br>
   +0x038 InitiateWakeStamp : Uint8B<br>
   +0x040 PreviousStatus   : Int4B<br>
   +0x044 PreviousCancelReason : Uint4B<br>
   +0x048 PrimaryProcessorMask : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x0f0 SecondaryProcessorMask : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x198 IdlePrepare      : Ptr64     void <br>
   +0x1a0 IdlePreExecute   : Ptr64     long <br>
   +0x1a8 IdleExecute      : Ptr64     long <br>
   +0x1b0 IdlePreselect    : Ptr64     unsigned long <br>
   +0x1b8 IdleTest         : Ptr64     unsigned long <br>
   +0x1c0 IdleAvailabilityCheck : Ptr64     unsigned long <br>
   +0x1c8 IdleComplete     : Ptr64     void <br>
   +0x1d0 IdleCancel       : Ptr64     void <br>
   +0x1d8 IdleIsHalted     : Ptr64     unsigned char <br>
   +0x1e0 IdleInitiateWake : Ptr64     unsigned char <br>
   +0x1e8 PrepareInfo      : <a href="./_PROCESSOR_IDLE_PREPARE_INFO.html">_PROCESSOR_IDLE_PREPARE_INFO</a><br>
   +0x240 DeepIdleSnapshot : <a href="./_KAFFINITY_EX.html">_KAFFINITY_EX</a><br>
   +0x2e8 Tracing          : Ptr64 <a href="./_PERFINFO_PPM_STATE_SELECTION.html">_PERFINFO_PPM_STATE_SELECTION</a><br>
   +0x2f0 CoordinatedTracing : Ptr64 <a href="./_PERFINFO_PPM_STATE_SELECTION.html">_PERFINFO_PPM_STATE_SELECTION</a><br>
   +0x2f8 ProcessorMenu    : <a href="./_PPM_SELECTION_MENU.html">_PPM_SELECTION_MENU</a><br>
   +0x308 CoordinatedMenu  : <a href="./_PPM_SELECTION_MENU.html">_PPM_SELECTION_MENU</a><br>
   +0x318 CoordinatedSelection : <a href="./_PPM_COORDINATED_SELECTION.html">_PPM_COORDINATED_SELECTION</a><br>
   +0x330 State            : [1] <a href="./_PPM_IDLE_STATE.html">_PPM_IDLE_STATE</a><br>
</font></body></html>