<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_PPM_POLICY_SETTINGS_MASK</h2>
<font face="arial">   +0x000 Value            : Uint8B<br>
   +0x000 PerfDecreaseTime : Pos 0, 1 Bit<br>
   +0x000 PerfIncreaseTime : Pos 1, 1 Bit<br>
   +0x000 PerfDecreasePolicy : Pos 2, 1 Bit<br>
   +0x000 PerfIncreasePolicy : Pos 3, 1 Bit<br>
   +0x000 PerfDecreaseThreshold : Pos 4, 1 Bit<br>
   +0x000 PerfIncreaseThreshold : Pos 5, 1 Bit<br>
   +0x000 PerfMinPolicy    : Pos 6, 1 Bit<br>
   +0x000 PerfMaxPolicy    : Pos 7, 1 Bit<br>
   +0x000 PerfTimeCheck    : Pos 8, 1 Bit<br>
   +0x000 PerfBoostPolicy  : Pos 9, 1 Bit<br>
   +0x000 PerfBoostMode    : Pos 10, 1 Bit<br>
   +0x000 AllowThrottling  : Pos 11, 1 Bit<br>
   +0x000 PerfHistoryCount : Pos 12, 1 Bit<br>
   +0x000 ParkingPerfState : Pos 13, 1 Bit<br>
   +0x000 LatencyHintPerf  : Pos 14, 1 Bit<br>
   +0x000 LatencyHintUnpark : Pos 15, 1 Bit<br>
   +0x000 CoreParkingMinCores : Pos 16, 1 Bit<br>
   +0x000 CoreParkingMaxCores : Pos 17, 1 Bit<br>
   +0x000 CoreParkingDecreasePolicy : Pos 18, 1 Bit<br>
   +0x000 CoreParkingIncreasePolicy : Pos 19, 1 Bit<br>
   +0x000 CoreParkingDecreaseTime : Pos 20, 1 Bit<br>
   +0x000 CoreParkingIncreaseTime : Pos 21, 1 Bit<br>
   +0x000 CoreParkingOverUtilizationThreshold : Pos 22, 1 Bit<br>
   +0x000 CoreParkingDistributeUtility : Pos 23, 1 Bit<br>
   +0x000 CoreParkingConcurrencyThreshold : Pos 24, 1 Bit<br>
   +0x000 CoreParkingHeadroomThreshold : Pos 25, 1 Bit<br>
   +0x000 CoreParkingDistributionThreshold : Pos 26, 1 Bit<br>
   +0x000 IdleAllowScaling : Pos 27, 1 Bit<br>
   +0x000 IdleDisable      : Pos 28, 1 Bit<br>
   +0x000 IdleTimeCheck    : Pos 29, 1 Bit<br>
   +0x000 IdleDemoteThreshold : Pos 30, 1 Bit<br>
   +0x000 IdlePromoteThreshold : Pos 31, 1 Bit<br>
   +0x004 HeteroDecreaseTime : Pos 0, 1 Bit<br>
   +0x004 HeteroIncreaseTime : Pos 1, 1 Bit<br>
   +0x004 HeteroDecreaseThreshold : Pos 2, 1 Bit<br>
   +0x004 HeteroIncreaseThreshold : Pos 3, 1 Bit<br>
   +0x004 Class0FloorPerformance : Pos 4, 1 Bit<br>
   +0x004 Class1InitialPerformance : Pos 5, 1 Bit<br>
   +0x004 EnergyPerfPreference : Pos 6, 1 Bit<br>
   +0x004 AutonomousActivityWindow : Pos 7, 1 Bit<br>
   +0x004 AutonomousMode   : Pos 8, 1 Bit<br>
   +0x004 DutyCycling      : Pos 9, 1 Bit<br>
   +0x004 FrequencyCap     : Pos 10, 1 Bit<br>
   +0x004 ThreadPolicy     : Pos 11, 1 Bit<br>
   +0x004 ShortThreadPolicy : Pos 12, 1 Bit<br>
   +0x004 IdleStateMax     : Pos 13, 1 Bit<br>
   +0x004 ResponsivenessDisableThreshold : Pos 14, 1 Bit<br>
   +0x004 ResponsivenessEnableThreshold : Pos 15, 1 Bit<br>
   +0x004 ResponsivenessDisableTime : Pos 16, 1 Bit<br>
   +0x004 ResponsivenessEnableTime : Pos 17, 1 Bit<br>
   +0x004 ResponsivenessEppCeiling : Pos 18, 1 Bit<br>
   +0x004 ResponsivenessPerfFloor : Pos 19, 1 Bit<br>
   +0x004 SoftParkLatency  : Pos 20, 1 Bit<br>
   +0x004 Spare            : Pos 21, 11 Bits<br>
</font></body></html>