<html><body>
<h4>Windows 10 x64 (19041.264)</h4><br>
<h2>_THERMAL_INFORMATION_EX</h2>
<font face="arial">   +0x000 ThermalStamp     : Uint4B<br>
   +0x004 ThermalConstant1 : Uint4B<br>
   +0x008 ThermalConstant2 : Uint4B<br>
   +0x00c SamplingPeriod   : Uint4B<br>
   +0x010 CurrentTemperature : Uint4B<br>
   +0x014 PassiveTripPoint : Uint4B<br>
   +0x018 ThermalStandbyTripPoint : Uint4B<br>
   +0x01c CriticalTripPoint : Uint4B<br>
   +0x020 ActiveTripPointCount : UChar<br>
   +0x021 PassiveCoolingDevicesPresent : UChar<br>
   +0x024 ActiveTripPoint  : [10] Uint4B<br>
   +0x04c S4TransitionTripPoint : Uint4B<br>
   +0x050 MinimumThrottle  : Uint4B<br>
   +0x054 OverThrottleThreshold : Uint4B<br>
   +0x058 PollingPeriod    : Uint4B<br>
</font></body></html>