<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_ACCESS_STATE</h2>
<font face="arial">   +0x000 OperationID      : <a href="./_LUID.html">_LUID</a><br>
   +0x008 SecurityEvaluated : UChar<br>
   +0x009 GenerateAudit    : UChar<br>
   +0x00a GenerateOnClose  : UChar<br>
   +0x00b PrivilegesAllocated : UChar<br>
   +0x00c Flags            : Uint4B<br>
   +0x010 RemainingDesiredAccess : Uint4B<br>
   +0x014 PreviouslyGrantedAccess : Uint4B<br>
   +0x018 OriginalDesiredAccess : Uint4B<br>
   +0x020 SubjectSecurityContext : <a href="./_SECURITY_SUBJECT_CONTEXT.html">_SECURITY_SUBJECT_CONTEXT</a><br>
   +0x040 SecurityDescriptor : Ptr64 Void<br>
   +0x048 AuxData          : Ptr64 Void<br>
   +0x050 Privileges       : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x07c AuditPrivileges  : UChar<br>
   +0x080 ObjectName       : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x090 ObjectTypeName   : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
</font></body></html>