<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_ALPC_PORT</h2>
<font face="arial">   +0x000 PortListEntry    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 CommunicationInfo : Ptr64 <a href="./_ALPC_COMMUNICATION_INFO.html">_ALPC_COMMUNICATION_INFO</a><br>
   +0x018 OwnerProcess     : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x020 CompletionPort   : Ptr64 Void<br>
   +0x028 CompletionKey    : Ptr64 Void<br>
   +0x030 CompletionPacketLookaside : Ptr64 <a href="./_ALPC_COMPLETION_PACKET_LOOKASIDE.html">_ALPC_COMPLETION_PACKET_LOOKASIDE</a><br>
   +0x038 PortContext      : Ptr64 Void<br>
   +0x040 StaticSecurity   : <a href="./_SECURITY_CLIENT_CONTEXT.html">_SECURITY_CLIENT_CONTEXT</a><br>
   +0x088 IncomingQueueLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x090 MainQueue        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0a0 LargeMessageQueue : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0b0 PendingQueueLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0b8 PendingQueue     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0c8 DirectQueueLock  : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0d0 DirectQueue      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0e0 WaitQueueLock    : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x0e8 WaitQueue        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0f8 Semaphore        : Ptr64 <a href="./_KSEMAPHORE.html">_KSEMAPHORE</a><br>
   +0x0f8 DummyEvent       : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x100 PortAttributes   : <a href="./_ALPC_PORT_ATTRIBUTES.html">_ALPC_PORT_ATTRIBUTES</a><br>
   +0x148 ResourceListLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x150 ResourceListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x160 PortObjectLock   : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x168 CompletionList   : Ptr64 <a href="./_ALPC_COMPLETION_LIST.html">_ALPC_COMPLETION_LIST</a><br>
   +0x170 CallbackObject   : Ptr64 <a href="./_CALLBACK_OBJECT.html">_CALLBACK_OBJECT</a><br>
   +0x178 CallbackContext  : Ptr64 Void<br>
   +0x180 CanceledQueue    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x190 SequenceNo       : Int4B<br>
   +0x194 ReferenceNo      : Int4B<br>
   +0x198 ReferenceNoWait  : Ptr64 <a href="./_PALPC_PORT_REFERENCE_WAIT_BLOCK.html">_PALPC_PORT_REFERENCE_WAIT_BLOCK</a><br>
   +0x1a0 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x1a8 TargetQueuePort  : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x1b0 TargetSequencePort : Ptr64 <a href="./_ALPC_PORT.html">_ALPC_PORT</a><br>
   +0x1b8 CachedMessage    : Ptr64 <a href="./_KALPC_MESSAGE.html">_KALPC_MESSAGE</a><br>
   +0x1c0 MainQueueLength  : Uint4B<br>
   +0x1c4 LargeMessageQueueLength : Uint4B<br>
   +0x1c8 PendingQueueLength : Uint4B<br>
   +0x1cc DirectQueueLength : Uint4B<br>
   +0x1d0 CanceledQueueLength : Uint4B<br>
   +0x1d4 WaitQueueLength  : Uint4B<br>
</font></body></html>