<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_LPCP_PORT_OBJECT</h2>
<font face="arial">   +0x000 ConnectionPort   : Ptr64 <a href="./_LPCP_PORT_OBJECT.html">_LPCP_PORT_OBJECT</a><br>
   +0x008 ConnectedPort    : Ptr64 <a href="./_LPCP_PORT_OBJECT.html">_LPCP_PORT_OBJECT</a><br>
   +0x010 MsgQueue         : <a href="./_LPCP_PORT_QUEUE.html">_LPCP_PORT_QUEUE</a><br>
   +0x030 Creator          : <a href="./_CLIENT_ID.html">_CLIENT_ID</a><br>
   +0x040 ClientSectionBase : Ptr64 Void<br>
   +0x048 ServerSectionBase : Ptr64 Void<br>
   +0x050 PortContext      : Ptr64 Void<br>
   +0x058 ClientThread     : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
   +0x060 SecurityQos      : <a href="./_SECURITY_QUALITY_OF_SERVICE.html">_SECURITY_QUALITY_OF_SERVICE</a><br>
   +0x070 StaticSecurity   : <a href="./_SECURITY_CLIENT_CONTEXT.html">_SECURITY_CLIENT_CONTEXT</a><br>
   +0x0b8 LpcReplyChainHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0c8 LpcDataInfoChainHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d8 ServerProcess    : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x0d8 MappingProcess   : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x0e0 MaxMessageLength : Uint2B<br>
   +0x0e2 MaxConnectionInfoLength : Uint2B<br>
   +0x0e4 Flags            : Uint4B<br>
   +0x0e8 WaitEvent        : <a href="./_KEVENT.html">_KEVENT</a><br>
</font></body></html>