<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_MI_NODE_INFORMATION</h2>
<font face="arial">   +0x000 FreeLargePages   : [3] <a href="./_MI_FREE_LARGE_PAGES.html">_MI_FREE_LARGE_PAGES</a><br>
   +0x330 LargePageRebuildTimer : <a href="./_MI_REBUILD_LARGE_PAGE_TIMER.html">_MI_REBUILD_LARGE_PAGE_TIMER</a><br>
   +0x358 StandbyPageList  : [4] [8] <a href="./_MMPFNLIST_SHORT.html">_MMPFNLIST_SHORT</a><br>
   +0x680 FreePageListHeadsBitmap : [2] <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x6a0 FreePageListHeadsBitmapBuffer : [16] Uint4B<br>
   +0x6e0 FreeCount        : [2] Uint8B<br>
   +0x6f0 TotalPages       : [4] Uint8B<br>
   +0x710 TotalPagesEntireNode : Uint8B<br>
   +0x718 CurrentHugeRangeColor : Uint4B<br>
   +0x720 HugeIoRangeFreeCount : [2] Uint8B<br>
   +0x730 MmShiftedColor   : Uint4B<br>
   +0x734 Color            : Uint4B<br>
   +0x738 ChannelFreeCount : [4] [2] Uint8B<br>
   +0x778 Flags            : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x780 NodeLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x788 ZeroThreadHugeMapLock : Uint8B<br>
   +0x790 LargeListMoveInProgress : UChar<br>
   +0x791 ChannelStatus    : UChar<br>
   +0x792 ChannelOrdering  : [4] UChar<br>
   +0x796 LockedChannelOrdering : [4] UChar<br>
   +0x79a PowerAttribute   : [4] UChar<br>
   +0x7a0 LargePageLock    : Uint8B<br>
   +0x7a8 PageColorTable   : <a href="./_MI_PAGE_COLORS.html">_MI_PAGE_COLORS</a><br>
</font></body></html>