<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_MM_PAGE_ACCESS_INFO_HEADER</h2>
<font face="arial">   +0x000 Link             : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x008 Type             : <a href="./_MM_PAGE_ACCESS_TYPE.html">_MM_PAGE_ACCESS_TYPE</a><br>
   +0x00c EmptySequenceNumber : Uint4B<br>
   +0x00c CurrentFileIndex : Uint4B<br>
   +0x010 CreateTime       : Uint8B<br>
   +0x018 EmptyTime        : Uint8B<br>
   +0x018 TempEntry        : Ptr64 <a href="./_MM_PAGE_ACCESS_INFO.html">_MM_PAGE_ACCESS_INFO</a><br>
   +0x020 PageEntry        : Ptr64 <a href="./_MM_PAGE_ACCESS_INFO.html">_MM_PAGE_ACCESS_INFO</a><br>
   +0x028 FileEntry        : Ptr64 Uint8B<br>
   +0x030 FirstFileEntry   : Ptr64 Uint8B<br>
   +0x038 Process          : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x040 SessionId        : Uint4B<br>
   +0x020 PageFrameEntry   : Ptr64 Uint8B<br>
   +0x028 LastPageFrameEntry : Ptr64 Uint8B<br>
</font></body></html>