<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_MMSUPPORT_INSTANCE</h2>
<font face="arial">   +0x000 NextPageColor    : Uint4B<br>
   +0x004 PageFaultCount   : Uint4B<br>
   +0x008 TrimmedPageCount : Uint8B<br>
   +0x010 VmWorkingSetList : Ptr64 <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x018 WorkingSetExpansionLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x028 AgeDistribution  : [8] Uint8B<br>
   +0x068 ExitOutswapGate  : Ptr64 <a href="./_KGATE.html">_KGATE</a><br>
   +0x070 MinimumWorkingSetSize : Uint8B<br>
   +0x078 WorkingSetLeafSize : Uint8B<br>
   +0x080 WorkingSetLeafPrivateSize : Uint8B<br>
   +0x088 WorkingSetSize   : Uint8B<br>
   +0x090 WorkingSetPrivateSize : Uint8B<br>
   +0x098 MaximumWorkingSetSize : Uint8B<br>
   +0x0a0 PeakWorkingSetSize : Uint8B<br>
   +0x0a8 HardFaultCount   : Uint4B<br>
   +0x0ac LastTrimStamp    : Uint2B<br>
   +0x0ae PartitionId      : Uint2B<br>
   +0x0b0 SelfmapLock      : Uint8B<br>
   +0x0b8 Flags            : <a href="./_MMSUPPORT_FLAGS.html">_MMSUPPORT_FLAGS</a><br>
</font></body></html>