<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_SHARED_CACHE_MAP</h2>
<font face="arial">   +0x000 NodeTypeCode     : Int2B<br>
   +0x002 NodeByteSize     : Int2B<br>
   +0x004 OpenCount        : Uint4B<br>
   +0x008 FileSize         : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x010 BcbList          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 SectionSize      : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x028 ValidDataLength  : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x030 ValidDataGoal    : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x038 InitialVacbs     : [4] Ptr64 <a href="./_VACB.html">_VACB</a><br>
   +0x058 Vacbs            : Ptr64 Ptr64 <a href="./_VACB.html">_VACB</a><br>
   +0x060 FileObjectFastRef : <a href="./_EX_FAST_REF.html">_EX_FAST_REF</a><br>
   +0x068 VacbLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x070 DirtyPages       : Uint4B<br>
   +0x078 LoggedStreamLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x088 SharedCacheMapLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x098 Flags            : Uint4B<br>
   +0x09c Status           : Int4B<br>
   +0x0a0 Mbcb             : Ptr64 <a href="./_MBCB.html">_MBCB</a><br>
   +0x0a8 Section          : Ptr64 Void<br>
   +0x0b0 CreateEvent      : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x0b8 WaitOnActiveCount : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x0c0 PagesToWrite     : Uint4B<br>
   +0x0c8 BeyondLastFlush  : Int8B<br>
   +0x0d0 Callbacks        : Ptr64 <a href="./_CACHE_MANAGER_CALLBACKS.html">_CACHE_MANAGER_CALLBACKS</a><br>
   +0x0d8 LazyWriteContext : Ptr64 Void<br>
   +0x0e0 PrivateList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0f0 V1               : <a href="./_LOGGED_STREAM_CALLBACK_V1.html">_LOGGED_STREAM_CALLBACK_V1</a><br>
   +0x0f0 V2               : <a href="./_LOGGED_STREAM_CALLBACK_V2.html">_LOGGED_STREAM_CALLBACK_V2</a><br>
   +0x100 LargestLSN       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x108 DirtyPageThreshold : Uint4B<br>
   +0x10c LazyWritePassCount : Uint4B<br>
   +0x110 UninitializeEvent : Ptr64 <a href="./_CACHE_UNINITIALIZE_EVENT.html">_CACHE_UNINITIALIZE_EVENT</a><br>
   +0x118 BcbLock          : <a href="./_FAST_MUTEX.html">_FAST_MUTEX</a><br>
   +0x150 LastUnmapBehindOffset : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x158 Event            : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x170 HighWaterMappingOffset : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x178 PrivateCacheMap  : <a href="./_PRIVATE_CACHE_MAP.html">_PRIVATE_CACHE_MAP</a><br>
   +0x1f0 WriteBehindWorkQueueEntry : Ptr64 Void<br>
   +0x1f8 VolumeCacheMap   : Ptr64 <a href="./_VOLUME_CACHE_MAP.html">_VOLUME_CACHE_MAP</a><br>
   +0x200 ProcImagePathHash : Uint4B<br>
   +0x204 WritesInProgress : Uint4B<br>
   +0x208 AsyncReadRequestCount : Uint4B<br>
   +0x210 Partition        : Ptr64 <a href="./_CC_PARTITION.html">_CC_PARTITION</a><br>
   +0x218 InternalRefCount : Uint4B<br>
   +0x21c NumMappedVacb    : Uint4B<br>
   +0x220 NumActiveVacb    : Uint4B<br>
</font></body></html>