<html><body>
<h4>Windows 10 x64 (18363.778)</h4><br>
<h2>_WHEAP_ERROR_SOURCE</h2>
<font face="arial">   +0x000 ListEntry        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 FailedAllocations : Uint4B<br>
   +0x014 PlatformErrorSourceId : Uint4B<br>
   +0x018 ErrorCount       : Int4B<br>
   +0x01c RecordCount      : Uint4B<br>
   +0x020 RecordLength     : Uint4B<br>
   +0x024 PoolTag          : Uint4B<br>
   +0x028 Type             : <a href="./_WHEA_ERROR_SOURCE_TYPE.html">_WHEA_ERROR_SOURCE_TYPE</a><br>
   +0x030 Records          : Ptr64 <a href="./_WHEAP_ERROR_RECORD_WRAPPER.html">_WHEAP_ERROR_RECORD_WRAPPER</a><br>
   +0x038 Context          : Ptr64 Void<br>
   +0x040 SectionCount     : Uint4B<br>
   +0x044 SectionLength    : Uint4B<br>
   +0x048 TickCountAtLastError : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x050 AccumulatedErrors : Uint4B<br>
   +0x054 TotalErrors      : Uint4B<br>
   +0x058 Deferred         : UChar<br>
   +0x05c Busy             : Int4B<br>
   +0x060 Descriptor       : <a href="./_WHEA_ERROR_SOURCE_DESCRIPTOR.html">_WHEA_ERROR_SOURCE_DESCRIPTOR</a><br>
</font></body></html>