<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_DEVICE_OBJECT_POWER_EXTENSION</h2>
<font face="arial">   +0x000 IdleCount        : Uint4B<br>
   +0x004 BusyCount        : Uint4B<br>
   +0x008 BusyReference    : Uint4B<br>
   +0x00c TotalBusyCount   : Uint4B<br>
   +0x010 ConservationIdleTime : Uint4B<br>
   +0x014 PerformanceIdleTime : Uint4B<br>
   +0x018 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x020 IdleList         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x030 IdleType         : <a href="./_POP_DEVICE_IDLE_TYPE.html">_POP_DEVICE_IDLE_TYPE</a><br>
   +0x034 IdleState        : <a href="./_DEVICE_POWER_STATE.html">_DEVICE_POWER_STATE</a><br>
   +0x038 CurrentState     : <a href="./_DEVICE_POWER_STATE.html">_DEVICE_POWER_STATE</a><br>
   +0x040 CoolingExtension : Ptr64 <a href="./_POP_COOLING_EXTENSION.html">_POP_COOLING_EXTENSION</a><br>
   +0x048 Volume           : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x058 Specific         : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>