<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_EPARTITION</h2>
<font face="arial">   +0x000 MmPartition      : Ptr64 Void<br>
   +0x008 CcPartition      : Ptr64 Void<br>
   +0x010 ExPartition      : Ptr64 Void<br>
   +0x018 HardReferenceCount : Int8B<br>
   +0x020 OpenHandleCount  : Int8B<br>
   +0x028 ActivePartitionLinks : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x038 ParentPartition  : Ptr64 <a href="./_EPARTITION.html">_EPARTITION</a><br>
   +0x040 TeardownWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x060 TeardownLock     : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x068 SystemProcess    : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x070 SystemProcessHandle : Ptr64 Void<br>
   +0x078 PartitionFlags   : Uint4B<br>
   +0x078 PairedWithJob    : Pos 0, 1 Bit<br>
</font></body></html>