<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_FAST_IO_DISPATCH</h2>
<font face="arial">   +0x000 SizeOfFastIoDispatch : Uint4B<br>
   +0x008 FastIoCheckIfPossible : Ptr64     unsigned char <br>
   +0x010 FastIoRead       : Ptr64     unsigned char <br>
   +0x018 FastIoWrite      : Ptr64     unsigned char <br>
   +0x020 FastIoQueryBasicInfo : Ptr64     unsigned char <br>
   +0x028 FastIoQueryStandardInfo : Ptr64     unsigned char <br>
   +0x030 FastIoLock       : Ptr64     unsigned char <br>
   +0x038 FastIoUnlockSingle : Ptr64     unsigned char <br>
   +0x040 FastIoUnlockAll  : Ptr64     unsigned char <br>
   +0x048 FastIoUnlockAllByKey : Ptr64     unsigned char <br>
   +0x050 FastIoDeviceControl : Ptr64     unsigned char <br>
   +0x058 AcquireFileForNtCreateSection : Ptr64     void <br>
   +0x060 ReleaseFileForNtCreateSection : Ptr64     void <br>
   +0x068 FastIoDetachDevice : Ptr64     void <br>
   +0x070 FastIoQueryNetworkOpenInfo : Ptr64     unsigned char <br>
   +0x078 AcquireForModWrite : Ptr64     long <br>
   +0x080 MdlRead          : Ptr64     unsigned char <br>
   +0x088 MdlReadComplete  : Ptr64     unsigned char <br>
   +0x090 PrepareMdlWrite  : Ptr64     unsigned char <br>
   +0x098 MdlWriteComplete : Ptr64     unsigned char <br>
   +0x0a0 FastIoReadCompressed : Ptr64     unsigned char <br>
   +0x0a8 FastIoWriteCompressed : Ptr64     unsigned char <br>
   +0x0b0 MdlReadCompleteCompressed : Ptr64     unsigned char <br>
   +0x0b8 MdlWriteCompleteCompressed : Ptr64     unsigned char <br>
   +0x0c0 FastIoQueryOpen  : Ptr64     unsigned char <br>
   +0x0c8 ReleaseForModWrite : Ptr64     long <br>
   +0x0d0 AcquireForCcFlush : Ptr64     long <br>
   +0x0d8 ReleaseForCcFlush : Ptr64     long <br>
</font></body></html>