<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_HAL_IOMMU_DISPATCH</h2>
<font face="arial">   +0x000 HalIommuSupportEnabled : Ptr64     unsigned char <br>
   +0x008 HalIommuGetConfiguration : Ptr64     long <br>
   +0x010 HalIommuGetLibraryContext : Ptr64     long <br>
   +0x018 HalIommuMapDevice : Ptr64     long <br>
   +0x020 HalIommuEnableDevicePasid : Ptr64     long <br>
   +0x028 HalIommuSetAddressSpace : Ptr64     long <br>
   +0x030 HalIommuDisableDevicePasid : Ptr64     long <br>
   +0x038 HalIommuUnmapDevice : Ptr64     long <br>
   +0x040 HalIommuFreeLibraryContext : Ptr64     long <br>
   +0x048 HalIommuFlushTb  : Ptr64     void <br>
   +0x050 HalIommuFlushAllPasid : Ptr64     void <br>
   +0x058 HalIommuProcessPageRequestQueue : Ptr64     unsigned char <br>
   +0x060 HalIommuFaultRoutine : Ptr64     void <br>
   +0x068 HalIommuReferenceAsid : Ptr64     void* <br>
   +0x070 HalIommuDereferenceAsid : Ptr64     void <br>
   +0x078 HalIommuServicePageFault : Ptr64     long <br>
   +0x080 HalIommuDevicePowerChange : Ptr64     long <br>
   +0x088 HalIommuBeginDeviceReset : Ptr64     long <br>
   +0x090 HalIommuFinalizeDeviceReset : Ptr64     long <br>
</font></body></html>