<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_KSPECIAL_REGISTERS</h2>
<font face="arial">   +0x000 Cr0              : Uint8B<br>
   +0x008 Cr2              : Uint8B<br>
   +0x010 Cr3              : Uint8B<br>
   +0x018 Cr4              : Uint8B<br>
   +0x020 KernelDr0        : Uint8B<br>
   +0x028 KernelDr1        : Uint8B<br>
   +0x030 KernelDr2        : Uint8B<br>
   +0x038 KernelDr3        : Uint8B<br>
   +0x040 KernelDr6        : Uint8B<br>
   +0x048 KernelDr7        : Uint8B<br>
   +0x050 Gdtr             : <a href="./_KDESCRIPTOR.html">_KDESCRIPTOR</a><br>
   +0x060 Idtr             : <a href="./_KDESCRIPTOR.html">_KDESCRIPTOR</a><br>
   +0x070 Tr               : Uint2B<br>
   +0x072 Ldtr             : Uint2B<br>
   +0x074 MxCsr            : Uint4B<br>
   +0x078 DebugControl     : Uint8B<br>
   +0x080 LastBranchToRip  : Uint8B<br>
   +0x088 LastBranchFromRip : Uint8B<br>
   +0x090 LastExceptionToRip : Uint8B<br>
   +0x098 LastExceptionFromRip : Uint8B<br>
   +0x0a0 Cr8              : Uint8B<br>
   +0x0a8 MsrGsBase        : Uint8B<br>
   +0x0b0 MsrGsSwap        : Uint8B<br>
   +0x0b8 MsrStar          : Uint8B<br>
   +0x0c0 MsrLStar         : Uint8B<br>
   +0x0c8 MsrCStar         : Uint8B<br>
   +0x0d0 MsrSyscallMask   : Uint8B<br>
   +0x0d8 Xcr0             : Uint8B<br>
   +0x0e0 MsrFsBase        : Uint8B<br>
   +0x0e8 SpecialPadding0  : Uint8B<br>
</font></body></html>