<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_LOADER_PARAMETER_BLOCK</h2>
<font face="arial">   +0x000 OsMajorVersion   : Uint4B<br>
   +0x004 OsMinorVersion   : Uint4B<br>
   +0x008 Size             : Uint4B<br>
   +0x00c OsLoaderSecurityVersion : Uint4B<br>
   +0x010 LoadOrderListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 MemoryDescriptorListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x030 BootDriverListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x040 EarlyLaunchListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x050 CoreDriverListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x060 CoreExtensionsDriverListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x070 TpmCoreDriverListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x080 KernelStack      : Uint8B<br>
   +0x088 Prcb             : Uint8B<br>
   +0x090 Process          : Uint8B<br>
   +0x098 Thread           : Uint8B<br>
   +0x0a0 KernelStackSize  : Uint4B<br>
   +0x0a4 RegistryLength   : Uint4B<br>
   +0x0a8 RegistryBase     : Ptr64 Void<br>
   +0x0b0 ConfigurationRoot : Ptr64 <a href="./_CONFIGURATION_COMPONENT_DATA.html">_CONFIGURATION_COMPONENT_DATA</a><br>
   +0x0b8 ArcBootDeviceName : Ptr64 Char<br>
   +0x0c0 ArcHalDeviceName : Ptr64 Char<br>
   +0x0c8 NtBootPathName   : Ptr64 Char<br>
   +0x0d0 NtHalPathName    : Ptr64 Char<br>
   +0x0d8 LoadOptions      : Ptr64 Char<br>
   +0x0e0 NlsData          : Ptr64 <a href="./_NLS_DATA_BLOCK.html">_NLS_DATA_BLOCK</a><br>
   +0x0e8 ArcDiskInformation : Ptr64 <a href="./_ARC_DISK_INFORMATION.html">_ARC_DISK_INFORMATION</a><br>
   +0x0f0 Extension        : Ptr64 <a href="./_LOADER_PARAMETER_EXTENSION.html">_LOADER_PARAMETER_EXTENSION</a><br>
   +0x0f8 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x108 FirmwareInformation : <a href="./_FIRMWARE_INFORMATION_LOADER_BLOCK.html">_FIRMWARE_INFORMATION_LOADER_BLOCK</a><br>
   +0x148 OsBootstatPathName : Ptr64 Char<br>
   +0x150 ArcOSDataDeviceName : Ptr64 Char<br>
   +0x158 ArcWindowsSysPartName : Ptr64 Char<br>
</font></body></html>