<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_MMPTE_HARDWARE</h2>
<font face="arial">   +0x000 Valid            : Pos 0, 1 Bit<br>
   +0x000 Dirty1           : Pos 1, 1 Bit<br>
   +0x000 Owner            : Pos 2, 1 Bit<br>
   +0x000 WriteThrough     : Pos 3, 1 Bit<br>
   +0x000 CacheDisable     : Pos 4, 1 Bit<br>
   +0x000 Accessed         : Pos 5, 1 Bit<br>
   +0x000 Dirty            : Pos 6, 1 Bit<br>
   +0x000 LargePage        : Pos 7, 1 Bit<br>
   +0x000 Global           : Pos 8, 1 Bit<br>
   +0x000 CopyOnWrite      : Pos 9, 1 Bit<br>
   +0x000 Unused           : Pos 10, 1 Bit<br>
   +0x000 Write            : Pos 11, 1 Bit<br>
   +0x000 PageFrameNumber  : Pos 12, 36 Bits<br>
   +0x000 ReservedForHardware : Pos 48, 4 Bits<br>
   +0x000 ReservedForSoftware : Pos 52, 4 Bits<br>
   +0x000 WsleAge          : Pos 56, 4 Bits<br>
   +0x000 WsleProtection   : Pos 60, 3 Bits<br>
   +0x000 NoExecute        : Pos 63, 1 Bit<br>
</font></body></html>