<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_TEB32</h2>
<font face="arial">   +0x000 NtTib            : <a href="./_NT_TIB32.html">_NT_TIB32</a><br>
   +0x01c EnvironmentPointer : Uint4B<br>
   +0x020 ClientId         : <a href="./_CLIENT_ID32.html">_CLIENT_ID32</a><br>
   +0x028 ActiveRpcHandle  : Uint4B<br>
   +0x02c ThreadLocalStoragePointer : Uint4B<br>
   +0x030 ProcessEnvironmentBlock : Uint4B<br>
   +0x034 LastErrorValue   : Uint4B<br>
   +0x038 CountOfOwnedCriticalSections : Uint4B<br>
   +0x03c CsrClientThread  : Uint4B<br>
   +0x040 Win32ThreadInfo  : Uint4B<br>
   +0x044 User32Reserved   : [26] Uint4B<br>
   +0x0ac UserReserved     : [5] Uint4B<br>
   +0x0c0 WOW32Reserved    : Uint4B<br>
   +0x0c4 CurrentLocale    : Uint4B<br>
   +0x0c8 FpSoftwareStatusRegister : Uint4B<br>
   +0x0cc ReservedForDebuggerInstrumentation : [16] Uint4B<br>
   +0x10c SystemReserved1  : [26] Uint4B<br>
   +0x174 PlaceholderCompatibilityMode : Char<br>
   +0x175 PlaceholderHydrationAlwaysExplicit : UChar<br>
   +0x176 PlaceholderReserved : [10] Char<br>
   +0x180 ProxiedProcessId : Uint4B<br>
   +0x184 _ActivationStack : <a href="./_ACTIVATION_CONTEXT_STACK32.html">_ACTIVATION_CONTEXT_STACK32</a><br>
   +0x19c WorkingOnBehalfTicket : [8] UChar<br>
   +0x1a4 ExceptionCode    : Int4B<br>
   +0x1a8 ActivationContextStackPointer : Uint4B<br>
   +0x1ac InstrumentationCallbackSp : Uint4B<br>
   +0x1b0 InstrumentationCallbackPreviousPc : Uint4B<br>
   +0x1b4 InstrumentationCallbackPreviousSp : Uint4B<br>
   +0x1b8 InstrumentationCallbackDisabled : UChar<br>
   +0x1b9 SpareBytes       : [23] UChar<br>
   +0x1d0 TxFsContext      : Uint4B<br>
   +0x1d4 GdiTebBatch      : <a href="./_GDI_TEB_BATCH32.html">_GDI_TEB_BATCH32</a><br>
   +0x6b4 RealClientId     : <a href="./_CLIENT_ID32.html">_CLIENT_ID32</a><br>
   +0x6bc GdiCachedProcessHandle : Uint4B<br>
   +0x6c0 GdiClientPID     : Uint4B<br>
   +0x6c4 GdiClientTID     : Uint4B<br>
   +0x6c8 GdiThreadLocalInfo : Uint4B<br>
   +0x6cc Win32ClientInfo  : [62] Uint4B<br>
   +0x7c4 glDispatchTable  : [233] Uint4B<br>
   +0xb68 glReserved1      : [29] Uint4B<br>
   +0xbdc glReserved2      : Uint4B<br>
   +0xbe0 glSectionInfo    : Uint4B<br>
   +0xbe4 glSection        : Uint4B<br>
   +0xbe8 glTable          : Uint4B<br>
   +0xbec glCurrentRC      : Uint4B<br>
   +0xbf0 glContext        : Uint4B<br>
   +0xbf4 LastStatusValue  : Uint4B<br>
   +0xbf8 StaticUnicodeString : <a href="./_STRING32.html">_STRING32</a><br>
   +0xc00 StaticUnicodeBuffer : [261] Wchar<br>
   +0xe0c DeallocationStack : Uint4B<br>
   +0xe10 TlsSlots         : [64] Uint4B<br>
   +0xf10 TlsLinks         : <a href="./LIST_ENTRY32.html">LIST_ENTRY32</a><br>
   +0xf18 Vdm              : Uint4B<br>
   +0xf1c ReservedForNtRpc : Uint4B<br>
   +0xf20 DbgSsReserved    : [2] Uint4B<br>
   +0xf28 HardErrorMode    : Uint4B<br>
   +0xf2c Instrumentation  : [9] Uint4B<br>
   +0xf50 ActivityId       : <a href="./_GUID.html">_GUID</a><br>
   +0xf60 SubProcessTag    : Uint4B<br>
   +0xf64 PerflibData      : Uint4B<br>
   +0xf68 EtwTraceData     : Uint4B<br>
   +0xf6c WinSockData      : Uint4B<br>
   +0xf70 GdiBatchCount    : Uint4B<br>
   +0xf74 CurrentIdealProcessor : <a href="./_PROCESSOR_NUMBER.html">_PROCESSOR_NUMBER</a><br>
   +0xf74 IdealProcessorValue : Uint4B<br>
   +0xf74 ReservedPad0     : UChar<br>
   +0xf75 ReservedPad1     : UChar<br>
   +0xf76 ReservedPad2     : UChar<br>
   +0xf77 IdealProcessor   : UChar<br>
   +0xf78 GuaranteedStackBytes : Uint4B<br>
   +0xf7c ReservedForPerf  : Uint4B<br>
   +0xf80 ReservedForOle   : Uint4B<br>
   +0xf84 WaitingOnLoaderLock : Uint4B<br>
   +0xf88 SavedPriorityState : Uint4B<br>
   +0xf8c ReservedForCodeCoverage : Uint4B<br>
   +0xf90 ThreadPoolData   : Uint4B<br>
   +0xf94 TlsExpansionSlots : Uint4B<br>
   +0xf98 MuiGeneration    : Uint4B<br>
   +0xf9c IsImpersonating  : Uint4B<br>
   +0xfa0 NlsCache         : Uint4B<br>
   +0xfa4 pShimData        : Uint4B<br>
   +0xfa8 HeapData         : Uint4B<br>
   +0xfac CurrentTransactionHandle : Uint4B<br>
   +0xfb0 ActiveFrame      : Uint4B<br>
   +0xfb4 FlsData          : Uint4B<br>
   +0xfb8 PreferredLanguages : Uint4B<br>
   +0xfbc UserPrefLanguages : Uint4B<br>
   +0xfc0 MergedPrefLanguages : Uint4B<br>
   +0xfc4 MuiImpersonation : Uint4B<br>
   +0xfc8 CrossTebFlags    : Uint2B<br>
   +0xfc8 SpareCrossTebBits : Pos 0, 16 Bits<br>
   +0xfca SameTebFlags     : Uint2B<br>
   +0xfca SafeThunkCall    : Pos 0, 1 Bit<br>
   +0xfca InDebugPrint     : Pos 1, 1 Bit<br>
   +0xfca HasFiberData     : Pos 2, 1 Bit<br>
   +0xfca SkipThreadAttach : Pos 3, 1 Bit<br>
   +0xfca WerInShipAssertCode : Pos 4, 1 Bit<br>
   +0xfca RanProcessInit   : Pos 5, 1 Bit<br>
   +0xfca ClonedThread     : Pos 6, 1 Bit<br>
   +0xfca SuppressDebugMsg : Pos 7, 1 Bit<br>
   +0xfca DisableUserStackWalk : Pos 8, 1 Bit<br>
   +0xfca RtlExceptionAttached : Pos 9, 1 Bit<br>
   +0xfca InitialThread    : Pos 10, 1 Bit<br>
   +0xfca SessionAware     : Pos 11, 1 Bit<br>
   +0xfca LoadOwner        : Pos 12, 1 Bit<br>
   +0xfca LoaderWorker     : Pos 13, 1 Bit<br>
   +0xfca SkipLoaderInit   : Pos 14, 1 Bit<br>
   +0xfca SpareSameTebBits : Pos 15, 1 Bit<br>
   +0xfcc TxnScopeEnterCallback : Uint4B<br>
   +0xfd0 TxnScopeExitCallback : Uint4B<br>
   +0xfd4 TxnScopeContext  : Uint4B<br>
   +0xfd8 LockCount        : Uint4B<br>
   +0xfdc WowTebOffset     : Int4B<br>
   +0xfe0 ResourceRetValue : Uint4B<br>
   +0xfe4 ReservedForWdf   : Uint4B<br>
   +0xfe8 ReservedForCrt   : Uint8B<br>
   +0xff0 EffectiveContainerId : <a href="./_GUID.html">_GUID</a><br>
</font></body></html>