<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_VIRTUAL_EFI_RUNTIME_SERVICES</h2>
<font face="arial">   +0x000 GetTime          : Uint8B<br>
   +0x008 SetTime          : Uint8B<br>
   +0x010 GetWakeupTime    : Uint8B<br>
   +0x018 SetWakeupTime    : Uint8B<br>
   +0x020 SetVirtualAddressMap : Uint8B<br>
   +0x028 ConvertPointer   : Uint8B<br>
   +0x030 GetVariable      : Uint8B<br>
   +0x038 GetNextVariableName : Uint8B<br>
   +0x040 SetVariable      : Uint8B<br>
   +0x048 GetNextHighMonotonicCount : Uint8B<br>
   +0x050 ResetSystem      : Uint8B<br>
   +0x058 UpdateCapsule    : Uint8B<br>
   +0x060 QueryCapsuleCapabilities : Uint8B<br>
   +0x068 QueryVariableInfo : Uint8B<br>
</font></body></html>