<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_WMI_BUFFER_HEADER</h2>
<font face="arial">   +0x000 BufferSize       : Uint4B<br>
   +0x004 SavedOffset      : Uint4B<br>
   +0x008 CurrentOffset    : Uint4B<br>
   +0x00c ReferenceCount   : Int4B<br>
   +0x010 TimeStamp        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x018 SequenceNumber   : Int8B<br>
   +0x020 ClockType        : Pos 0, 3 Bits<br>
   +0x020 Frequency        : Pos 3, 61 Bits<br>
   +0x020 SlistEntry       : <a href="./_SINGLE_LIST_ENTRY.html">_SINGLE_LIST_ENTRY</a><br>
   +0x020 NextBuffer       : Ptr64 <a href="./_WMI_BUFFER_HEADER.html">_WMI_BUFFER_HEADER</a><br>
   +0x028 ClientContext    : <a href="./_ETW_BUFFER_CONTEXT.html">_ETW_BUFFER_CONTEXT</a><br>
   +0x02c State            : <a href="./_ETW_BUFFER_STATE.html">_ETW_BUFFER_STATE</a><br>
   +0x030 Offset           : Uint4B<br>
   +0x034 BufferFlag       : Uint2B<br>
   +0x036 BufferType       : Uint2B<br>
   +0x038 Padding1         : [4] Uint4B<br>
   +0x038 ReferenceTime    : <a href="./_ETW_REF_CLOCK.html">_ETW_REF_CLOCK</a><br>
   +0x038 GlobalEntry      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x038 Pointer0         : Ptr64 Void<br>
   +0x040 Pointer1         : Ptr64 Void<br>
</font></body></html>