<html><body>
<h4>Windows 10 x64 (18362.239)</h4><br>
<h2>_XSAVE_FORMAT</h2>
<font face="arial">   +0x000 ControlWord      : Uint2B<br>
   +0x002 StatusWord       : Uint2B<br>
   +0x004 TagWord          : UChar<br>
   +0x005 Reserved1        : UChar<br>
   +0x006 ErrorOpcode      : Uint2B<br>
   +0x008 ErrorOffset      : Uint4B<br>
   +0x00c ErrorSelector    : Uint2B<br>
   +0x00e Reserved2        : Uint2B<br>
   +0x010 DataOffset       : Uint4B<br>
   +0x014 DataSelector     : Uint2B<br>
   +0x016 Reserved3        : Uint2B<br>
   +0x018 MxCsr            : Uint4B<br>
   +0x01c MxCsr_Mask       : Uint4B<br>
   +0x020 FloatRegisters   : [8] <a href="./_M128A.html">_M128A</a><br>
   +0x0a0 XmmRegisters     : [16] <a href="./_M128A.html">_M128A</a><br>
   +0x1a0 Reserved4        : [96] UChar<br>
</font></body></html>