<html><body>
<h4>Windows 10 x64 (18362.86)</h4><br>
<h2>_MI_SYSTEM_VA_STATE</h2>
<font face="arial">   +0x000 SystemTablesLock : Uint8B<br>
   +0x008 AvailableSystemCacheVa : Uint8B<br>
   +0x010 DynamicBitMapKernelStacks : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x058 DynamicBitMapSystemPtes : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x0a0 DynamicBitMapDriverImages : [2] <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x130 DynamicBitMapPagedPool : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x178 DynamicBitMapSystemCache : <a href="./_MI_DYNAMIC_BITMAP.html">_MI_DYNAMIC_BITMAP</a><br>
   +0x1c0 HalPrivateVaStart : Ptr64 Void<br>
   +0x1c8 HalPrivateVaSize : Uint8B<br>
   +0x1d0 SystemVaAssignment : [8] Uint4B<br>
   +0x1f0 SystemVaAssignmentHint : Uint4B<br>
   +0x1f4 TopLevelPteLockBits : [32] Uint4B<br>
   +0x274 DeleteKvaLock    : Int4B<br>
   +0x278 WsleArrays       : [8] Ptr64 <a href="./_MI_WSLE.html">_MI_WSLE</a><br>
   +0x2b8 PagableHyperSpace : Ptr64 Void<br>
   +0x2c0 HyperSpaceEnd    : Ptr64 Void<br>
   +0x2c8 PagableHyperSpaceBytes : Uint8B<br>
   +0x2d0 PageTableCommitmentOffset : [2] Uint8B<br>
   +0x2e0 FreeSystemCacheVa : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x2f8 SystemVaLock     : Uint8B<br>
   +0x300 SystemCacheViewLock : Uint8B<br>
   +0x308 SystemWorkingSetList : [8] <a href="./_MMWSL_INSTANCE.html">_MMWSL_INSTANCE</a><br>
   +0x448 SelfmapLock      : [4] Uint8B<br>
</font></body></html>