<html><body>
<h4>Windows 10 x64 (18362.86)</h4><br>
<h2>_MMVAD_SHORT</h2>
<font face="arial">   +0x000 NextVad          : Ptr64 <a href="./_MMVAD_SHORT.html">_MMVAD_SHORT</a><br>
   +0x008 ExtraCreateInfo  : Ptr64 Void<br>
   +0x000 VadNode          : <a href="./_RTL_BALANCED_NODE.html">_RTL_BALANCED_NODE</a><br>
   +0x018 StartingVpn      : Uint4B<br>
   +0x01c EndingVpn        : Uint4B<br>
   +0x020 StartingVpnHigh  : UChar<br>
   +0x021 EndingVpnHigh    : UChar<br>
   +0x022 CommitChargeHigh : UChar<br>
   +0x023 SpareNT64VadUChar : UChar<br>
   +0x024 ReferenceCount   : Int4B<br>
   +0x028 PushLock         : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x030 u                : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x034 u1               : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
   +0x038 EventList        : Ptr64 <a href="./_MI_VAD_EVENT_BLOCK.html">_MI_VAD_EVENT_BLOCK</a><br>
</font></body></html>