<html><body>
<h4>Windows 10 x64 (18362.86)</h4><br>
<h2>_PROCESS_ENERGY_VALUES</h2>
<font face="arial">   +0x000 Cycles           : [4] [2] Uint8B<br>
   +0x040 DiskEnergy       : Uint8B<br>
   +0x048 NetworkTailEnergy : Uint8B<br>
   +0x050 MBBTailEnergy    : Uint8B<br>
   +0x058 NetworkTxRxBytes : Uint8B<br>
   +0x060 MBBTxRxBytes     : Uint8B<br>
   +0x068 Durations        : [3] <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x068 ForegroundDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x070 DesktopVisibleDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x078 PSMForegroundDuration : <a href="./_ENERGY_STATE_DURATION.html">_ENERGY_STATE_DURATION</a><br>
   +0x080 CompositionRendered : Uint4B<br>
   +0x084 CompositionDirtyGenerated : Uint4B<br>
   +0x088 CompositionDirtyPropagated : Uint4B<br>
   +0x08c Reserved1        : Uint4B<br>
   +0x090 AttributedCycles : [4] [2] Uint8B<br>
   +0x0d0 WorkOnBehalfCycles : [4] [2] Uint8B<br>
</font></body></html>