<html><body>
<h4>Windows 10 x64 (18362.86)</h4><br>
<h2>_WHEA_AER_BRIDGE_DESCRIPTOR</h2>
<font face="arial">   +0x000 Type             : Uint2B<br>
   +0x002 Enabled          : UChar<br>
   +0x003 Reserved         : UChar<br>
   +0x004 BusNumber        : Uint4B<br>
   +0x008 Slot             : <a href="./_WHEA_PCI_SLOT_NUMBER.html">_WHEA_PCI_SLOT_NUMBER</a><br>
   +0x00c DeviceControl    : Uint2B<br>
   +0x00e Flags            : <a href="./_AER_BRIDGE_DESCRIPTOR_FLAGS.html">_AER_BRIDGE_DESCRIPTOR_FLAGS</a><br>
   +0x010 UncorrectableErrorMask : Uint4B<br>
   +0x014 UncorrectableErrorSeverity : Uint4B<br>
   +0x018 CorrectableErrorMask : Uint4B<br>
   +0x01c AdvancedCapsAndControl : Uint4B<br>
   +0x020 SecondaryUncorrectableErrorMask : Uint4B<br>
   +0x024 SecondaryUncorrectableErrorSev : Uint4B<br>
   +0x028 SecondaryCapsAndControl : Uint4B<br>
</font></body></html>