<html><body>
<h4>Windows 10 x64 (18362.86)</h4><br>
<h2>_X86_KTRAP_FRAME_BLUE</h2>
<font face="arial">   +0x000 DbgEbp           : Uint4B<br>
   +0x004 DbgEip           : Uint4B<br>
   +0x008 DbgArgMark       : Uint4B<br>
   +0x00c TempSegCs        : Uint2B<br>
   +0x00e Logging          : UChar<br>
   +0x00f FrameType        : UChar<br>
   +0x010 TempEsp          : Uint4B<br>
   +0x014 Dr0              : Uint4B<br>
   +0x018 Dr1              : Uint4B<br>
   +0x01c Dr2              : Uint4B<br>
   +0x020 Dr3              : Uint4B<br>
   +0x024 Dr6              : Uint4B<br>
   +0x028 Dr7              : Uint4B<br>
   +0x02c SegGs            : Uint4B<br>
   +0x030 SegEs            : Uint4B<br>
   +0x034 SegDs            : Uint4B<br>
   +0x038 Edx              : Uint4B<br>
   +0x03c Ecx              : Uint4B<br>
   +0x040 Eax              : Uint4B<br>
   +0x044 PreviousPreviousMode : UChar<br>
   +0x045 EntropyQueueDpc  : UChar<br>
   +0x046 Reserved         : [2] UChar<br>
   +0x048 MxCsr            : Uint4B<br>
   +0x04c ExceptionList    : Uint4B<br>
   +0x050 SegFs            : Uint4B<br>
   +0x054 Edi              : Uint4B<br>
   +0x058 Esi              : Uint4B<br>
   +0x05c Ebx              : Uint4B<br>
   +0x060 Ebp              : Uint4B<br>
   +0x064 ErrCode          : Uint4B<br>
   +0x068 Eip              : Uint4B<br>
   +0x06c SegCs            : Uint4B<br>
   +0x070 EFlags           : Uint4B<br>
   +0x074 HardwareEsp      : Uint4B<br>
   +0x078 HardwareSegSs    : Uint4B<br>
   +0x07c V86Es            : Uint4B<br>
   +0x080 V86Ds            : Uint4B<br>
   +0x084 V86Fs            : Uint4B<br>
   +0x088 V86Gs            : Uint4B<br>
</font></body></html>