<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_ADAPTER_OBJECT</h2>
<font face="arial">   +0x000 AdapterObject    : <a href="./_HALP_DMA_ADAPTER_OBJECT.html">_HALP_DMA_ADAPTER_OBJECT</a><br>
   +0x098 MasterAdapter    : Ptr64 <a href="./_HALP_DMA_MASTER_ADAPTER_OBJECT.html">_HALP_DMA_MASTER_ADAPTER_OBJECT</a><br>
   +0x0a0 WaitQueueEntry   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0b0 ChannelWaitQueue : <a href="./_KDEVICE_QUEUE.html">_KDEVICE_QUEUE</a><br>
   +0x0b0 ResourceWaitLock : Uint8B<br>
   +0x0b8 ResourceWaitQueue : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0c8 ChannelResourceWaitQueue : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x0d8 ResourceQueueBusy : UChar<br>
   +0x0e0 MapRegistersPerChannel : Uint4B<br>
   +0x0e8 MapRegisterBase  : Ptr64 Void<br>
   +0x0f0 NumberOfMapRegisters : Uint4B<br>
   +0x0f4 MaxTransferLength : Uint4B<br>
   +0x0f8 CrashDumpRegisterBase : [2] Ptr64 Void<br>
   +0x108 NumberOfCrashDumpRegisters : [2] Uint4B<br>
   +0x110 CrashDumpRegisterRefCount : [2] Uint4B<br>
   +0x118 AdapterCrashDumpList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x128 MapRegisterMdl   : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x130 MapRegisterMdlLock : Uint8B<br>
   +0x138 AllocationHandle : Ptr64 Void<br>
   +0x140 VirtualAddress   : Ptr64 Void<br>
   +0x148 IsAllocationMdlBased : UChar<br>
   +0x149 NoLocalPool      : UChar<br>
   +0x150 CurrentWcb       : Ptr64 <a href="./_WAIT_CONTEXT_BLOCK.html">_WAIT_CONTEXT_BLOCK</a><br>
   +0x158 CurrentTransferContext : Ptr64 <a href="./_DMA_TRANSFER_CONTEXT.html">_DMA_TRANSFER_CONTEXT</a><br>
   +0x160 DmaController    : Ptr64 <a href="./_HALP_DMA_CONTROLLER.html">_HALP_DMA_CONTROLLER</a><br>
   +0x168 Controller       : Uint4B<br>
   +0x16c ChannelNumber    : Uint4B<br>
   +0x170 RequestLine      : Uint4B<br>
   +0x174 RequestedChannelCount : Uint4B<br>
   +0x178 AllocatedChannelCount : Uint4B<br>
   +0x17c AllocatedChannels : [8] Uint4B<br>
   +0x1a0 ChannelAdapter   : Ptr64 Void<br>
   +0x1a8 NeedsMapRegisters : UChar<br>
   +0x1a9 MasterDevice     : UChar<br>
   +0x1aa ScatterGather    : UChar<br>
   +0x1ab AutoInitialize   : UChar<br>
   +0x1ac IgnoreCount      : UChar<br>
   +0x1ad CacheCoherent    : UChar<br>
   +0x1b0 Dma32BitAddresses : UChar<br>
   +0x1b1 Dma64BitAddresses : UChar<br>
   +0x1b0 DmaAddressWidth  : Uint4B<br>
   +0x1b4 DmaPortWidth     : <a href="./_DMA_WIDTH.html">_DMA_WIDTH</a><br>
   +0x1b8 DeviceAddress    : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x1c0 AdapterList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x1d0 WorkItem         : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x1f0 DomainPointer    : Ptr64 <a href="./_HALP_DMA_DOMAIN_OBJECT.html">_HALP_DMA_DOMAIN_OBJECT</a><br>
   +0x1f8 TranslationType  : <a href="./_EXT_IOMMU_TRANSLATION_TYPE.html">_EXT_IOMMU_TRANSLATION_TYPE</a><br>
   +0x1fc AdapterInUse     : UChar<br>
   +0x200 DeviceObject     : Ptr64 <a href="./_DEVICE_OBJECT.html">_DEVICE_OBJECT</a><br>
   +0x208 DeviceId         : Ptr64 <a href="./_EXT_IOMMU_DEVICE_ID.html">_EXT_IOMMU_DEVICE_ID</a><br>
   +0x210 IommuDevice      : Ptr64 Void<br>
   +0x218 ScatterGatherMdl : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x220 LowMemoryLogicalAddressBase : Uint8B<br>
   +0x228 LowMemoryLogicalAddressQueueLock : Uint8B<br>
   +0x230 LowMemoryLogicalAddressQueue : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x240 LowMemoryLogicalAddressQueueInUse : UChar<br>
   +0x248 LowMemoryLogicalAddressQueueEntry : <a href="./_HALP_EMERGENCY_LA_QUEUE_ENTRY.html">_HALP_EMERGENCY_LA_QUEUE_ENTRY</a><br>
   +0x260 AllocationState  : <a href="./_HALP_DMA_ADAPTER_ALLOCATION_STATE.html">_HALP_DMA_ADAPTER_ALLOCATION_STATE</a><br>
   +0x264 ScatterGatherBufferLength : Uint4B<br>
   +0x268 ScatterGatherBuffer : <a href="./_SCATTER_GATHER_LIST.html">_SCATTER_GATHER_LIST</a><br>
</font></body></html>