<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_ESERVERSILO_GLOBALS</h2>
<font face="arial">   +0x000 ObSiloState      : <a href="./_OBP_SILODRIVERSTATE.html">_OBP_SILODRIVERSTATE</a><br>
   +0x2e0 SeSiloState      : <a href="./_SEP_SILOSTATE.html">_SEP_SILOSTATE</a><br>
   +0x310 SeRmSiloState    : <a href="./_SEP_RM_LSA_CONNECTION_STATE.html">_SEP_RM_LSA_CONNECTION_STATE</a><br>
   +0x360 EtwSiloState     : Ptr64 <a href="./_ETW_SILODRIVERSTATE.html">_ETW_SILODRIVERSTATE</a><br>
   +0x368 MiSessionLeaderProcess : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x370 ExpDefaultErrorPortProcess : Ptr64 <a href="./_EPROCESS.html">_EPROCESS</a><br>
   +0x378 ExpDefaultErrorPort : Ptr64 Void<br>
   +0x380 HardErrorState   : Uint4B<br>
   +0x388 ExpLicenseState  : Ptr64 <a href="./_EXP_LICENSE_STATE.html">_EXP_LICENSE_STATE</a><br>
   +0x390 WnfSiloState     : <a href="./_WNF_SILODRIVERSTATE.html">_WNF_SILODRIVERSTATE</a><br>
   +0x3c8 DbgkSiloState    : <a href="./_DBGK_SILOSTATE.html">_DBGK_SILOSTATE</a><br>
   +0x3e8 PsProtectedCurrentDirectory : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x3f8 PsProtectedEnvironment : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x408 ApiSetSection    : Ptr64 Void<br>
   +0x410 ApiSetSchema     : Ptr64 Void<br>
   +0x418 OneCoreForwardersEnabled : UChar<br>
   +0x420 NtSystemRoot     : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x430 SiloRootDirectoryName : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x440 Storage          : Ptr64 <a href="./_PSP_STORAGE.html">_PSP_STORAGE</a><br>
   +0x448 State            : <a href="./_SERVERSILO_STATE.html">_SERVERSILO_STATE</a><br>
   +0x44c ExitStatus       : Int4B<br>
   +0x450 DeleteEvent      : Ptr64 <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x458 UserSharedData   : Ptr64 <a href="./_SILO_USER_SHARED_DATA.html">_SILO_USER_SHARED_DATA</a><br>
   +0x460 UserSharedSection : Ptr64 Void<br>
   +0x468 TerminateWorkItem : <a href="./_WORK_QUEUE_ITEM.html">_WORK_QUEUE_ITEM</a><br>
   +0x488 IsDownlevelContainer : UChar<br>
</font></body></html>