<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_ETW_GUID_ENTRY</h2>
<font face="arial">   +0x000 GuidList         : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 SiloGuidList     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 RefCount         : Int8B<br>
   +0x028 Guid             : <a href="./_GUID.html">_GUID</a><br>
   +0x038 RegListHead      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 SecurityDescriptor : Ptr64 Void<br>
   +0x050 LastEnable       : <a href="./_ETW_LAST_ENABLE_INFO.html">_ETW_LAST_ENABLE_INFO</a><br>
   +0x050 MatchId          : Uint8B<br>
   +0x060 ProviderEnableInfo : <a href="./_TRACE_ENABLE_INFO.html">_TRACE_ENABLE_INFO</a><br>
   +0x080 EnableInfo       : [8] <a href="./_TRACE_ENABLE_INFO.html">_TRACE_ENABLE_INFO</a><br>
   +0x180 FilterData       : Ptr64 <a href="./_ETW_FILTER_HEADER.html">_ETW_FILTER_HEADER</a><br>
   +0x188 SiloState        : Ptr64 <a href="./_ETW_SILODRIVERSTATE.html">_ETW_SILODRIVERSTATE</a><br>
   +0x190 HostEntry        : Ptr64 <a href="./_ETW_GUID_ENTRY.html">_ETW_GUID_ENTRY</a><br>
   +0x198 Lock             : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x1a0 LockOwner        : Ptr64 <a href="./_ETHREAD.html">_ETHREAD</a><br>
</font></body></html>