<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_HALP_DMA_CONTROLLER</h2>
<font face="arial">   +0x000 Controllers      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 AdapterList      : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x020 ControllerId     : Uint4B<br>
   +0x024 MinimumRequestLine : Uint4B<br>
   +0x028 MaximumRequestLine : Uint4B<br>
   +0x02c ChannelCount     : Uint4B<br>
   +0x030 ScatterGatherLimit : Uint4B<br>
   +0x038 Channels         : Ptr64 <a href="./_HALP_DMA_CHANNEL.html">_HALP_DMA_CHANNEL</a><br>
   +0x040 ExtensionData    : Ptr64 Void<br>
   +0x048 CacheCoherent    : UChar<br>
   +0x04c DmaAddressWidth  : Uint4B<br>
   +0x050 Operations       : <a href="./_DMA_FUNCTION_TABLE.html">_DMA_FUNCTION_TABLE</a><br>
   +0x0a0 SupportedPortWidths : Uint4B<br>
   +0x0a4 MinimumTransferUnit : Uint4B<br>
   +0x0a8 Lock             : Uint8B<br>
   +0x0b0 Irql             : UChar<br>
   +0x0b1 GeneratesInterrupt : UChar<br>
   +0x0b4 Gsi              : Int4B<br>
   +0x0b8 InterruptPolarity : <a href="./_KINTERRUPT_POLARITY.html">_KINTERRUPT_POLARITY</a><br>
   +0x0bc InterruptMode    : <a href="./_KINTERRUPT_MODE.html">_KINTERRUPT_MODE</a><br>
   +0x0c0 ResourceId       : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x0d0 PowerHandle      : Ptr64 <a href="./POHANDLE__.html">POHANDLE__</a><br>
   +0x0d8 PowerActive      : UChar<br>
</font></body></html>