<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_KSCHEDULING_GROUP</h2>
<font face="arial">   +0x000 Policy           : <a href="./_KSCHEDULING_GROUP_POLICY.html">_KSCHEDULING_GROUP_POLICY</a><br>
   +0x008 RelativeWeight   : Uint4B<br>
   +0x00c ChildMinRate     : Uint4B<br>
   +0x010 ChildMinWeight   : Uint4B<br>
   +0x014 ChildTotalWeight : Uint4B<br>
   +0x018 QueryHistoryTimeStamp : Uint8B<br>
   +0x020 NotificationCycles : Int8B<br>
   +0x028 MaxQuotaLimitCycles : Int8B<br>
   +0x030 MaxQuotaCyclesRemaining : Int8B<br>
   +0x038 SchedulingGroupList : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x038 Sibling          : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x048 NotificationDpc  : Ptr64 <a href="./_KDPC.html">_KDPC</a><br>
   +0x050 ChildList        : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x060 Parent           : Ptr64 <a href="./_KSCHEDULING_GROUP.html">_KSCHEDULING_GROUP</a><br>
   +0x080 PerProcessor     : [1] <a href="./_KSCB.html">_KSCB</a><br>
</font></body></html>