<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_MI_VISIBLE_STATE</h2>
<font face="arial">   +0x000 SessionWsList    : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x010 SessionIdBitmap  : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x018 PagedPoolInfo    : <a href="./_MM_PAGED_POOL_INFO.html">_MM_PAGED_POOL_INFO</a><br>
   +0x030 MaximumNonPagedPoolInPages : Uint8B<br>
   +0x038 SizeOfPagedPoolInPages : Uint8B<br>
   +0x040 SystemPteInfo    : <a href="./_MI_SYSTEM_PTE_TYPE.html">_MI_SYSTEM_PTE_TYPE</a><br>
   +0x0a0 NonPagedPoolCommit : Uint8B<br>
   +0x0a8 SmallNonPagedPtesCommit : Uint8B<br>
   +0x0b0 BootCommit       : Uint8B<br>
   +0x0b8 MdlPagesAllocated : Uint8B<br>
   +0x0c0 SystemPageTableCommit : Uint8B<br>
   +0x0c8 ProcessCommit    : Uint8B<br>
   +0x0d0 DriverCommit     : Int4B<br>
   +0x0d4 PagingLevels     : UChar<br>
   +0x0d8 PfnDatabaseCommit : Uint8B<br>
   +0x100 SystemWs         : [6] <a href="./_MMSUPPORT_FULL.html">_MMSUPPORT_FULL</a><br>
   +0x880 SystemCacheShared : <a href="./_MMSUPPORT_SHARED.html">_MMSUPPORT_SHARED</a><br>
   +0x900 AggregateSystemWs : [1] <a href="./_MMSUPPORT_AGGREGATION.html">_MMSUPPORT_AGGREGATION</a><br>
   +0x920 MapCacheFailures : Uint4B<br>
   +0x928 PagefileHashPages : Uint8B<br>
   +0x930 PteHeader        : <a href="./_SYSPTES_HEADER.html">_SYSPTES_HEADER</a><br>
   +0xa48 SystemVaTypeCount : [16] Uint8B<br>
   +0xac8 SystemVaType     : [256] UChar<br>
   +0xbc8 SystemVaRegions  : [13] <a href="./_MI_SYSTEM_VA_ASSIGNMENT.html">_MI_SYSTEM_VA_ASSIGNMENT</a><br>
</font></body></html>