<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_OBJECT_TYPE_INITIALIZER</h2>
<font face="arial">   +0x000 Length           : Uint2B<br>
   +0x002 ObjectTypeFlags  : Uint2B<br>
   +0x002 CaseInsensitive  : Pos 0, 1 Bit<br>
   +0x002 UnnamedObjectsOnly : Pos 1, 1 Bit<br>
   +0x002 UseDefaultObject : Pos 2, 1 Bit<br>
   +0x002 SecurityRequired : Pos 3, 1 Bit<br>
   +0x002 MaintainHandleCount : Pos 4, 1 Bit<br>
   +0x002 MaintainTypeList : Pos 5, 1 Bit<br>
   +0x002 SupportsObjectCallbacks : Pos 6, 1 Bit<br>
   +0x002 CacheAligned     : Pos 7, 1 Bit<br>
   +0x003 UseExtendedParameters : Pos 0, 1 Bit<br>
   +0x003 Reserved         : Pos 1, 7 Bits<br>
   +0x004 ObjectTypeCode   : Uint4B<br>
   +0x008 InvalidAttributes : Uint4B<br>
   +0x00c GenericMapping   : <a href="./_GENERIC_MAPPING.html">_GENERIC_MAPPING</a><br>
   +0x01c ValidAccessMask  : Uint4B<br>
   +0x020 RetainAccess     : Uint4B<br>
   +0x024 PoolType         : <a href="./_POOL_TYPE.html">_POOL_TYPE</a><br>
   +0x028 DefaultPagedPoolCharge : Uint4B<br>
   +0x02c DefaultNonPagedPoolCharge : Uint4B<br>
   +0x030 DumpProcedure    : Ptr64     void <br>
   +0x038 OpenProcedure    : Ptr64     long <br>
   +0x040 CloseProcedure   : Ptr64     void <br>
   +0x048 DeleteProcedure  : Ptr64     void <br>
   +0x050 ParseProcedure   : Ptr64     long <br>
   +0x050 ParseProcedureEx : Ptr64     long <br>
   +0x058 SecurityProcedure : Ptr64     long <br>
   +0x060 QueryNameProcedure : Ptr64     long <br>
   +0x068 OkayToCloseProcedure : Ptr64     unsigned char <br>
   +0x070 WaitObjectFlagMask : Uint4B<br>
   +0x074 WaitObjectFlagOffset : Uint2B<br>
   +0x076 WaitObjectPointerOffset : Uint2B<br>
</font></body></html>