<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_POP_IO_INFO</h2>
<font face="arial">   +0x000 DumpMdl          : Ptr64 <a href="./_MDL.html">_MDL</a><br>
   +0x008 IoStatus         : <a href="./_POP_IO_STATUS.html">_POP_IO_STATUS</a><br>
   +0x010 IoStartCount     : Uint8B<br>
   +0x018 IoBytesCompleted : Uint8B<br>
   +0x020 IoBytesInProgress : Uint8B<br>
   +0x028 RequestSize      : Uint8B<br>
   +0x030 IoLocation       : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x038 FileOffset       : Uint8B<br>
   +0x040 Buffer           : Ptr64 Void<br>
   +0x048 AsyncCapable     : UChar<br>
   +0x050 BytesToRead      : Uint8B<br>
   +0x058 Pages            : Uint4B<br>
   +0x060 HighestChecksumIndex : Uint8B<br>
   +0x068 PreviousChecksum : Uint2B<br>
</font></body></html>