<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_WHEA_XPF_MCA_SECTION</h2>
<font face="arial">   +0x000 VersionNumber    : Uint4B<br>
   +0x004 CpuVendor        : <a href="./_WHEA_CPU_VENDOR.html">_WHEA_CPU_VENDOR</a><br>
   +0x008 Timestamp        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x010 ProcessorNumber  : Uint4B<br>
   +0x014 GlobalStatus     : <a href="./_MCG_STATUS.html">_MCG_STATUS</a><br>
   +0x01c InstructionPointer : Uint8B<br>
   +0x024 BankNumber       : Uint4B<br>
   +0x028 Status           : <a href="./_MCI_STATUS.html">_MCI_STATUS</a><br>
   +0x030 Address          : Uint8B<br>
   +0x038 Misc             : Uint8B<br>
   +0x040 ExtendedRegisterCount : Uint4B<br>
   +0x044 ApicId           : Uint4B<br>
   +0x048 ExtendedRegisters : [24] Uint8B<br>
   +0x048 AMDExtendedRegisters : <a href="./_WHEA_AMD_EXTENDED_REGISTERS.html">_WHEA_AMD_EXTENDED_REGISTERS</a><br>
   +0x108 GlobalCapability : <a href="./_MCG_CAP.html">_MCG_CAP</a><br>
</font></body></html>