<html><body>
<h4>Windows 10 x64 (19041.208) 2004</h4><br>
<h2>_WHEA_ERROR_RECORD_HEADER</h2>
<font face="arial">   +0x000 Signature        : Uint4B<br>
   +0x004 Revision         : <a href="./_WHEA_REVISION.html">_WHEA_REVISION</a><br>
   +0x006 SignatureEnd     : Uint4B<br>
   +0x00a SectionCount     : Uint2B<br>
   +0x00c Severity         : <a href="./_WHEA_ERROR_SEVERITY.html">_WHEA_ERROR_SEVERITY</a><br>
   +0x010 ValidBits        : <a href="./_WHEA_ERROR_RECORD_HEADER_VALIDBITS.html">_WHEA_ERROR_RECORD_HEADER_VALIDBITS</a><br>
   +0x014 Length           : Uint4B<br>
   +0x018 Timestamp        : <a href="./_WHEA_TIMESTAMP.html">_WHEA_TIMESTAMP</a><br>
   +0x020 PlatformId       : <a href="./_GUID.html">_GUID</a><br>
   +0x030 PartitionId      : <a href="./_GUID.html">_GUID</a><br>
   +0x040 CreatorId        : <a href="./_GUID.html">_GUID</a><br>
   +0x050 NotifyType       : <a href="./_GUID.html">_GUID</a><br>
   +0x060 RecordId         : Uint8B<br>
   +0x068 Flags            : <a href="./_WHEA_ERROR_RECORD_HEADER_FLAGS.html">_WHEA_ERROR_RECORD_HEADER_FLAGS</a><br>
   +0x06c PersistenceInfo  : <a href="./_WHEA_PERSISTENCE_INFO.html">_WHEA_PERSISTENCE_INFO</a><br>
   +0x074 Reserved         : [12] UChar<br>
</font></body></html>