<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_HV_PARTITION_PRIVILEGE_MASK</h2>
<font face="arial">   +0x000 AsUINT64         : Uint8B<br>
   +0x000 AccessVpRunTimeReg : Pos 0, 1 Bit<br>
   +0x000 AccessPartitionReferenceCounter : Pos 1, 1 Bit<br>
   +0x000 AccessSynicRegs  : Pos 2, 1 Bit<br>
   +0x000 AccessSyntheticTimerRegs : Pos 3, 1 Bit<br>
   +0x000 AccessIntrCtrlRegs : Pos 4, 1 Bit<br>
   +0x000 AccessHypercallMsrs : Pos 5, 1 Bit<br>
   +0x000 AccessVpIndex    : Pos 6, 1 Bit<br>
   +0x000 AccessResetReg   : Pos 7, 1 Bit<br>
   +0x000 AccessStatsReg   : Pos 8, 1 Bit<br>
   +0x000 AccessPartitionReferenceTsc : Pos 9, 1 Bit<br>
   +0x000 AccessGuestIdleReg : Pos 10, 1 Bit<br>
   +0x000 AccessFrequencyRegs : Pos 11, 1 Bit<br>
   +0x000 AccessDebugRegs  : Pos 12, 1 Bit<br>
   +0x000 AccessReenlightenmentControls : Pos 13, 1 Bit<br>
   +0x000 AccessRootSchedulerReg : Pos 14, 1 Bit<br>
   +0x000 Reserved1        : Pos 15, 17 Bits<br>
   +0x000 CreatePartitions : Pos 32, 1 Bit<br>
   +0x000 AccessPartitionId : Pos 33, 1 Bit<br>
   +0x000 AccessMemoryPool : Pos 34, 1 Bit<br>
   +0x000 AdjustMessageBuffers : Pos 35, 1 Bit<br>
   +0x000 PostMessages     : Pos 36, 1 Bit<br>
   +0x000 SignalEvents     : Pos 37, 1 Bit<br>
   +0x000 CreatePort       : Pos 38, 1 Bit<br>
   +0x000 ConnectPort      : Pos 39, 1 Bit<br>
   +0x000 AccessStats      : Pos 40, 1 Bit<br>
   +0x000 Reserved2        : Pos 41, 2 Bits<br>
   +0x000 Debugging        : Pos 43, 1 Bit<br>
   +0x000 CpuManagement    : Pos 44, 1 Bit<br>
   +0x000 ConfigureProfiler : Pos 45, 1 Bit<br>
   +0x000 AccessVpExitTracing : Pos 46, 1 Bit<br>
   +0x000 EnableExtendedGvaRangesForFlushVirtualAddressList : Pos 47, 1 Bit<br>
   +0x000 AccessVsm        : Pos 48, 1 Bit<br>
   +0x000 AccessVpRegisters : Pos 49, 1 Bit<br>
   +0x000 UnusedBit        : Pos 50, 1 Bit<br>
   +0x000 FastHypercallOutput : Pos 51, 1 Bit<br>
   +0x000 EnableExtendedHypercalls : Pos 52, 1 Bit<br>
   +0x000 StartVirtualProcessor : Pos 53, 1 Bit<br>
   +0x000 Isolation        : Pos 54, 1 Bit<br>
   +0x000 Reserved3        : Pos 55, 9 Bits<br>
</font></body></html>