<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_IOP_IRP_EXTENSION</h2>
<font face="arial">   +0x000 ExtensionFlags   : Uint2B<br>
   +0x000 Allocated        : Pos 0, 1 Bit<br>
   +0x000 PropagateId      : Pos 1, 1 Bit<br>
   +0x000 SpareBits        : Pos 2, 14 Bits<br>
   +0x002 TypesAllocated   : Uint2B<br>
   +0x004 GenericExtension : [4] UChar<br>
   +0x008 VerifierContext  : Ptr64 Void<br>
   +0x010 DiskIoAttributionHandle : Uint8B<br>
   +0x018 ActivityId       : <a href="./_GUID.html">_GUID</a><br>
   +0x028 Timestamp        : <a href="./_LARGE_INTEGER.html">_LARGE_INTEGER</a><br>
   +0x028 ZeroingOffset    : Uint4B<br>
   +0x028 FsTrackOffsetBlob : Ptr64 <a href="./_IO_IRP_EXT_TRACK_OFFSET_HEADER.html">_IO_IRP_EXT_TRACK_OFFSET_HEADER</a><br>
   +0x030 FsTrackedOffset  : Int8B<br>
   +0x028 AdapterCryptoParameters : <a href="./_IO_ADAPTER_CRYPTO_PARAMETERS.html">_IO_ADAPTER_CRYPTO_PARAMETERS</a><br>
   +0x038 DriverFlags      : <a href="./<anonymous-tag>.html"><anonymous-tag></a><br>
</font></body></html>