<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_KNODE</h2>
<font face="arial">   +0x000 IdleNonParkedCpuSet : Uint8B<br>
   +0x008 IdleSmtSet       : Uint8B<br>
   +0x010 IdleCpuSet       : Uint8B<br>
   +0x040 DeepIdleSet      : Uint8B<br>
   +0x048 IdleConstrainedSet : Uint8B<br>
   +0x050 NonParkedSet     : Uint8B<br>
   +0x058 SoftParkedSet    : Uint8B<br>
   +0x060 NonIsrTargetedSet : Uint8B<br>
   +0x068 ParkLock         : Int4B<br>
   +0x06c ThreadSeed       : Uint2B<br>
   +0x06e ProcessSeed      : Uint2B<br>
   +0x080 SiblingMask      : Uint4B<br>
   +0x088 Affinity         : <a href="./_GROUP_AFFINITY.html">_GROUP_AFFINITY</a><br>
   +0x088 AffinityFill     : [10] UChar<br>
   +0x092 NodeNumber       : Uint2B<br>
   +0x094 PrimaryNodeNumber : Uint2B<br>
   +0x096 Spare0           : Uint2B<br>
   +0x098 SharedReadyQueueMask : Uint8B<br>
   +0x0a0 StrideMask       : Uint8B<br>
   +0x0a8 ProximityId      : Uint4B<br>
   +0x0ac Lowest           : Uint4B<br>
   +0x0b0 Highest          : Uint4B<br>
   +0x0b4 MaximumProcessors : UChar<br>
   +0x0b5 Flags            : <a href="./_flags.html">_flags</a><br>
   +0x0b6 Spare10          : UChar<br>
   +0x0b8 HeteroSets       : [5] <a href="./_KHETERO_PROCESSOR_SET.html">_KHETERO_PROCESSOR_SET</a><br>
   +0x130 PpmConfiguredQosSets : [4] Uint8B<br>
   +0x150 QosGroupingSets  : <a href="./_KQOS_GROUPING_SETS.html">_KQOS_GROUPING_SETS</a><br>
   +0x160 LLCLeaders       : Uint8B<br>
</font></body></html>