<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_KRESOURCEMANAGER</h2>
<font face="arial">   +0x000 NotificationAvailable : <a href="./_KEVENT.html">_KEVENT</a><br>
   +0x018 cookie           : Uint4B<br>
   +0x01c State            : <a href="./_KRESOURCEMANAGER_STATE.html">_KRESOURCEMANAGER_STATE</a><br>
   +0x020 Flags            : Uint4B<br>
   +0x028 Mutex            : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x060 NamespaceLink    : <a href="./_KTMOBJECT_NAMESPACE_LINK.html">_KTMOBJECT_NAMESPACE_LINK</a><br>
   +0x088 RmId             : <a href="./_GUID.html">_GUID</a><br>
   +0x098 NotificationQueue : <a href="./_KQUEUE.html">_KQUEUE</a><br>
   +0x0d8 NotificationMutex : <a href="./_KMUTANT.html">_KMUTANT</a><br>
   +0x110 EnlistmentHead   : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x120 EnlistmentCount  : Uint4B<br>
   +0x128 NotificationRoutine : Ptr64     long <br>
   +0x130 Key              : Ptr64 Void<br>
   +0x138 ProtocolListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x148 PendingPropReqListHead : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x158 CRMListEntry     : <a href="./_LIST_ENTRY.html">_LIST_ENTRY</a><br>
   +0x168 Tm               : Ptr64 <a href="./_KTM.html">_KTM</a><br>
   +0x170 Description      : <a href="./_UNICODE_STRING.html">_UNICODE_STRING</a><br>
   +0x180 Enlistments      : <a href="./_KTMOBJECT_NAMESPACE.html">_KTMOBJECT_NAMESPACE</a><br>
   +0x228 CompletionBinding : <a href="./_KRESOURCEMANAGER_COMPLETION_BINDING.html">_KRESOURCEMANAGER_COMPLETION_BINDING</a><br>
</font></body></html>