<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_MI_PROBE_RAISE_TRACKER</h2>
<font face="arial">   +0x000 UserRangeInKernel : Uint4B<br>
   +0x004 FaultFailed      : Uint4B<br>
   +0x008 WriteFaultFailed : Uint4B<br>
   +0x00c LargePageFailed  : Uint4B<br>
   +0x010 UserAccessToKernelPte : Uint4B<br>
   +0x014 BadPageLocation  : Uint4B<br>
   +0x018 InsufficientCharge : Uint4B<br>
   +0x01c PageTableCharge  : Uint4B<br>
   +0x020 NoPhysicalMapping : Uint4B<br>
   +0x024 NoIoReference    : Uint4B<br>
   +0x028 ProbeFailed      : Uint4B<br>
   +0x02c PteIsZero        : Uint4B<br>
   +0x030 StrongCodeWrite  : Uint4B<br>
   +0x034 ReducedCloneCommitChargeFailed : Uint4B<br>
   +0x038 CopyOnWriteAtDispatchNoPages : Uint4B<br>
   +0x03c NoPageTablesAllowed : Uint4B<br>
   +0x040 EnclavePageFailed : Uint4B<br>
</font></body></html>