<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_MI_HARDWARE_STATE</h2>
<font face="arial">   +0x000 NodeMask         : Uint4B<br>
   +0x004 NumaHintIndex    : Uint4B<br>
   +0x008 NumaLastRangeIndexInclusive : Uint4B<br>
   +0x00c NumaTableCaptured : UChar<br>
   +0x00d NodeShift        : UChar<br>
   +0x00e ChannelShift     : UChar<br>
   +0x010 NodeGraph        : Ptr64 <a href="./_MI_NODE_NUMBER_ZERO_BASED.html">_MI_NODE_NUMBER_ZERO_BASED</a><br>
   +0x018 SystemNodeInformation : Ptr64 <a href="./_MI_SYSTEM_NODE_INFORMATION.html">_MI_SYSTEM_NODE_INFORMATION</a><br>
   +0x020 TemporaryNumaRanges : [2] <a href="./_HAL_NODE_RANGE.html">_HAL_NODE_RANGE</a><br>
   +0x040 NumaMemoryRanges : Ptr64 <a href="./_HAL_NODE_RANGE.html">_HAL_NODE_RANGE</a><br>
   +0x048 ChannelMemoryRanges : Ptr64 <a href="./_HAL_CHANNEL_MEMORY_RANGES.html">_HAL_CHANNEL_MEMORY_RANGES</a><br>
   +0x050 NumaNodeLock     : Int4B<br>
   +0x054 SecondLevelCacheSize : Uint4B<br>
   +0x058 FirstLevelCacheSize : Uint4B<br>
   +0x05c PhysicalAddressBits : Uint4B<br>
   +0x060 ProcessorCachesFlushedOnPowerLoss : UChar<br>
   +0x068 TotalPagesAllowed : Uint8B<br>
   +0x070 SecondaryColorMask : Uint4B<br>
   +0x074 SecondaryColors  : Uint4B<br>
   +0x078 FlushTbForAttributeChange : Uint4B<br>
   +0x07c FlushCacheForAttributeChange : Uint4B<br>
   +0x080 FlushCacheForPageAttributeChange : Uint4B<br>
   +0x084 CacheFlushPromoteThreshold : Uint4B<br>
   +0x0c0 InvalidPteMask   : Uint8B<br>
   +0x100 LargePageColors  : [3] Uint4B<br>
   +0x110 FlushTbThreshold : Uint8B<br>
   +0x118 OptimalZeroingAttribute : [4] [4] <a href="./_MI_PFN_CACHE_ATTRIBUTE.html">_MI_PFN_CACHE_ATTRIBUTE</a><br>
   +0x158 AttributeChangeRequiresReZero : UChar<br>
   +0x160 ZeroCostCounts   : [2] <a href="./_MI_ZERO_COST_COUNTS.html">_MI_ZERO_COST_COUNTS</a><br>
   +0x180 VsmKernelPageCount : Uint8B<br>
   +0x188 EnclaveRegions   : <a href="./_RTL_AVL_TREE.html">_RTL_AVL_TREE</a><br>
   +0x190 EnclaveMetadataPage : Ptr64 Void<br>
   +0x198 EnclaveMetadataBitMap : Ptr64 <a href="./_RTL_BITMAP.html">_RTL_BITMAP</a><br>
   +0x1a0 EnclaveMetadataEntryLock : <a href="./_EX_PUSH_LOCK.html">_EX_PUSH_LOCK</a><br>
   +0x1a8 EnclaveMetadataPageLock : Int4B<br>
</font></body></html>