<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_MM_GRAPHICS_VAD_FLAGS</h2>
<font face="arial">   +0x000 Lock             : Pos 0, 1 Bit<br>
   +0x000 LockContended    : Pos 1, 1 Bit<br>
   +0x000 DeleteInProgress : Pos 2, 1 Bit<br>
   +0x000 NoChange         : Pos 3, 1 Bit<br>
   +0x000 VadType          : Pos 4, 3 Bits<br>
   +0x000 Protection       : Pos 7, 5 Bits<br>
   +0x000 PreferredNode    : Pos 12, 6 Bits<br>
   +0x000 PageSize         : Pos 18, 2 Bits<br>
   +0x000 PrivateMemoryAlwaysSet : Pos 20, 1 Bit<br>
   +0x000 WriteWatch       : Pos 21, 1 Bit<br>
   +0x000 FixedLargePageSize : Pos 22, 1 Bit<br>
   +0x000 ZeroFillPagesOptional : Pos 23, 1 Bit<br>
   +0x000 GraphicsAlwaysSet : Pos 24, 1 Bit<br>
   +0x000 GraphicsUseCoherentBus : Pos 25, 1 Bit<br>
   +0x000 GraphicsPageProtection : Pos 26, 3 Bits<br>
</font></body></html>