<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>_WHEA_PROCESSOR_GENERIC_ERROR_SECTION</h2>
<font face="arial">   +0x000 ValidBits        : <a href="./_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS.html">_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS</a><br>
   +0x008 ProcessorType    : UChar<br>
   +0x009 InstructionSet   : UChar<br>
   +0x00a ErrorType        : UChar<br>
   +0x00b Operation        : UChar<br>
   +0x00c Flags            : UChar<br>
   +0x00d Level            : UChar<br>
   +0x00e Reserved         : Uint2B<br>
   +0x010 CPUVersion       : Uint8B<br>
   +0x018 CPUBrandString   : [128] UChar<br>
   +0x098 ProcessorId      : Uint8B<br>
   +0x0a0 TargetAddress    : Uint8B<br>
   +0x0a8 RequesterId      : Uint8B<br>
   +0x0b0 ResponderId      : Uint8B<br>
   +0x0b8 InstructionPointer : Uint8B<br>
</font></body></html>