<html><body>
<h4>Windows 10 x64 (18363.476)</h4><br>
<h2>wil_details_FeatureProperties</h2>
<font face="arial">   +0x000 enabledState     : Pos 0, 2 Bits<br>
   +0x000 isVariant        : Pos 2, 1 Bit<br>
   +0x000 queuedForReporting : Pos 3, 1 Bit<br>
   +0x000 hasNotificationState : Pos 4, 2 Bits<br>
   +0x000 usageCount       : Pos 6, 9 Bits<br>
   +0x000 usageCountRepresentsPotential : Pos 15, 1 Bit<br>
   +0x000 reportedDeviceUsage : Pos 16, 1 Bit<br>
   +0x000 reportedDevicePotential : Pos 17, 1 Bit<br>
   +0x000 reportedDeviceOpportunity : Pos 18, 1 Bit<br>
   +0x000 reportedDevicePotentialOpportunity : Pos 19, 1 Bit<br>
   +0x000 recordedDeviceUsage : Pos 20, 1 Bit<br>
   +0x000 recordedDevicePotential : Pos 21, 1 Bit<br>
   +0x000 recordedDeviceOpportunity : Pos 22, 1 Bit<br>
   +0x000 recordedDevicePotentialOpportunity : Pos 23, 1 Bit<br>
   +0x000 opportunityCount : Pos 24, 7 Bits<br>
   +0x000 opportunityCountRepresentsPotential : Pos 31, 1 Bit<br>
</font></body></html>